{"name": "Counter-Strike", "app_id": "10", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£7.19", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 31671, "negative_reviews": 1094, "reviews": [["\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☑ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☑ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10", 0.7982611656188965], ["Best game of all time. Low system requirements, highly competitive. Good fun with friends.\nCheaters are the main problem", 0.5788130164146423], ["its a really good game and fun really but there is one thing.... They are cheating and rebellious, and chaos is prevailing everywhere and any server is full😐😐😐", 0.5454545617103577], ["Even without mods and plugins its way better than I remember. Way less clunkier than todays games, it feels snappy, TIGHT to play this. The atmosphere is something else that haven't been matched in any other game. A mist between arcade and realism.", 0.5199999809265137], ["Still a pretty decent game, however the only thing it really prevails at anymore is its nostalgia factor which keeps me coming back. The funny thing is its probably better than CS2 at this point. Still worth the buy though.", 0.5081967115402222], ["To me, Counter-Strike 1.6 remains one of the greatest games ever made. It wasn't just a game - it was an era, a vibe, and a shared experience that still resonates deeply with me. I’ll never forget the first time I saw a friend playing on de_aztec - my eyes lit up with pure excitement. And of course, who could forget the legendary de_dust2? That map is etched into the memory of every player who grew up in that golden age.\n\nEven after playing every single Counter-Strike title that came after, 1.6 holds a special place in my heart. The newer versions might be more polished, with shinier graphics and modern features, but the raw, competitive spirit of Counter-Strike lives in its original form. There was something magical about the simplicity, the strategy, and the intense teamplay.\n\nBack then, before Discord became the norm, we had our trusty tools - mIRC, Ventrilo, and Teamspeak. These platforms were the lifelines of team coordination, trash talk, and camaraderie. It was all part of the experience, and it made the matches even more memorable.\n\nCounter-Strike 1.6 wasn't just a game - it was the start of something incredible. And for me, it always will be.", 0.5], ["Classic FPS. For me it's way better than the latest installments of the game.", 0.5], ["Its really addicting and nostalgic and it is nice buying it after years of pirating it, this game used to be the hype in 2012-2016, there wasnt a single laptop in our house that didnt have it. my older brothers first instinct was always to download counter strike. its even more fun 1v1 your friends.", 0.5], ["Classic game, brings back so many memories.", 0.5], ["In what other game can you join a server with everyone speaking Bulgarian and one player named \"Glory to Ukraine\"", 0.5], ["My childhood game. Great memories alongside broken monitors!", 0.5], ["best game ever way better than cs2\r\n\r\nswitch from cs2 to cs1 pls", 0.5], ["I don't play this game but the SOUNDS. The Sounds are so good, it is unbelivable.", 0.5], ["pretty good game, just full of mexicans and old dudes", 0.5], ["It is an amazing game even now, although with relatively bad graphics, the teammates' radio and the gun types all made this game realistic and enjoyable", 0.5], ["Great fucking game i think css is a bit better but amazing", 0.5], ["Rating: 8.5/10\r\n\r\nCounter-Strike 1.6 is the FPS that defined competitive shooters, setting the foundation for tactical gameplay and esports. Its fast-paced, skill-driven mechanics make every kill satisfying, and its legendary maps—Dust2, Inferno, Nuke—are still among the best in the genre.\r\n\r\nThe gunplay is tight, with a high skill ceiling due to unique recoil patterns and movement mechanics like strafing and bunny-hopping. However, it’s also brutally unforgiving, making it difficult for new players to get into. Graphics are obviously outdated, but the simplicity keeps the focus on gameplay rather than flashy visuals.\r\n\r\nThat said, CS 1.6 isn’t without flaws. Hit registration can feel inconsistent, and cheaters were always a problem in public servers. The lack of built-in matchmaking means finding balanced games relies on third-party services.\r\n\r\nDespite its age, Counter-Strike 1.6 remains a nostalgic and highly competitive shooter. While CS:GO and CS2 have modernized the formula, this classic still holds up for those who appreciate raw, no-frills FPS action.", 0.5], ["do drugs and join zm servers 10/10 would recommend would do again\r\ncon: I somehow banged my dog while doing the things specified above\r\n(the dog is ok, just a little bit bigger asshole)", 0.49714285135269165], ["сама крута игра если слабый пк советую раньше хател в кс го поиграть но слабый пк был и в ету игру играл у меня шас норм пк но все равно в эту играю потому што скачиватьс ядолга будет интернет плахой кароче имба игра всем саветую", 0.4761904776096344], ["atleast it’s not so competitive like Counter Strike: Global Offensive/Counter Strike 2. Overall it’s a fun game if you want a classic experience and a game that is able to run on a 1979 computer", 0.47413790225982666]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/10/header.jpg?t=1745368572", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/10/capsule_231x87.jpg?t=1745368572", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/10/capsule_184x69.jpg?t=1745368572"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Valve", "owners": "10,000,000 .. 20,000,000", "tags": ["Action", "FPS", "Multiplayer", "Shooter", "Classic", "Team-Based", "First-Person", "Competitive", "Tactical", "1990's", "e-sports", "PvP", "Old School", "Military", "Strategy", "Survival", "Score Attack", "1980s", "Assassin", "Nostalgia"], "languages": ["English", " French", " German", " Italian", " Spanish - Spain", " Simplified Chinese", " Traditional Chinese", " Korean"], "concurrent_plays": 13613, "number_of_achievements": null, "categories": ["Multi-player", "PvP", "Online PvP", "Shared/Split Screen PvP", "Valve Anti-Cheat enabled", "Family Sharing"], "genres": ["Action"], "short_description": "Play the world's number 1 online action game. Engage in an incredibly realistic brand of terrorist warfare in this wildly popular team-based game. Ally with teammates to complete strategic missions. Take out enemy sites. Rescue hostages. Your role affects your team's success. Your team's success affects your role.", "long_description": null}