{"name": "Hellsplit: Arena", "app_id": 1039880, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£19.49", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 19, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 2539, "negative_reviews": 462, "reviews": [["I've now played both B&S, and Hellsplit Arena. And my Official opinion is the following\n\nThe Modding Department of B&S is definitely by far superior. Although the combat of the game severely lacks any sort of challenge. It's violence is also rather lacking without mods imo.\n\nWith that said, Comparing it to something like Hellsplit, The violence in this game is insanely good. Dismembering has alot more options as well in comparison to B&S. The Combat is very Progressive and the AI actually reacts reasonably to whatever you do (for the most part).\n\nNow what i really do not like as of right now, is the fact that you cannot use Mods in the campaign itself. That is a very huge flaw in my honest opinion. i really wish, and also hope that the Devs will make it so that Mods are available during the normal campaign as well. This is something that has kept me in B&S for a very long time, the sheer amount of possibilities and mods i was able to use even during the crystal hunt mode (which is technically the Campaign of B&S now) is just simply incredible.\n\ni sadly do not feel the same with HSA. Due to it's very much lacking mod department for the Campaign itself, i feel like it'll get boring extremely quickly once you're done with the hard mode as well. unless of course you don't mind replaying the same game over and over again but with absolutely 0 changes outside of the challenges you may give yourself.\n\nThis game has some insane Potential to Rival B&S, if not even Surpassing it in almost every way! Just please, let me use the mods in the campaign. that alone would make me stay much longer than i have right now.\n\nwith all that said, my complete Rating for the game is : 7.5/10. \nThe game Itself is a 10/10, but with no Mods in Campaign, sadly that reduces it by a 2.5.\n\nDefinitely worth buying even without a discount, but it still needs some overall improvements here and there. Which i hope they'll do in the future.", 0.558394193649292], ["Pretty fun, skeletons as an enemy are kind of boring to fight though.", 0.523809552192688], ["Good game my type with the gore. The gore is a pretty good feature of the game especially with ripping heads off and ripping out hearts, and the details of the ripped off limbs, and heads, its all great but cant wait for more customization for PCVR. I personally enjoy when there are lots of different types of accessories and clothing, and since there are supposed to be many customization options soon so I'm pretty excited for 1.3. (side note I'm talking about customizing the character with tattoos changing hair that stuff) In my personal opinion it is worth it and if you're like me def worth it when customization happens.", 0.523809552192688], ["i refunded this about a year ago but ive decided to give it another try. The mod support is a game changer. i played resident evil 4, silent hill, lived as batman. and dont forget how beautifully full fledged the combat is. the best feeling melee in any vr game hands down.", 0.5], ["Such an amazing game absolutely incredible and really fun!", 0.5], ["the physics impacts arent very responsive half the time im just sliding my weapons against enemies without any physical damage its uncomfortable to swing weapons in general ill play again when sandbox comes out", 0.5], ["Got it because I had been told by my friends that the combat is amazing and so are the graphics. Not even 10 minutes in from playing I regret buying this game.", 0.4761904776096344], ["good practice for beheading luh foenems doing the fent fold in baltimore on sharquition parveez soul amen", 0.4590776562690735], ["this game has the worst physics ever and you die randomly -50/10 dont by this garbage.", 0.38461539149284363], ["as it turns out, ripping a guy's heart out will not make him your friend.", 0.4829545319080353], ["Fun and pretty", 0.4829545319080353], ["i hate this game. nice game btw", 0.47826087474823], ["nice", 0.5], ["fun", 0.5], ["i saw this game in late 2019 2020 and i know i had to get it", 0.5], ["cool game", 0.5], ["Meh...\r\n2.4/10.", 0.36181047558784485], ["sword", 0.47445255517959595], ["ytr567xc,.", 0.3353229761123657]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1039880/header.jpg?t=1729058300", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1039880/capsule_231x87.jpg?t=1729058300", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1039880/capsule_184x69.jpg?t=1729058300"}, "support": {"support_website": null, "support_email": null, "game_website": "http://hellsplit.com"}, "developer": "Deep Type Games", "owners": "200,000 .. 500,000", "tags": ["VR", "Action", "Gore", "RPG", "Swordplay", "Dark Fantasy", "Medieval", "Fantasy", "First-Person", "Horror", "Violent", "Singleplayer", "Sandbox", "FPS", "Souls-like", "Funny", "Zombies", "Moddable", "Physics", "Action RPG"], "languages": ["English"], "concurrent_plays": 16, "number_of_achievements": 16, "categories": ["Single-player", "Tracked Controller Support", "VR Only", "Family Sharing"], "genres": ["Action", "RPG"], "short_description": "VR horror-slasher with physically correct combat system and dynamic battles across arenas in the dark fantasy world.", "long_description": null}