{"name": "Crime Scene Cleaner", "app_id": 1040200, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£17.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 8752, "negative_reviews": 167, "reviews": [["Loved everything about this game, I need more honestly! Game play is great and easy to use all the game mechanics. The only thing I wish was in the game was the use of the money, you do all of this to pay for the characters daughters medical bills. It would've been cool to actually have the money go towards that, which motivates you to steal as much money as possible. How it is now makes the money pretty pointless, other than that its an excellent game, and left me wanting way more!\r\n", 0.7291852831840515], ["i love cleaning games (i say as i left my own room in a constant state of mess)\n\non a serious note i didnt expect there to be an element of horror in it and i thought it was gonna be a chill game (bringing dead bodies and scrubbing blood? chill?) overall i had a good time in this game and i tune to this game to relax once in a while. helps with the anxiety.", 0.6488240957260132], ["Surprisingly fun game - quality is higher than I expected for an indie game. Definitely worth it.", 0.5783172845840454], ["Viscera Cleanup Detail if it merged with Thief Simulator.  Very good game and definitely can't wait for the nightmare challenges.", 0.5754026770591736], ["Ever wanted to play a game where you're mopping up blood and secrets? In crime scene cleaner you are cleaning up crime scenes for shady clients. When it comes to cleaning, it can be pretty relaxing and is a good game to play if you're trying to escape from reality for a bit. Similar to House Flipper, it's cleaning mechanics make it very therapeutic. Imagine you think you're going to a basic cleaning job and then all of a sudden you're finding yourself in a crime scene. There's a huge museum that will definitely allow you to get your cleaning fix in. I went into it not knowing much about the game and was surprised by a few story elements but also became more interested in it. The story wraps itself up well and is very replayable. If you love simulator games with a side of suspense and a gripping story, this one's a must play!", 0.5454545617103577], ["Wow. Just wow. \n\nWhen you first walk into the crime scenes, you don't know what to expect, and that idea carries on through-out the game as it gets more difficult, detailed and better (which i do love). The game is very gory but that makes it a good game because all crime scenes are obviously going to be horrific, this just shows some of the reality of it which I love. I absolutely love crime and it makes me so interested, this game had just infact increased those intrigues. The quality of the game is great, especially the graphics of it as it gets deep quickly.\n\nWhat also makes the game amazing is the massive story-line. If it wasn't for the story-line I don't think I would've loved it as much as I do. Because of how good the crime scenes are, having a backstory to it makes it more interesting and even with the evidence - it adds even more to the story and sometimes even a twist. The cleaner's backstory isn't said much but you can kind of gather whats happened and it is upsetting but it suits the game. The story-line makes the whole game make more sense so instead of just doing the cleaning and then immediately going to another one like a simulation, you actually get more backstory of the crimes or more backstory of the cleaner which I love!!!\n\nThis game is perfect in my opinion, it has everything. It has the graphics, the story-line, controls, the lot you'd expect from a game. Although it has many levels, I think the devs should add more because it would make the game better. It kind of cuts it short which I didn't expect (as I said before, adds unexpected twists in the game) so I kind of do hope they bring out a part 2 to the game with a different cleaner or they bring a new character into the game to add more levels. But because the levels have so much to it like you have to collect evidence, clean up the place, you even can find secrets or soundtracks, it does benefit the game because it draws you in and it makes you more interested so you play even more.\n\nOverall, I love this game, it is a brilliant game and it is DEFINITELY a need/must have if you love crime scenes or cleaning games.", 0.5454545617103577], ["[b]Amazing game![/b]\nWas recommended to me and I went in blind, so I was surprised by it having an actual story line and great voice acting.\nLove the feeling that being thorough would be rewarded with items and secrets, every map had a personality!\nThe music tape selection was phenomenal and put me on to some bands.\nWhole campaign as it stands at this review took me almost 27 hours.\nOverall a very enjoyable experience and am looking forward to more!", 0.5454545617103577], ["Buy it, buy it, buy it!\nThis is a very addicting game. Crime Scene Cleaner is the kind of game you just can't close, you start playing for 5 minutes, and suddenly 6 hours have passed without you even noticing. You clean up blood, move dead bodies, throw away trash, and yet somehow it’s incredibly relaxing and very satisfying too. You upgrade your tools at a very reasonable pace. And, it also has a great sense of humor and a basic (but not bad) story.\n\nYou get at least 20 hours of gameplay, and much more if you want to complete all the achievements and find every secret and hidden tape.\nThere are at least 10 missions, and you can easily spend 1 to 2 hours on each one depending on how perfectly you want to finish it. I played it when it first came out and put at least 25 hours into it. And now, more hours will be added with the upcoming Nightmare and True Cleaner modes (different versions of the existing mission, with a slightly different story and gameplay)which I tried and it's great ! \nI highly recommand this game !", 0.541284441947937], ["This game feels like home. Like a cozy cup of coffee by the fire during the holidays, with a little lofi playing in the background. Cleaning up crime scenes is oddly satisfying, especially dragging each and every body back to the truck like a proud little murder janitor.\n\nThe UV light became my best friend. I only wish there were more secret rooms in each level. Those were my favorite part! Nothing says comfort like uncovering something deeply unsettling. It's giving cozy corpse core.", 0.523809552192688], ["Fantastic game, I just finished it and hadn't played it in a few days just because I didn't want the game to finish! That's always a good place to be with games but I genuinely hope the devs keep pumping out more levels, I know you guys are working on some sort of lab but no need to complicate it much and no need to tie it to a heavily developed narrative. It's great but I think just having other crime scenes to clean up, even if they dont fit the narrative would be great!", 0.523809552192688], ["Addictive. More fun than I imagined. Just wanted to try it, and got stuck.", 0.523809552192688], ["Great game, it's like power wash simulator but with dead bodies and blood. Love the secrets and small storylines for each crime scene 10/10 would recommend even though I kept making a mess by spilling the water bucket like 50 times", 0.523809552192688], ["Damn I did not expect this.\n\n3 days ago I was unsure whether I would like this game, but then a friend of mine recommended it to me. I wanted to give the game a chance and HOLY MOLY, I didn't think I would be so hooked. I spent the last 2 nights just telling myself \"just one more room\" or \"just one more spot\" but I couldn't stop. If you're even thinking about buying this game, just buy it. It's so much fun to clean up crime scenes and I hope this game gets many more updates with new crime scenes!", 0.523809552192688], ["hands down the best cleaning game i've played. i wish there weren't ai resources in the game but if you can look past that, the gameplay and story telling are really enjoyable. devs, please use the success of this game to replace the AI elements. it really brings down the quality of the experience you guys have made </3", 0.52173912525177], ["10/10 will play again, Great Game. Cant wait for some Updates and DLCs. Replayability to hit different tasks and achievements. Its well worth the price!! If your not sure try the demo. Now get to scrubbing!", 0.5160866379737854], ["SUCH A GOOD GAME IM REALLY SAD THAT IT ENDED ;((( i finished this game within a month and a half but such a good and amazing game", 0.5652173757553101], ["Surprisingly Good. The mechanics for the cleaning are good and intuitive and the story adds to the game's setting.", 0.5081967115402222], ["Great Game, similar to Viscera Cleanup Detail. Sadly it's missing coop, otherwise it would be perfect.", 0.5013293027877808], ["I really enjoy Crime Scene Cleaner! Im so ready for the \"Nightmare\" Update!! Ive put in 157.1 hours so far and still going. I love it", 0.5], ["Game is very good. Very satisfying. Its not at all what I thought it was initially.. TINY SPOILER.. its not a crime scene like you think. You're not working for the good guys. What makes the game really good is the story of each scene and the cleaners story. Super interesting, and the mission stories pull you in. Some are super sad. The cleaning gets a little repetitive but not enough so that it makes you not wanna play. The upgrades make it not so bad. There are a few things I wish the game hadn't skipped on however. I wish there was more depth in regards to what you do with the things you clean up. How you dispose of them I mean. Trying not to give too much away. Also, having almost finished the game in nearly 10 hours of playtime, I don't like that the money I've earned seems pointless in the sense that you don't spend it on upgrades. I was hoping to get a new car to use at the crime scenes, or maybe upgrade my house, or physically spend on what the story says you're collecting the money for. Something.. I enjoy the humor of the game. The cleaner has some good one liners, for sure. And Dexter is wonderful. That's all I can think of to say. Other than the \"Haunted Manor\" mission.. dude. F--- that mission. A tip, I'd upgrade your skills evenly. I invested my skill points heavily into one category and really felt the pain of having to haul trash bags to my truck every three seconds. The cleaning went super fast but jeez.. 15 trips to my truck and a long walk to boot. Great game overall! 10/10", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1040200/header.jpg?t=1744843823", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1040200/capsule_231x87.jpg?t=1744843823", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1040200/capsule_184x69.jpg?t=1744843823"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "President Studio", "owners": "500,000 .. 1,000,000", "tags": ["Simulation", "Crime", "Gore", "Singleplayer", "First-Person", "Relaxing", "Mature", "Action", "Atmospheric", "Adventure", "Funny", "Realistic", "Exploration", "Life Sim", "Indie", "Stealth", "Walking Simulator", "Violent", "Heist", "Hacking"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Simplified Chinese", " Polish", " Russian", " Portuguese - Brazil", " Turkish", " Japanese", " Korean", " Traditional Chinese", " Czech", " Dutch", " Portuguese - Portugal"], "concurrent_plays": 1251, "number_of_achievements": 50, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Simulation"], "short_description": "Once you get tangled with the mob, you will forever be a part of the mob. At least they pay a decent salary and all you have to do is clean up after their dirty work, but you know what you’re doing. So clean crime scenes, earn as much money as you can, and get ready for the next mission.", "long_description": null}