{"name": "Terraria", "app_id": "105600", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£8.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 540826, "negative_reviews": 12579, "reviews": [["Terraria starts off as this humble 2D sandbox game about digging, crafting, and fighting, but once you throw mods into the mix, it transforms into an absolute monster of creativity and chaos—especially if you’re brave enough to tackle the Calamity Mod.\n\nAt its core, Terraria is a game about exploring a massive world, gathering resources, and facing off against waves of increasingly bizarre enemies. But once you dip your toes into the modding scene, the world expands to infinite proportions. Calamity Mod is the be-all-end-all expansion that turns your Terraria world into a living nightmare of epic bosses, new biomes, insane loot, and a whole new level of difficulty. Want to battle gods, summon ancient celestial entities, and break your controller over insanely tough bosses? Calamity’s got you.\n\nWithout mods, Terraria is already addictive enough with its endless crafting, treasure hunting, and massive bosses. But with Calamity, you're not just fighting the regular Eye of Cthulhu—you’re fighting Calamitas, Supreme Calamitas, Providence, the Profaned Goddess, and a whole army of high-level bosses that will make you question your life choices. And don’t even get me started on the massive post-Moon Lord content—if you thought you had completed the game, think again.\n\nMods in general expand Terraria into a whole new world. The Thorium Mod, Spirit Mod, and Tremor Mod all add unique biomes, bosses, and mechanics, making the game feel fresh even after hundreds of hours. New weapons? You got 'em. New events? Check. Even cosmetic mods can make the game look prettier, or add weird stuff like making your character a floating pancake.\n\nOne of the coolest things about Terraria with mods is that it’s still very much its own game. Mods like Calamity don’t just add a bunch of content—they integrate seamlessly into the core game. You won’t feel like you’re playing a completely different game; it’s more like you’ve opened a Pandora’s box of insanity. It’s got all the classic Terraria charm—digging, building, crafting—but amped up to 11, with new dimensions to explore, terrifying bosses, and new mechanics to wrap your head around.\n\nAnd multiplayer? Chaos, pure chaos. You and your friends can team up to fight the crazy new bosses, explore newly crafted worlds, and argue over who gets the best loot.\n\nIn short, if you’ve been playing Terraria without mods—good for you, you’re in for a solid time. But if you’ve never experienced Calamity, prepare to lose weeks of your life fighting, dying, crafting... and then dying again. It’s a whole new game that never stops surprising you.\n\n11/10 giant bosses, 100% chance of calamity. Would die to Supreme Calamitas again.", 0.7814356088638306], ["Was finally able to beat the Wall of Flesh and now I'm at the hardmode. The game's been pretty fun, I've been doing some Angler's quests for the past few months and mining cobalt ores as well as farming for the Rod of Discord.", 0.654088020324707], ["Classic survival & RPG crossover sandbox game with a HUGE learning curve(free wiki DLC), honestly a lot more fun than Minecraft, the amount of content the game has to offer is mind-blowing. This game is the reason why I made a steam account.\n\nMy preferred way to play is probably much different from others as I don't care to boss rush and bullet hell isn't my thing, but there is really no right way to play this game, as long as you have fun.", 0.632011353969574], ["I have been playing Terraria since 2020, I started playing mobile. This game actually caused me to get one of my best friends. I stopped playing around 2023 due to me getting bored. Now I am back to playing it this time on my laptop and I have to say the experiance is just as magical.", 0.5725086331367493], ["I did not like this game, you see,\nIt was not any fun for me.\nI tried it here, I tried it there,\nI tried it sitting in my chair.\n\nI tried it fast, I tried it slow,\nI tried it high, I tried it low.\nI pressed the buttons, clicked the screen,\nStill, it wasn’t my routine.\n\nI played alone, I played with friends,\nI played and played—it would not end!\nI gave it time, I gave it space,\nBut fun? I could not find a trace.\n\nThey said, “Just wait! It gets much better!”\nThey even wrote a lengthy letter.\n“Just play some more! You’ll see the light!”\nBut no, this game was not quite right.\n\nSo here I sit, I walk away,\nNo more will I waste my day.\nYou like this game? Well, that’s just fine!\nBut this bad game is not for mine!", 0.5381882190704346], ["Goated game withn the difficutly scaling to what you want to do, perfection.", 0.5326172709465027], ["A SUPER FUN GAME!!! If you like minecraft or stardew valley this is the game for you! It's so fun, there's tons of bosses and enemies to beat, many events, things to build, things to see and do! Get the game now you won't regret it!", 0.5307237505912781], ["very nice game, so many things to do and very nice moding comunity\n", 0.5270270705223083], ["Nice little indie game, one day it might be popular.", 0.523809552192688], ["I was confused at first, Minecraft looks different. After playing I love it more than that weird 3d Terraria clone.", 0.523809552192688], ["Rating: 9/10\n\nReview:\n\nTerraria might look like a pixel-art Minecraft clone at first glance, but give it 10 minutes—and you’ll realize it’s anything but.\n\nThe game drops you into a procedurally generated 2D world with nothing but a few basic tools and the freedom to do literally anything. Want to build a castle in the sky? Sure. Fight massive bosses with laser guns and yo-yos? Absolutely. Dig to the center of the earth and discover ancient temples, glowing mushrooms, or even a hellish underworld? You bet.\n\nWhat Makes Terraria Shine:\n\n🗺 Insane Depth: Over 5000 items, dozens of biomes, NPCs, mounts, events, and more. Terraria has layers upon layers of gameplay.\n\n⚔️ Epic Boss Fights: From the Eye of Cthulhu to the Moon Lord, bosses are varied and challenging, and really push you to evolve your gear and tactics.\n\n🎮 Constant Updates: Even after a decade, developers kept the game alive with huge content drops like Journey’s End, which turned it into a near-perfect package.\n\n🛠 Creativity Unleashed: Building and crafting are both intuitive and vast. Players have created everything from giant pixel-art statues to functional adventure maps.\n\nSome Drawbacks:\n\n📚 Steep Learning Curve: It can be overwhelming for newcomers. The game doesn’t hold your hand, and early hours can feel aimless without a wiki or guide.\n\n🤝 Better with Friends: While solo play is great, the game really shines in co-op. Multiplayer adds chaos and charm to every boss fight and dungeon crawl.\n\n📦 Inventory Management: With so many items, your\n\n\n\n", 0.523809552192688], ["Game just kept on giving and giving the more I played. Tons of fun solo, plays at its best when with a few friends", 0.523809552192688], ["Please give this game a try if you havent, there is so much content that you can hardly get bored, and the dificultes available are good enough to get you a great challenge.\n\nThis is by far my most played game for a reason (Also try modded Terraria with TmodLoader)", 0.523809552192688], ["10/10 game! Would absolutely recommend to anybody who is looking for a new game to play!", 0.523809552192688], ["Insanely good game, very difficult and fun, similar to minecraft but 2d, and more items and difficulty", 0.523809552192688], ["After grinding for a long time and watching a lot of guides on how to play, I finally understand it. This game is amazing. The only real issue I have with it is that it doesn't really teach and guide you through the game fully, but that's the point of the sandbox genre, is it not? And no, for all the little kiddies and squeakers out there, this game is NOT 2D Minecraft. Buy the game, you'll be spending hours on it.", 0.523809552192688], ["Can't recommend this game enough: if you are willing to learn how to play the game, it has damn near infinite replayability. Also. tModLoader makes Terraria even better if you get bored of the base game. I also like that ReLogic is active with the community and takes suggestions from other people. Absolutely one of my favorite games ever made.", 0.523809552192688], ["This game is a life changing experience, I started off as a young weak boy trying to make it in life. However after my treacherous and overpowering adventures I had unlocked a new form of life, some would say a super-human. However I would say a GOD , I felt strong. My fight with the moon lord was impressive I said to myself, but once I fought the empress of light it became too hard. It took 50 hours of preparation but after a long, long set up time. I had done it. I had defeated her. It was over. I felt overjoyed, I was a new person after that. Now,  after all of my time I can finally say the game is done for me, I have completed it twice, acquired the Godly Zenith.\r\n\r\n                                                             Now that is a story I can tell my kids.", 0.523809552192688], ["I can say that this game is great, especially if you play with friends. Good gameplay with some nice music as well as it has lots things to do.\nAnother great thing is difficulty scaling here, by that i mean you can choose which difficulty you want to play on( I chose solo warriour on expert and was regretting that a lot, but had fun nonetheless).\nBut here goes the best aspect of this game: mods and replayability.\nMods are just simply amazing and there's whole lot of them, like really a lot. And replayability in this game on another level. You can be one of many classes(4 main and whatever the hell some people come up with) and adjust difficulty, which already adds on gameplay, but then there's multiplayer(barely alive tho) and mods. So, yeah.\n\nOh, yes, achivements...they are actually pretty good! HOWEVER, don't even get me started on 200 quests of fisherman and purging the world...(Truly sisyphus core)\n\nAnyway, great game and enjoyed it throughout 10/10, might play it more with some friends for some quality time", 0.523809552192688], ["This game is a great fun bag of exploration, acquiring various fantastical equipment and creating highly detailed builds.\nYou don't need to build anything pretty to progress through the game, but there's definitely A LOT of items and tools that allows for nearly infinite creativity.\nThe different Difficulty settings during World creation either caters more to Builders (Journey being nearly like Creative Mod, and Normal being easy for someone who's used to the game) or Fighters (Expert/Master), so no need to fear the game being too difficult or easy for your tastes.\nNow for the negative part which mind you I haven't seen many people complain about, but still good to mention just in-case.\nTL;DR: \"Oh neat the game has 4 different Classes depending on how I want to play, let me play CLASS\"\nGame: \"Oh you want to play OTHER CLASS?, here you go here's the playstyle of OTHER CLASS in this CLASS.\"\nThis game has 4 Classes for Combat that comes with their own Weapons/Armours/Accessories, those being Melee, Ranged, Magic and Summon.\nMelee has the highest Defence and seems to be meant for high damage at the risk of getting in hairier situations up close, but many \"Melee\" weapons are actually Ranged (Freely thrown far away) or does nearly half of their damage via Ranged or Magic-like projectiles.\nRanged has the second highest Defence and is consistent with using Ranged weapons like Bows/Guns/Launchers/Blowpipes, and as expected wants to keep good distance away from enemies to perform best. I love this one :)\nMagic has the second lowest Defence and seems to be meant to be the wild card Class, with several of its weapons being unique rather than fitting in a set type of Magic weapon, using its weapons cost you Mana meaning you'll need to take break when attacking- something you can ignore if you have a certain accessory that automatically makes you drink Mana potions at the gradual cost of your Magic damage the more you drink them quickly. An amount of the Magic weapons behaves like Ranged weapons, shooting out a projectile from your character which travels in a near straight line forward but I suppose that's inevitable for a basic kind of Magic weapon, though some of them literally just behaves like Guns shooting out a small fast projectile. Overall pretty good, I like this one.\nSummon has the lowest Defence and you'd think would be about building an army to kill all enemies around you, say with a Minion that attracts enemies and takes hits for you, one that debuffs the enemies' defence, one with a Damage Overtime effect that'd make it pointless to stack or even have some that does something unique on Summon making you keep re-summoning it for interesting effects. But no, you just spam summon the hardest hitting Minion you have recently gotten and they're invincible and that's it, they last forever too. You can use Summon weapons to make them prioritise a certain Enemy but that's it.\nYou also have \"Sentries\" which are a different kind of Summon that you can place around an area to defend yourself which is nice, but again the variance for what they do is low and you'll usually just want to spam the same hardest hitting one and call it a day. In one of the last updates they did a major update to the Summon Class by GIVING IT A MELEE WEAPON, Whips. Now giving a Melee weapon to the Summon Class who has the LOWEST DEFENCE was a bad idea that completely throws out the window the \"Sit back and let your gang handle it\" identity of the class, so soon after they made a patch that increased their reach as a bandaid to help with the obvious \"Going close range with the Lowest Def Class makes people die\" problem.\nSummoners with Minions or Sentries that stay around and does stuff is in my Top 3 favourite Class Archetypes in fantasy/games, so for me to not enjoy the Summon Class in a game that I love is really just... Like yeah it's impressive but it mostly just sucks big time for me :(\nSo yeah even with my disappointments with the 4 Classes and how they feel to play, I still love this game and you probably will to!", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/105600/header.jpg?t=1731252354", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/105600/capsule_231x87.jpg?t=1731252354", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/105600/capsule_184x69.jpg?t=1731252354"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.terraria.org/"}, "developer": "Re-Logic", "owners": "20,000,000 .. 50,000,000", "tags": ["Open World Survival Craft", "Sandbox", "Survival", "2D", "Multiplayer", "Adventure", "Pixel Graphics", "Crafting", "Building", "Exploration", "Co-op", "Open World", "Online Co-Op", "Indie", "Action", "RPG", "Singleplayer", "Replay Value", "Platformer", "Atmospheric"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese"], "concurrent_plays": 38334, "number_of_achievements": 115, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG"], "short_description": "Dig, fight, explore, build! Nothing is impossible in this action-packed adventure game. Four Pack also available!", "long_description": null}