{"name": "New World: Aeternum", "app_id": "1063730", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 95993, "negative_reviews": 44516, "reviews": [["I have 2862 hours in New World. Thats a lot but I was playing while working from home, dealing with a divorce and then a stroke and the time just added up. \nThis was my stress relief and I enjoyed most of the game. \n\nHowever:\n\n2 weeks ago my gaming PC broke and I began using Geforce Now to play instead. This was working fine until I began running out of play time. So I subbed to Shadow PC and tried to play there. \n\nAfter logging in one time, I was issued a perma ban for cheating. \n\nI appealed it, but it was denied almost immediately. \n\nI have never cheated in any game at all, and there is no way to communicate with anyone at amazon Games to dispute this. \n\nI loved this game, but play it at your own risk. The game is great, the support is non existent and possibly not even human.", 0.8922357559204102], ["The new gameplay and lore is much better than before, but locking the DLC from old players, that bought the game for 60€ is just BS! New players can just buy the new edition for the same price and they receive everything, yet the ones who have been around since the beggining were cut aside from the newest contents. And for what I read and seen, it's not even worth the extra 30€.. \n\nI'm just gonna upvote it because I like the game in itself, but I don't approve this kind of disregard for player community", 0.8278945684432983], ["you wanna know a way to bring more people to the game.... lower the price on the game, the game was release 4 years ago and it's still at full price.", 0.8253987431526184], ["I’m approaching 1000 hours in this game since its relaunch, and it’s clear that the developers have little regard for it. Countless issues—like visual bugs, broken mechanics, unbalanced gameplay, and aim lock—are never addressed. Despite the vocal and passionate community, it feels like no one is ever listening to any concerns.\r\n\r\nThis game had so much potential but lacks any communication. The player base is quickly falling.", 0.6657348275184631], ["I think people are just too critical of what a game should be, I played this game since the alpha and beta stages, even when it was first release during covid times, when you had to wait for a 3 hour queue to get in game.\n\nI played many mmorpg games, and the thing that brings me back to this is the combat system and style. \n\nEarly Game and Mid game are amazing with the new and improved story lines which makes this game amazing.\n\nLate game, IMO is a little grindy but rewarding, that makes what MMORPG, level your gears, character, being accepted to wars, gorg raids, worm raids, invasions, M3 Mutateds, OPR, Arenas, Races.\n\nI think majority of gamers are complaining too much and want that fast hit of dopamine to get rewards without the grind. \n\nExplore hard enough, you will have plenty to do. =D", 0.6199250817298889], ["Do not purchase this game by Amazon Games unless you want to lose your money and time.  They will only take your money and then permanently ban your account after 5 months of play.  They will accuse you of using a 'cheating software.'  \n\nThe game isn't even on my computer, it's streamed from GeForce Now so any cheating software would be on their partner Nvidia's computer.  Maybe their partner Nvidia uses a 'cheating software'?  I don't know and Amazon Games don't care even if you do an appeal.\n\nAnyway there is a lot of farming so it is not worth spending all that time and money only to have it taken away.", 0.5977011322975159], ["I played this game at launch, and really loved it. I no lifed it for like 2 weeks until the fiasco started with chat bug sausages, immortality exploits and so on. \n\nI just came back after years, because I told myself \"this game was amazing, for sure they fixed the insane bugs right?\" and YES they did.\n\nAeternum is a waaaay more polished version of the original game. The Main Story Quest leveling is amazing, the new zones are amazing, new weapons are cool. Everything is just so much better. They made more niche changes that improved the game a lot, which a total noob will not see, for example healers would stay in heavy armor and be immortal. That is not a thing anymore because you get -30% healing when you are in heavy.\n\nHousing system is nice, crafting is nice, gathering is really satisfying. They made these interesting sounds when you kill something or when you gather, kinda like Battlefield or other FPS \"clink\" sound, which is very addictive.\n\nOpen world PvP is just insane and I started a regional war just last night because I was camped by 6 purple dudes. Called in the boys and it was a literal battlefield. In what MMORPG can you hide in bushes, making your name plate disappear? You can ambush people!\n\nHonestly, people are trashing the game too much and that's just because modern gamers are delusional. You see people with 5k+ hours, even 10k stating that \"the game is bad\" because there is no content. Bro...I don't have 10k hours in dota2 and I play it since 2013. There is a lot of content, and you have a certain freedom other MMO's don't provide.\nThere is no treadmill like WoW.\n\nThe devs make some mistakes but whatever, my server is packed, content everywhere and it looks/feels amazing. Play this game!", 0.58798748254776], ["With over 400 hours spent in New World, I can say this game has been a rollercoaster of exploration, experimentation, and evolution. What first pulled me in was the sheer beauty of Aeternum and the weighty, satisfying feel of its combat system. Over time, what kept me coming back was the depth of the crafting system, the sense of progression, and the moments of large-scale conflict that actually felt meaningful. There have been ups and downs, and the game has changed quite a bit since launch, but watching it grow and improve has been part of the experience. Whether I was gathering resources deep in the wilderness, fighting alongside others in intense wars, or simply refining my build for the next challenge, New World always gave me something to sink my time into. It is not a perfect MMO, but it has a soul and a rhythm that resonates with players who enjoy investing themselves in a world that rewards patience, adaptability, and persistence.", 0.5645816922187805], ["Unfortunately, the game is too dull, and boring.\nIt's worth something about $15.\nI recommend trying other mmos, like BDO, or ESO.", 0.5562599301338196], ["The game-play and mechanics make this such a great combat focused MMO. Combine that with great visuals and audio, this could be a game i would sink so much time into but once you complete the fairly average story there is nothing to do! You cant grind dungeons because there is no one doing them and the side quests provide no real rewards. The PVP has 1 map for both its modes and becomes so boring. Its also hard to fill a PVP lobby but when it does you only face the hardcore sweats with all the best gear they obtained years ago. \n\nThere is no other combat focused game that plays as well as this, its just a shame the content and endgame sucks. Ruined what could have been a top tier mmo.", 0.5558110475540161], ["My girlfriend just got perma banned for absolutely nothing after more than 1500 hours and after she even bought skins in game to support the game because she loved it so much. \nDon't buy this game, don't give amazon any money because you will just get banned for nothing. \nWay to get people playing your game... ban whoever did not abandon your shitshow of a launch and lacklustre updates.", 0.5546444058418274], ["dlc should have been free to makeup for initial failures and flaws of the game. mounts should not be behind a paywall and screams greed, bad look for your company. encountered multiple problems with questing logistically and bugs on important quests.", 0.5458715558052063], ["Looking back, the game was fun because I played with my friends, not because the game was actually that good.", 0.542425274848938], ["so much wasted potential. stayed this long in hopes things would improve. Finally got a new PVP map after 3+ years of waiting and we wait even more months for them to delete a few trees and adjust the costs to build a bridge? get out while you can or stay well away if you don't like being continually let down", 0.540325939655304], ["This game needs better Devs they have no fykn clue what thr doing the keep releasing trash and its missing the excitment please hire me as a Dev ill have a betyter clue on wtf to add and not add to the game seems like all we get is bug fixs fyk this dev team off", 0.5395548343658447], ["for me this game does mmo's the way i like. not to overbearing with a crap ton of attacks but enough to satisfy the customization urge. Im about 30 hours in and so far im having a lot of fun. I do wish they would add dual wielding dagger tho thats my favorite weapon. the only thing i dont like is the weight distribution for armor. i feel like its to heavy im trying to run a light build but unless im naked i cant but other than that great game. A LOT OF CONTENT, quests everywhere you go.", 0.5365568995475769], ["Absolute trash for customer service. Game play is great, however Amazon Games customer service is horrible. Game constantly crashes, I run an i9, RTX4070, 64gb RAM and constant crashes. They will jerk you around and have repeat things you have to do just to play the game. They will not help with simple things. If you want to change your character name they will not do it. The only option you have is to delete the hours you spent playing it and start from scratch or to go play on a server that none of your friends play on. 2 weeks in and I have already told them to kick rocks and uninstalled.", 0.5348460078239441], ["Absolutely ridiculous that i've owned this game before their bs rebrand and still have to buy your DLC to get basic things like mounts and endgame content....", 0.5263158082962036], ["So bad dont waste your time for this game , i dont play for six mounth then after login to character see Perma Ban without anyCheat or... , contuct the AGS and no have any answer just copy paste nothing to do", 0.5242671370506287], ["A lifeless, soulless Grind, to part you from your money like almost any MMORPG.\n But it looks terrific, and for a MMO the fighting is kinda okay.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1063730/header.jpg?t=1739224826", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1063730/2fe94eba6734521fbd4f44fb23ea66cb79376067/capsule_231x87.jpg?t=1739224826", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1063730/2fe94eba6734521fbd4f44fb23ea66cb79376067/capsule_184x69.jpg?t=1739224826"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.newworld.com/"}, "developer": "Amazon Games", "owners": "50,000,000 .. 100,000,000", "tags": ["Open World", "Massively Multiplayer", "MMORPG", "RPG", "Adventure", "Action", "PvP", "PvE", "Multiplayer", "Fantasy", "Character Customization", "Walking Simulator", "Crafting", "Third Person", "Co-op", "Open World Survival Craft", "Sandbox", "Violent", "Sexual Content", "Singleplayer"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Polish", " Portuguese - Brazil", " Spanish - Latin America"], "concurrent_plays": 5969, "number_of_achievements": 133, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support"], "genres": ["Action", "Adventure", "Massively Multiplayer", "RPG"], "short_description": "Experience a thrilling action RPG set on the supernatural island of Aeternum. Forge your destiny on an adventure filled with danger and opportunity.", "long_description": null}