{"name": "Arma 3", "app_id": "107410", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£23.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 97294, "negative_reviews": 8871, "reviews": [["\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n\n", 0.6583445072174072], ["Great game, not that much stuff to do in vanilla but if you mod it., you're going to have stuff to do for hundreds of hours, modding community is amazing. Got over 500 hours in Antistasi, and that's just one mod.", 0.5431970953941345], ["Listen folks, Arma 3—incredible game. I’ve seen a lot of games, the best games, and this one? This one is something very special. Milsim — real military, not the fake kind. Tremendous realism. Beautiful maps, like Altis—very Mediterranean, reminds me of Stratis, very classy. Some say I could have built a resort there, and they’re probably right. I will be making a golf course instead. Definitely. Tanoa? It makes me want to buy more islands to experience it in real life.\r\n\r\nThe gunplay? Phenomenal. Best I've ever seen. The modding community? Let me tell you—those people are hard-working gamers. They’ve built things in this game that make other developers look like Sleepy Squad trying to program a iPad. Absolutely horrendous. \r\n\r\nThe editor? Tremendous. Fake news would say that Zeus sucks. Totally false. I can not imagine a more core part of a game like Zeus and the Eden Editor. Tremendous work.\r\n\r\nIt’s not for casuals. You want Fortnite? Go play Fortnite. This is for serious people—leaders, winners. Strategy, coordination, tactics—just like a real campaign. Honestly, if we used Arma 3 instead of Call of Duty, we’d have had better results. No question about it.\r\n\r\nBuy it. Play it. Dominate. Just don’t forget to upvote and downvote patriotic mods and cowardly fake mods.", 0.5413095355033875], ["This war game is one of the best war games ever even without DLCS it is the best and a vary friendly community with loads of mods to use.", 0.5413095355033875], ["Fucking unoptimized as shit. I have never got more then 40fps in the decade plus time I've owned this game despite how many times my computer has upgraded. Better milsims have come out now.", 0.5364614129066467], ["Amazing game so much to play on your own time, with friends or in communities the opportunities are endless!!!", 0.5215388536453247], ["This game is okay I guess, need friends to play. Otherwise, not really fun.\r\n", 0.5205479264259338], ["worst game i have ever played shittiest tutorial and way to many stupid ass keybinds would never recommend to anyone dont spend money on this shit", 0.5180274844169617], ["Нихуя не работает, серваки хоть и имеют онлайн но ты не знаешь, где скачивать моды для захода.", 0.5117357969284058], ["381 hours of struggling makes this game more enjoyable to get away from the toxic ass Ps5 and Xbox players", 0.5021882057189941], ["Great game, runs fine on my budget computer(for me). FPS is normally 40-60 on medium and low settings. Although my FPS would frequently be at 20-30 on the Contact DLC. I haven't played too much multiplayer at the moment so I can't really speak there. Servers seem pretty populated though. My specs are Rx 580, Ryzen 5 4500, and 16gb of ram.", 0.5], ["Very wonderful war simulator sandbox game. Easy, fun, and brings you endless possibilities especially with the EDEN editor feature. The game can be played either with or without the mods from the Steam Workshop, and its absolutely amazing either way, 9,5/10 would suggest. The only criticism I have are some minor unfortunate movement dynamics, it can be sometimes a little bit \"stiff\".", 0.5], ["It's a very accurate game, but I'm going to be honest to you all the graphics are a okay. But the graphics don't really matter, It's the realism with AI", 0.5], ["do not buy if you are going to buy the standard edition, every thing is behind a paid dlc and if you dont have that specific dlc you can play but every 10 min there is gonna be a pop up on your screen ( yes in the middle of your game like a phone game)  telling you that you are using a dlc content and you should buy it, it is that ridiculous.\n\nand also another thing about this game is piss poor performance, i get 70 fps at 1440p on official servers with 7900xtx 7800x3d pc, so if you have a worse spec you gonna suffer.", 0.5], ["Used to think it was legit boring but now after like 3 years of not playing i wanna download it again because its a fucking awesome game", 0.5], ["WOW, extremely realistic and difficult combat simulator.  Amazing.", 0.5], ["I have just started to play this game, and I already enjoy it. I recommend for people that like a first person shooter, and having to do everything themselves instead of relying on the game to tell you.", 0.5], ["Not a lot of active online servers. still a blast to play single just a bit harder and more time consuming.", 0.5], ["1. Press \"w\" simulator coupled with many redundant bloat cut scenes that are designed to wast your time.\n2. Great graphics however, the game itself is poorly executed and under developed leading to repetitive scenarios.\n3. Bullet sponge game to the point of annoying rather than fun.\n4. Lame storey and lame audio.\n5. Overall and summary 3/10 sorry to say.\n6, PS - you should play sniper ghost warrior contracts 1 & 2  as the weapons are excellent ! \n", 0.5], ["I think Arma 3 is amazing it has a lot of mods that add new content and have really kept the game alive for so long. I\r\n\r\nt is not an easy game to master which I feel puts a lot of new comers off (especially if they are very much into COD style shooters. I would recommend  this game to any military nerd as it can be really fun if you are into that kind of stuff. (Royal Marines fan here.) There I a few bugs that can be off putting but I would not throw down a game because it has bugs, as in my humble opinion the bugs do not ruin the game.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/107410/header.jpg?t=1743497752", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/107410/capsule_231x87.jpg?t=1743497752", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/107410/capsule_184x69.jpg?t=1743497752"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.arma3.com"}, "developer": "Bohemia Interactive", "owners": "10,000,000 .. 20,000,000", "tags": ["Military", "Action", "Multiplayer", "Shooter", "Simulation", "Realistic", "First-Person", "Open World", "Tactical", "FPS", "War", "Co-op", "Strategy", "Sandbox", "Singleplayer", "Moddable", "Combat", "Online Co-Op", "Team-Based", "Third-Person Shooter"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Czech", " Polish", " Portuguese - Brazil", " Russian", " Japanese", " Korean", " Simplified Chinese", " Traditional Chinese", " Turkish"], "concurrent_plays": 10536, "number_of_achievements": 123, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "LAN PvP", "Co-op", "Online Co-op", "LAN Co-op", "Steam Achievements", "Steam Trading Cards", "Captions available", "Steam Workshop", "Steam Leaderboards", "Includes level editor"], "genres": ["Action", "Simulation", "Strategy"], "short_description": "Experience true combat gameplay in a massive military sandbox. Deploying a wide variety of single- and multiplayer content, over 20 vehicles and 40 weapons, and limitless opportunities for content creation, this is the PC’s premier military game. Authentic, diverse, open - Arma 3 sends you to war.", "long_description": null}