{"name": "Destiny 2", "app_id": 1085660, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 60058, "negative_reviews": 13947, "reviews": [["Terrible game, terrible mechancs, terrible maps. Zealots Reward. -5 handling, terrible maps. Terrible pvp matchmaking.\n\nWould def recommend 5/5", 0.7085352540016174], ["Game was once great and easy to sink endless hours into. Now it's effectively entirely paid-for content, drip fed and time-gated to limit your experience, and competitive scene is inundated with blatant cheaters with no intention from the devs to change anything. Addictive at best, but futile and well past its prime. I feel bad for players getting into the game in today's model.", 0.5525264143943787], ["Destiny 2 is a great game. Smooth gunplay, amazing visuals, immersive atmosphere. I genuinely enjoyed playing it with my friend. No cheating, no griefing, no toxicity. Just the two of us doing missions and having fun.\n\nThen out of nowhere came a permanent restriction. No warning, no explanation. I submitted two detailed and respectful appeals. In return, I got the usual copy-paste response saying I violated policies, with no actual detail about what happened.\n\nAs far as I can tell, the only possible reason was one sarcastic message I sent to my friend in a private chat. Just the two of us. It wasn’t public, no one could report it, and it wasn’t even serious. Just a dumb joke.\n\nAnd yet Bungie decided that was enough to ban me permanently. No warning. No temporary mute. Not even a short suspension. Just a lifetime ban for one harmless line in a private chat that no one saw or complained about.\n\nI get it, rules are rules. But this is ridiculous. No other major AAA studio would hand out a permanent ban for something like that. A short mute maybe, a brief suspension possibly, but a permanent ban for one line? That says more about Bungie than it does about any actual violation.\n\nDestiny 2 might be a great game, but the way Bungie treats regular players is honestly disgraceful.", 0.5424836277961731], ["Sunk too many hours into this game, both console and PC. The first few words i have to type so that my review may somewhat be worthy of your time... that felt stupid to type. Anyways, game has great gameplay experience. I met some great people, felt accomplished in pvp, beta tested the gambit mode, and a great story with great lore... that was like 6 years ago. That all changed.\n\nGameplay is still great but the social experience today is doo doo. Whats that, you wanna do a raid? Cool, first you must know what to do (KWTD), then you must have insert meta weapon/armor loadout, and then prepare to deal with whinny crybabies who's time you're wasting because you're not as good as them. Oh and somehow you must have experience in said raid and YT tutorials don't count.\n\nMeh, that can be avoided and you can decide, \"hey, I don't want to play with strangers, I'll try out pvp instead\". Know that pvp resources are most if not all, allocated to bungies new ip, marathon. So if pvp gets too boring, you're SOL.\n\n Thats fine, maybe try out gambit... know that its been years since that feature got an overhaul.  \n\nAll fine, just do the numerous slightly rewarding activities that may drop that great god roll weapon that the paid YT influencers recommend... wait, its useless now? I got nerfed? Thats right. That god roll weapon the same paid YT influencers praise then beg for its nerf, may one day just get the unjust nerf or even be removed from the game. Something you paid for, if you actually bought the game via its plethora of DLC.\n\nIgnore all of that, play the game for its rich story and fascinating lore... that is also constantly retconed. Thats right. Even the lore channel content creators have a problem with this. \n\nIts all up to you, reader of this slightly buzzed and depressed gamer's review. Ignore what the spikey headed buncho guy said and give it a try, you may like it or you may not. Its just a game and what you enjoy playing is all on you, no judgement. I will not recommend this game even if i start playing it again next week.", 0.5299144983291626], ["It was good, it was fun, it as a lot of things, these days it's a shell of what it was and more a cash grab than anything else, would not recommend unless you want to spend a lot of money, the free to play option is a rather terrible experience and the new player experience have also heavily suffered in the past, having played this game for a long time and having gotten most expansions since launch, which I now can't even access anymore cause thanks for sunset vaulting my money Bungie, the only thing that is good with this game anymore is that a lot of the designs and world design is still very well made, but gameplay wise, you are better off playing Planetside 2 or other similar games.", 0.5288746953010559], ["I saw the trailer for Destiny 1 years ago and bought a console to play because of the trailer.  I hadn't played a game I enjoyed in years.  11 years later I'm still playing Destiny 2.  This is an excellent game with a great story and awesome players and game elements.  If you haven't played this yet....you've been missing out.  So pop some screebs and shoot some shanks and we'll see you at the tower.", 0.52173912525177], ["I really wanted to like Destiny 2, but after about 10 hours of gameplay, I’m throwing in the towel. This game is an overwhelming experience for new players, not in the good, content-rich way, but in a \"here’s a hundred icons and no explanation\" kind of way.\r\n\r\nThe game throws you into the middle of a confusing story with no real introduction, tutorial, or guidance on where to go or what to care about. Systems are layered on top of each other with minimal context, menus are bloated and unintuitive, and unless you’re ready to read third-party guides or watch hours of YouTube tutorials, it’s hard to find your footing.\r\n\r\nIt feels like a game designed for long-time players, not newcomers. That’s fine, but it should be clearer up front. I’m sure there’s a great experience buried here somewhere, the shooting feels good and the world looks cool, but the barrier to entry is just too high. Unfortunately, it wasn’t worth the frustration for me.", 0.5199999809265137], ["I like the game but it is a big investment and they keep removing content you paid for. Also lots of bugs that have not been fix.", 0.5138888955116272], ["incredibly pricey for the bare bones minimum content you get, do yourself a favor and play literally anything else. all my hours haven't been worthwhile or meaningful at all, played for the raids and quit", 0.5131815671920776], ["Naw, they keep removing parts of the game and somehow justify it as keeping it \"fresh\" when they've removed most of the main story, nothing makes sense anymore and new players have a really hard time learning what is actually going on. \n\nSunset my balls on your face Bungie.", 0.5126582384109497], ["In one fell swoop Episode: Heresy killed the two modes I enjoyed, Competitive and Trials of Osiris. Bungie has sat on their collective asses pushing out a sprinkle of Nerf's that do absolutely fucking nothing to change the problem. Sometimes we need D2 Year 2-4 Bungie back where they had the balls to just slam something with the chunkiest Nerf possible and then try and dig it out of the grave slowly. Kill Void hunter and Redrix's Estoc will always be a problem as long as that pulse rifle buff remains in the game. Also just fuck anyone who uses Radiant Dance Machines, that rework should have never happened.", 0.510869562625885], ["the shop is the only place to make your character look cool. yanno in a game with a season pass and paid content. thats pretty disgusting. the game is monetized like a damn mobile game. the worst part is this game could be absolutely amazing if bungie didnt make the game flow around monetization. like resetting the power level of your character every expansion, it serves no purpose but to pad out playtime so you spend more time in the shop. oh and want to make a new character? have fun doing all of the quests that unlock subclasses and abilities again. you can pay 20 dollars to skip that though. bungie must be ok with skipping the content so thats not the problem. its just another way to nickel and dime you. they ran this game into the ground which is a shame because playing it is a lot of fun.", 0.5099764466285706], ["this game is horrible if your new dont buy it they take away your paid content at their own leisure they dont bug fix or address game breaking issues Give me my stuff back or refund the first 2 years of content i can no longer access because of your asinine way of adding new content maybe stop beating a dead horse and make something people want to play again all of you big game companies ruined quality gaming now the only way to get a decent game is small developers because they unlike any of you actually care about the quality of what they release and they dont blatantly steal from people. I HOPE EA BUYS YOU TO SHUT YOU DOWN YOU TRASHY COMPANY", 0.5068965554237366], ["Love the game, genuinely some of the most fun gameplay, coolest quests, and most interesting writing in the gaming industry. Literally cannot advise AGAINST starting it harder. I promise, if you haven't been playing since launch, there is no reason to start playing now.\r\n\r\nLets say you get the base game, it's free, and looks good, cool. You're gonna run out of things to do in like 2 weeks, if you even last that long, because without all the DLC they don't even really give you a reason to do anything. It's all just ~there~ and you're expected to just sift through it.\r\n\r\nSo, okay, lets get some DLC so you have some stories to chew on and something actually worth doing. I hope you have $170 just sitting around to dump on a \"free\" game, maybe not all at once, sure that works. Well first you wanna make sure you get the forsaken pack, that's a given, so there's $20. Now to start with the ACTUALLY PLAYABLE DLCs which are... about $30... Each... Lets do Shadowkeep to start, that's ones only $20! Oh? You finished the story in 2 days? Alright cool, just buy beyond light for another $20, and then the witch queen for $30, and then LightFall for another $30 and the 30th anniversary pack for $25 and- oh shit we've already spent spent $145...? huh... Well that's okay it's a free game! plus you can always just skip this process and get the Legacy collection for $70 which is actually a pretty good deal!\r\n\r\nBut once you finish all of the stories and content that adds in what, a month? Maybe less if you take to the mechanics fast? Well then you're staring down the barrel of the final shape, which is another $50 for JUST it's content or $100 for the bundle with the season pass which if you're still here you're probably gonna want because of the amount of content and story and items you can get for it.\r\n\r\nSo conservatively, the \"barrier of entry\" to access everything this FREE GAME has to offer is about $170 give or take. Not counting silver for cosmetics if that's your jam. And even after all that, you don't even actually GET the \"full game\" because over half of it is still just GONE! You can NEVER get the full context for everything going on because there are entire campaigns just MISSING! Whole storylines with CRUCIAL CONTEXT are just missing from the game and they're likely NEVER COMING BACK. Sure, they've made great strides in bringing back items from that time, but as far as I can tell they will NEVER let us play those questlines again!\r\n\r\nSo, to refresh. this FREE GAME is going to pressure you into spending $170 to access what's LEFT of the content it has to offer, to start reading the book like 10 chapters in after they ripped out all the pages before that and left behind 2 bits of paper with sparknotes on them, waste hours or days struggling to get achievements that are literally not achievable anymore because the content required to get them DOES NOT EXIST, to wait ages in loading screens only to play missions with half the usual players thanks to a shrinking player-base wasting away on life-support, while they squeeze you for every penny that can possibly be manipulated out of you, while they drown you in \"episodes\" that are 90% just standing in an area while listening in on a group voice chat between in-game characters between missions that are identical to literally every other mission in the game.\r\n\r\nI love destiny 2, I've been playing since launch, before I moved my destiny account here from battlenet I had about the same hours I do on here, so total my hours are nearing 3k. I think despite it's abysmally low-lows the story/stories told in the game are some of the best in the industry, the balancing when it's good is some of the most rewarding of any game on the market, and I think genuinely there isn't anything else like Destiny 2 out there.\r\n\r\nBut I cannot, WILL not, ever in good conscience recommend starting Destiny 2 in 2025. Maybe a few years ago during shadowkeep or beyond light it would have felt less bad to recommend it, but nowadays? Unless you're willing to put up with one of the worst \"new-player\" experiences available today, and you have hundreds of dollars you just HAVE to spend as fast as possible?\r\n\r\nSTAY. AWAY. Save yourself. It's too late for the rest of us, we're here forever. I'm writing this review fresh off playing again for a few days after taking a 320ish day break. I came back because I missed my graviton lance  voidlock build and wanted to experience it again. This game will have it's hooks in me for probably ever, but if you're on the fence about getting into destiny 2 I implore to to turn and run for the hills. \r\n\r\nYou can check out any time you like. But you can never leave.", 0.5], ["Good game overall. Hard to get in to as a lot of content is hidden behind paywall and not well explained what exactly needed to play ... Cost is involved as usual with live service games, But if thats is not a problem then its a good game for you. In my opinion for what its worth 8 / 10 game", 0.5], ["im free... im finally free, after 2 years of not playing i no longer have the urge to relapse and play this dumpster fire of a game", 0.5], ["Its a great game full of content to grind. If you are new run through the story content in the timeline to catch up and make sure to go at your own pace if you are a story fan. For the rest of it fireteam finder is great and the people I have ran into on there are fun and helpful to new players including myself. \r\n\r\nIf you are new to this world the Mynameisbyf is great for lore and if you are a D1 vet then I would say its a new feel to the game with new abilities and story content. Raids are fun but can be very complex.", 0.5], ["The Halo MMO.\r\n\r\nIf that sounds cool, pull out your wallet because this game is not \"Free-to-play.\" \r\nWait for the expansions to go on sale or buy region steam keys from G2a for really cheap.\r\nAlso, the systems and menus of this game are a complicated mess. Watch ShadowDestiny on Youtube for good starter guides.", 0.5], ["I compare it to a heavy drug addiction... It steals all of your money and time, and ruins all your relationships (with other games)\n\nDef recommend 10/10", 0.5], ["Been here for 3k hours. Lived on Venus, experienced great DLCs and many seasons that were basically the same but different texture. The game became just like it’s developer somewhat cash grabbing so be prepared to spend some money on the DLCs otherwise there is no fun. The seasons and even the new episode system is basically the same and swiftly becomes tiring and boring. But if you and potentially some friends are searching for a game with an incredible amount of lore and loot grinding while playing a sci-fantasy storyline, then you should try Destiny at least once.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1085660/header.jpg?t=1738688481", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1085660/capsule_231x87.jpg?t=1738688481", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1085660/capsule_184x69.jpg?t=1738688481"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.bungie.net/"}, "developer": "Bungie", "owners": "20,000,000 .. 50,000,000", "tags": ["Free to Play", "Open World", "Looter Shooter", "Multiplayer", "MMORPG", "FPS", "Co-op", "PvE", "PvP", "Shooter", "Massively Multiplayer", "Loot", "First-Person", "Sci-fi", "Action", "Adventure", "Lore-Rich", "Space", "Competitive", "Atmospheric"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 23934, "number_of_achievements": 23, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support"], "genres": ["Action", "Adventure", "Free To Play"], "short_description": "Destiny 2 is an action MMO with a single evolving world that you and your friends can join anytime, anywhere, absolutely free.", "long_description": null}