{"name": "Project Zomboid", "app_id": "108600", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£16.75", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 117464, "negative_reviews": 7153, "reviews": [["[h1] you probably know if you want this game or no so i will just say 3 things that can help someone to start [/h1]\n\n1.you are going to die. alot. everytime.  better accept this early on because this game is not about surviving but about survival, you cant change your fate, but you can decide how it happens\n\n2.first couple hours will feel very boring because you wont know what to do, you cant spoil this game so i reccomend watching someone play first and then build goals for yourself in game (wow just like minecraft)\n\n3.game is very immersive maybe even little bit to immersive most likely you wont be able or even want to explore all mechanics of the game so dont force yourself if you dont like digging in the dirt for sticks and trash bags just dont find another way \n\nthat`s all i wanted to say", 0.9087490439414978], ["My Favorite Zombie Survival Game Right Now\r\n\r\nI’ll admit at first, I didn’t care about this game at all. Even though I’ve always loved zombie games, this one just didn’t grab my attention. I was deep into State of Decay at the time, which is a solid zombie game in its own right. But eventually, I started feeling like it was a bit limited. I wanted more freedom, more challenge.\r\n\r\nThen one day, while I was watching YouTube, a video about Project Zomboid popped up. And holy hell… this game is insane. I couldn’t believe I had been ignoring such a gem just because the graphics didn’t look as flashy as other games. But let me tell you — this game is absolutely amazing. It’s fun, intense, and delivers everything I’ve ever wanted in a zombie survival game.\r\n\r\nHere’s what makes it so great:\r\n\r\n1. Total freedom — You can do whatever you want. You create your own story, make your own choices, and the game just lets you go wild.\r\n\r\n2. Challenging in the best way — It’s super realistic. Injuries, status effects, and survival mechanics all make the game feel tense and rewarding.\r\n\r\n3. Modding community is top-tier — If there’s something in the game that bugs you, chances are someone’s already made a mod to fix or improve it.\r\n\r\n\r\nIf you’re into zombie survival games, don’t let the graphics fool you. Project Zomboid is the real deal. It’s insanely good.", 0.7725101709365845], ["Really good zombie game you get to beat your zombified neighbour with a rolling pin or a letter opener then raid their kitchen truly a zombie game of all time.", 0.5822950005531311], ["Favourite game ever. Very complex but so much easier to understand than 7 days to die. It’s like playing a hardcore sims game with zombies. The mods make the game even better. Love this game.", 0.5406360626220703], ["Hate these bitchass zombies and their stupid ass sneaky moves and the jumpscares damn it.", 0.5327103137969971], ["Amazing Game. I currently only have ~16 hours and its already great, theres a learning curve so expect to die of course. But once you get past the constant deaths and you actually start learning, its amazing", 0.5245170593261719], ["I LOVE THIS GAME at first it is hard to survive but dont leave the game early", 0.523809552192688], ["gets paper cut\r\ngets infected\r\ndies\r\nrespawn\r\nrepeat\r\n10/10 love the game", 0.523809552192688], ["Really unique game, goes insanely in depth into survival. \nCould play it for thousands of hours without getting bored.\n\nThe only bad thing is that there arent any achievements.", 0.523809552192688], ["Incredibly addictive. I've logged 240 hours in 6 weeks (I never log hours in a game like this). It's open ended, you choose your own path, and incredibly sandbox. The modding community is extensive and the Devs update the game every 1-2 weeks like clockwork. They listen to community feedback and honor their community to the fullest, you just don't see that too often these days. I will say if you're planning to mod this game, I hope you have lots of RAM. 16gb isn't enough... \r\n\r\nIf I had to critique this game, I would say my biggest problem with this game is there's no end-game or ultimate goal. Sure you can max out your levels (massive grind) or you could set self goals like clearing Louisville (good luck) but that's all up to you to enforce that upon yourself. And achieving those long term goals ultimately gets you nothing in the end other than saying you did it. I wish this was treated more like a dungeon crawler like Hades instead of a solely sandbox survival game. It even starts each run by saying \"and this is how you died\" so logically that is the point. So why not get a score? Like number of kills, levels, rare items found, and time survived multiplied by negative traits. Then your score can can be added up in your account. Maybe scores can unlock new items for future runs or items to be used in multiplayer servers. I'm not a dev, just an idea. \r\n\r\nMy other critique would be the poor performance. Especially when its raining. It can be so bad that players consider rain a death sentence due to the lag and stuttering. I have a very high end desktop (7800x3d, 7900xtx, and 32gb ram) and this game is still a stuttery mess with my frame times jumping around constantly. And the issue is optimization because my hardware is barely being utilized, maybe peaking at 40% on the GPU and 30% on the CPU. This is annoying, but this is a small Dev so I understand the struggles here. \r\n\r\nLast critique is no cloud save support. And this is because of how the game is optimized and uses memory. You might think \"well that sucks, but I can just manually transfer my save to my laptop and continue playing on the go\". And sure, you can until you start really exploring the whole world and have 40+ mods installed. My save file for my longest running save is over 400Mb, almost half a gig. And that save file is 10s of thousands of tiny files. Last time I transferred my save (not doing this anymore) it took an HOUR. Having a NVMe SSD like me doesn't matter when there's so many tiny files that need to be transferred. \r\n\r\nI know it sounds like I'm railing this game, but I still love it and I think that just goes to show just how good it is. I'd say if you read this whole review and were wondering if this game is worth it, IT IS. It's not too expensive and will give you so much enjoyment, give it a shot!", 0.523809552192688], ["game good, survival good, mechanic good. two zombie chase is fine, 4+ zombie chase is kill\r\nsoundtrack good, graphic is runescape horror", 0.523809552192688], ["This is one of the most enjoyable game but it can get repetative and is only fun with others", 0.523809552192688], ["Dakilolpis\n132 products in account\n5 reviews\n\nRecommended\n65.0 hrs on record\nEARLY ACCESS REVIEW\nPOSTED: 19 MARCH\nProject Zomboid is one of the greatest survival games ever made. From its incredible depth to its brilliantly designed mechanics, this game sets the gold standard for what a true survival experience should be. It’s realistic, immersive, moddable, and most importantly, a hell of a lot of fun.\n\nEvery aspect of Project Zomboid feels grounded and believable. This isn’t just a game about killing zombies—it’s about long-term survival, resource management, and adapting to a world that wants you dead. Whether it’s dealing with injuries, managing food and water, or fortifying a safehouse, the attention to detail is insane.\n\nThe combat is engaging and rewarding. Every swing of a bat, every perfectly timed push, and every last-ditch escape feels intense and strategic. There’s no mindless button-mashing here—positioning, stamina, and awareness all matter. The fact that hordes actually feel like a real threat adds a level of tension that few other games can replicate. Survival isn’t just about fighting—it’s about building your future. Watching your character progress over time—gaining skills, becoming stronger, and mastering the apocalypse—is incredibly rewarding. The base-building system is flexible and fun, allowing you to fortify an existing house or create a fortress from scratch.\n\nThe world is massive, detailed, and full of life (or death). The game’s art style is simple yet incredibly effective, creating an eerie, immersive atmosphere that complements the gameplay perfectly.\n\nOne of the best parts? The modding community is insane. The game is already amazing, but the ability to tweak and enhance it with mods just makes it even better.\n\nUnlike many modern games, Project Zomboid listens to its community. The developers actually care about player feedback, and it shows. This game is worth every single cent I spent on it.\n\nThe Only Downside? Car Lag\nIf I had to nitpick, the only annoying thing is the lag when driving fast. But honestly? That’s a minor issue in an otherwise flawless game.\n\nFinal Verdict: A Must-Play Survival Masterpiece\nProject Zomboid is a godsend for survival fans. It’s deep, intense, rewarding, and endlessly replayable. More developers should take notes from this game, because this is how you make a true survival experience. If you haven’t played it yet, do yourself a favor and get it.\n \nWas this review helpful?\n Yes\n \n No\n \n Funny\n \n Award\n36 people found this review helpful", 0.52173912525177], ["It's fun for what it is. Reminds me of the 00's and flash games with it's isometric interface. After a time the game play becomes dull without goals. Very unstable, but enjoyable.", 0.52173912525177], ["A game that requires time, a clear mind, and a flawless plan. You mess up one thing and you're dead. Miss time a swing? Scratched or bitten. Fire a pistol with aim level 0? Ringing the dinner bell forthe horde. Fire game though.", 0.5185185670852661], ["It is really fun, but mastering it can take a while. The controls are a bit hard, but then again i am not that experienced at computer. Highly Reccomend. Really fun. Do sandbox for first playthrough though.", 0.5185185670852661], ["A fun game to play with friends and terrifying by yourself.", 0.5126582384109497], ["easily one of the best games i have ever played.\nsteep learning curve which death and mistakes will be your teacher.\none of the strongest modding community's I've had the joy to experience. everything from full class rebuilds, and mad max cars to amputee play though and horror themed whispering zombies.\nthe best and most active dev team I've seen in a long time, endless patches, updates and fixes for things that i know in the early days i saw and thought 'if only they changed this' and fixes for things most wouldn't even notice as issues but they saw as areas where they could do better.\nthis is one of those games that each death does teach you, like don't go on grass at night. but it will make you a better player, honestly by say 300-500+ hours death is a rare blip that you'll kick yourself if it happens and laugh off. and i know you might see 300-500+ hours and think fuck that, but i cant think of any game that I've been able to easily put this many hours into and still be excited for each and every patch that comes out.\nthere so many ways to play with friends or solo, build a base, clear a town, live as a nomad in a car/rv, go 10 years later and spawn naked while swearing off all loot, fish and forge while making shoes, clothes and tools from scratch. \none of the things that also keeps me tied to this game is the zombies, and i don't just mean the art or how they act but even the depth of the spawning mechanics which is a beautiful little rabbit hole, it makes it so when clearing an area and sealing it there a strong sense in pride, its not one where you just clear a zone and bang zombies are back there for no reason like a lot of survival zombie games.\nonly reason why im not playing the game right now is im waiting for the 42 multiplayer so me and my friends can experience all of this new build in one go together.\ngreat great game.", 0.5028248429298401], ["I love this game I play it with my family every now and my entire family loves to play this the 4 player co op is a bit buggy but I think that is on my end I highly recommend this game", 0.5028248429298401], ["This game has actually destroyed my taste for any other game in the genre...its such a good game. Its like a symphony...it has its massive powerful edge of your seat moments..and low calm times where you forget zombies exist only to go back out and get bit fighting 1 zombie cause you are sloppy fighting because youve been trying to place garden gnomes in your base just the way you like. You start throwing mods on this game...shoot. You can play alone and dig it. Multiplayer is crazy good and the potential for RP players (Im not) is crazy. The team who made this should be proud of themselves. They should hear the fans but at the end of the day this spawned from them and I hope they continue to make a game THEY love and others who share the same interest will also LOVE...rather than a game that appeals to everyone and everyone LIKES it just fine. Sorry this is so long...but this game is so good and I really am glad Ive had the chance to play it. It will be locked in the vault in my head with the rest of the the Games Ive loved since I was a child. Keep up the good work.", 0.5028248429298401]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/108600/header.jpg?t=1739309087", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/108600/capsule_231x87.jpg?t=1739309087", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/108600/capsule_184x69.jpg?t=1739309087"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.projectzomboid.com"}, "developer": "The Indie Stone", "owners": "10,000,000 .. 20,000,000", "tags": ["Survival", "Zombies", "Open World", "Multiplayer", "Open World Survival Craft", "Sandbox", "Post-apocalyptic", "Co-op", "Crafting", "Building", "Indie", "Simulation", "RPG", "Survival Horror", "Realistic", "Isometric", "Singleplayer", "2D", "Adventure", "Early Access"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Danish", " Dutch", " Hungarian", " Norwegian", " Polish", " Portuguese - Portugal", " Russian", " Turkish", " Japanese", " Simplified Chinese", " Portuguese - Brazil", " Finnish", " Korean", " Thai", " Traditional Chinese", " Ukrainian"], "concurrent_plays": 24723, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Cross-Platform Multiplayer", "Steam Trading Cards", "Steam Workshop", "Partial Controller Support", "Remote Play Together", "Family Sharing"], "genres": ["Indie", "RPG", "Simulation", "Early Access"], "short_description": "Project Zomboid is the ultimate in zombie survival. Alone or in MP: you loot, build, craft, fight, farm and fish in a struggle to survive. A hardcore RPG skillset, a vast map, massively customisable sandbox and a cute tutorial raccoon await the unwary. So how will you die? All it takes is a bite..", "long_description": null}