{"name": "Baldur's Gate 3", "app_id": "1086940", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 388630, "negative_reviews": 12462, "reviews": [["Turns out i like turn-based RPGs. Turns out I like DnD based games. When I first saw this game, I didn't have a single bit of interest. I gave it shot, and now I'm completely enthralled. This review is for the skeptical people who wouldn't normally play these types of games. It's a bit overwhelming at first, especially if you're unfamiliar with DnD! It's worth the learning curve!", 0.967473030090332], ["I don’t usually write reviews, but this game genuinely deserves it. The amount of freedom is insane. You can talk, fight, sneak, charm, explode, or just throw a pair of boots at someone if you feel like it. And the game reacts to all of it.\n\nThe companions are brilliantly written. They are flawed, layered, and real. I didn’t expect to get this attached, but here I am. Also, I’ve replayed the intro like ten times just to try different classes and backgrounds. Every time, something new happens.\n\nVisually, it’s stunning. The world feels alive, and the voice acting? Top tier. Even the dice rolls add a weird kind of tension I didn't know I needed in a video game.\n\nIf you love story-driven RPGs with real choices and real consequences — don’t miss this one! It’s not just a game. It’s a full-on DnD campaign you can lose yourself in.\n\nHuge thanks to Larian Studios for putting so much heart and soul into this. You’ve created something truly special.\n\n💚", 0.8741426467895508], ["Where do I even begin? Baldur’s Gate 3 has completely blown me away. This game is everything I love about RPGs – deep storytelling, endless choices, and a world so rich in detail that it feels alive. Whether you’re a veteran of the series or jumping in for the first time, this is a must-play.\n\nThe combat is addictive. Tactical, challenging, and rewarding – it’s everything you’d expect from D&D 5e, and it makes each encounter feel like a puzzle that you’re eager to solve. But what truly sets BG3 apart is the freedom it gives you. Your decisions matter, and the way you interact with the world shapes everything around you.\n\nThe world itself is gorgeous. From the forests, to the dark ominous ruins, every area is packed with lore, secrets, and stunning visuals. The characters are well-written, the voice acting is incredible, and the dialogue is filled with choices that impact the story.\n\nAnd co-op? It’s a total blast. Playing with a friend is a game-changer. The way you navigate moral dilemmas and tackle quests together makes for some unforgettable moments.\n\nHonestly, Baldur’s Gate 3 is one of the best RPGs I’ve ever played, and I highly recommend it. If you love deep, immersive experiences with a ton of replayability, this is it.", 0.7279899716377258], ["To preach to the choir, I like this game a lot! There's an opportunity to make a meaningful decision around every corner in this densely packed game world. A lot of care has been put until the \"flourish\"-y details such as animation and voice acting. You won't have to waste time on endless traveling, it's just straight roleplay and classic CRPG combat. And there's a nice balance between humor and drama that I don't see a lot of these days in any sort of media, not just video games.\r\n\r\nYou do have to be comfortable with, or at least be willing to tolerate:\r\n-Dice rolls around every corner, in and out of combat\r\n-Overcoming decision paralysis and the temptation to endlessly savescum\r\n-A noticeable degree of unapologetic horniness in the writing.\r\n\r\nMostly leaving this review because of my very Nice playtime.", 0.6619247794151306], ["Larian Studios again showed his strength as one of the best western RPG game developers on the market today. That after what they managed to achieve with two Divinity series: Fantastic Original Sin, Baldur’s Gate 3 came with a higher class approach, both in terms of music, visual presentations that now involve hundreds of VA sound records and records complete with new cinematic cameras, to the area, city, and various scenarios of the challenging challenging fight He also managed to bring the concept of \"role-playing\" that should be, which was built neatly while ensuring that each companion character has an interesting mission and story to be pursued and completed. The freedom to choose options and actions, dealing with the consequences that occur afterwards, while trying to continue to fight and survive it makes the charm of Baldur’s Gate 3 undeniable", 0.6414386034011841], ["Always wanted to try DnD but then I remembered that I don't have friends to play with, and then that game came out. Now I can play DnD with myself, and nobody judges me for playing as a half-drow. \r\n\r\nBUT I'M WARNING YOU ALL!\r\n\r\nI hated Vampires before playing BG3, and now I found myself romancing one. I guess I hit critical failure on my wisdom roll. So be careful gamers! xD\r\n\r\nGreat game! Love it! :D", 0.6338543891906738], ["I resisted this game at release. It was right up my alley -- as a longtime DnD player, this game promised the freedom and creativity I adored with tabletop RPGs in video game format. However, I had been burned by too many games promising choices with impact only to provide a linear story with two or three alternative endings. It took my friends months of kind nagging to finally cave (along with some fantastic Shadowheart cosplayers in my social media feeds... what can I say, I have a thing for edgy women), and I still had my reservations even as the game made itself at home in my library.\n\nNow, with over 500 hundred hours in this beauty of a game, I can say it has done nothing but deliver above and beyond on its promises, and I have nothing but the utmost faith in and respect for Larian Studios. This game is everything I dreamed of when I first started playing RPGs. I have tried many good games within the genre, but none have scratched the itch to have a fully realised world quite the same as this one. The writing for both the characters and story is second to none, and the continued refinement and new additions for every patch is a breath of fresh air in an industry overrun with microtransactions and DLCs. \n\nI will admit, some features are less than intuitive, even for a veteran DnD and RPG player, but I love that upon further playthroughs I can still discover new mechanics and different solutions for old encounters. Not to mention, every time I'm convinced I know every story beat and possible quest line, I find something I missed the previous times around.\n\nI'm not usually one to review a game, but with all the joy this game has brought me I felt the least I could do was contribute my voice to the many already singing its praises. Truly, one of the best games ever made.", 0.598540186882019], ["It is a game made with a great deal of love and care and attention to detail. It's an incredible achievement. It looks remarkably good.\r\n\r\nBut...\r\n\r\nI have played it for nearly 80 hours across two different characters (20 hours on one, nearly 60 on the other), and I'm not sure I've ever actually had fun. I was ready for it to have ended by the completion of Act I, but it just keeps going. As far as I've got with my 60 hour character, I am still only just into Act III. I know, I know, it's great that I got so much game for the money I paid, but I can't help thinking of the other CRPGs I've played that have been so much more compelling in under half the time. I could have completed Tyranny four times by now, and I'd have had more fun.\r\n\r\nExploration is tedious, involving repeatedly having to toggle to jump, and switching out companions to get that one guy who can cast the cantrip to make you jump further so you can get to a treasure chest that contains even more spell scrolls or other junk that means you have to spend minutes rearranging all your different inventories so you aren't over-encumbered. I know, I know, you don't have to explore everything and you don't have to pick everything up, but every single thing in this game is connected to everything else like a conspiracist's corkboard and red string, so if you don't poke into the ruin under the cemetery under the basement under the cottage, who knows what important detail you'll miss?\r\n\r\nI've touched on inventory management already, but it's a nuisance. I appreciate that on higher difficulties, or even on the normal difficulty, having to consider what you bring with you is an important part of the game, but I can't understand why it isn't a toggleable option to turn off carry weight. At the very least, when selling to a merchant it should be possible to sell stuff from the camp stash, rather than requiring you to hop to your camp first to shift it all into your inventory before going back. It only takes a couple of clicks and a brief loading screen, admittedly, but over the course of the hours you'll spend in this game, these little irritations become grating.\r\n\r\nAnother increasingly grating irritation is that every NPC has a zoomed-in custcene vignette when you click to talk to them, even if all they have to say to you is a single line to which you cannot respond. In other games, this would be conveyed to you by staying zoomed out, having the audio play (and/or having the text appear floating above their head). I appreciate the effort that went into doing it the way they have done it, and their commitment to their singular style, but I found it wearing.\r\n\r\nBesides exploration, the core of this game is combat. D&D combat is a fine way to approximate small-scale fantasy battles at a tabletop level by rolling dice. I do not think it is a terribly good system for a video game. Increasingly I found myself viewing fights not as a welcome break from the slog of exploration, but yet another piece of drudgery to push through.\r\n\r\nThe acting performances in this game are excellent, and one of the only things that kept me playing. It feels pre-emptive to talk about the plot and narrative, as I have not finished the game (and may well never finish it), but I will fault the pacing of it, as I think that contributed to my mounting boredom. As to the writing I have experienced so far- it is good but not exceptional. The performances elevate the material.\r\n\r\nI know I am in the minority for not enjoying this game, and I am by no means trying to tell you that you are wrong if you enjoy it. I would much prefer to have had fun with it, but since I did not, I wanted to share my perspective, on the off chance it is useful to someone.", 0.576825737953186], ["Finished my first playthrough. Game is epic. Graphics can be intense, and the saves large, but the game is enjoyable every step of the way. Choices seem to matter. Story is great. Next stop for me? Probably trying out Dark Urge.", 0.5767441987991333], ["I'll try and keep this short: This game was a bit of a disappointment for me. The combat system is pretty unique and interesting, but overwhelming with too many options, and every fight you seem outmatched, both in level and number of enemies. People already figured out quick that you can easily cheat the odds by quick saving before throwing dice. But those aren't my biggest concerns with the game. \n\nTo me the  overall story and world is just way too confusing, and partially too enforcing (no real choice to be made at key points), and there's way too many side plots that you're not even sure what to follow. As someone who's not familiar with D&D, the world just has way too many things you need to learn or know at once. Characters pop up left and right and you're not quite sure who they are as you can't even have a dialog option that explains it. Every party member that you travel with will at some point be met with some person who wants them either to die or to leave the party for 'reasons'. It gets quite repetitive.\n\nThere's a also continuous sense of urgency that's not really real and will not resolve itself even when the game is finished, which puts the whole experience under a bad light. I don't like playing games where you're supposedly in a constant rush, but in the end that rush is not real. That's not fun!\n\nHowever, the biggest problem I have right now is it appears Baldur's Gate 3 is trying to fry my GPU and causes my desktop to freeze. The game runs perfectly well on 1440p@165Hz and good graphics, with optimal GPU temperature, but for some reason my PC starts acting strange after a few hours that indicates some level of corruption happening. I found some posts about this topic, but no real resolution to it. A game of this quality should possess no problems for my GPU so it is incredibly frustrating to keep rebooting my PC after Windows just stops working.", 0.5623342394828796], ["I can't belive it, Final Patch. You made it, all the way through.\n\nWhen I heard about BG3 for the 1st time in its very early stages I expected to be \"just another RPG game but with Baldurs Gate as title while having no relation to the actual saga\". And even worse, they were selling a 4 part game while only having less than 1 act actually done, like some another crowdfunded pre-released and never finished game. On top of that, Divinity 2 didn't punch me at all and I couldn't make 4 hours straight because I wasn't enjoying the system nor did find the narrative of my taste.\n\nOnce they got to Act 3 the hype in the community became a thing, but I couldn't care less about it, felt even a bit insulted like if it was casting a shade over the incredible BG1 and BG2, my childhood favorite games from all times, I grew up playing those as if nothing so large and deep could be ever done again.\n\nWell, as I became more adult, I forced myself to watch some horrendous popular and controversial films/series over the years so I could make an educated criticism about why are bad in my opinion, and sometimes expecting the lowest form of art I found real jewells. Thats what happent to me when I started playing BG3, it wasn't an horrible advetures film, it felt like the true next gen of those old school RPG games. More so, Larian convinced me again and again that they were worthy of my economic support by adding so dilligently more and more content.\n\nUntil now. They considere this long journey over, this is the Final Patch. \n\nDo I recommend the game? Absolutly, full price, showing full appreciation for a well done game, a full of love project, and a worthy continuation of Baldurs Gate Saga. \n\n10/10 game, dev transparency/support and marketing policies. You are brilliant.", 0.5528455376625061], ["This game was an experience. I wish I could get amnesia all so I could re-experience this actual masterpiece for a first time. I'm sad that Patch 8 was the last one. I wish there were more to experience, even in spite of how satisfied I am with the main story. I want to experience more of these characters. I'm absolutely smitten with this game, and I'm just rambling on at this point.", 0.5473304390907288], ["An absolute must play and in my opinion masterpiece, the story is great, the characters even better. Its like experiencing a trilogy in one game without feeling too much, each act is unique and the game offers many many ways to play it. You will find yourself enthralled in the lore and side stories. One of the few games that actually made me cry at the end of the story.\n\n10/10 Game, try it out, even if you dont like D&D combat the game has done it in a very fun way.\nOnly small downside is in the beginning you will feel weak as shit and miss a lot of attacks until you get your stats higher where combat starts being very consistent and sometimes even too easy so ramp up that difficulty mid game!", 0.5454545617103577], ["There will never ever be a game like this ever again. Truly a 1-of-1 masterpiece as far as how unique any one player's game will go. Let the dice take you where they will, you will not be disappointed. Never experienced a game so replayable as this one with consistent value to boot. the game is worth at least 3 times what it costs, and I believe this enough to have bought it not only for myself, but on 4 separate occasions to get other people to play it, and not a single one has had a complaint. Impeccable character depth, immaculate world build, unparalleled customizability. If the phrase \"the world is your oyster\" was a game, it would be this game without a shadow of a doubt. 10/10 would recommend unquestionably. If you have your doubts, just stick to it for a while. It will click.", 0.5454545617103577], ["I didn't play a lot of these kind of games, all games actually. But this one got into my heart. One of the best soundtracks as well. Will definately play once again", 0.5438596606254578], ["first time playing turn based games. Felt very off at the start, but something just kept me playing. All of the sudden its 5AM.", 0.5394737124443054], ["I started Baldur’s Gate 3 thinking I’d be a noble paladin, upholding justice and smiting evil. By hour three, I was in a romantic entanglement with a vampire who threatened to eat me (hot), my best friend was a sentient mushroom who spoke only in riddles and vibes, and I had convinced a talking brain in a jar to join my party. 10/10, \r\n\r\nThis game is less \"epic fantasy adventure\" and more \"fever dream narrated by a dungeon master who’s four drinks deep and trying to keep the party from seducing every monster they meet.\" Spoiler: they fail. Gloriously.\r\n\r\nYou want options? Baldur’s Gate 3 gives you the freedom to talk to animals, bang druids, threaten gods, betray everyone you love, and then reload a save because you forgot to quicksave before throwing your wizard off a cliff “for science.” One time I solved a puzzle by yeeting a corpse onto a pressure plate and immediately got praised like a genius. Thanks, Larian.\r\n\r\nThe companions? A chaotic mess of red flags, unresolved trauma, and smoldering eye contact. I love them all. Astarion could drain me like a Capri Sun and I'd thank him. Shadowheart is 90% sarcasm and 10% secrets. Gale is a walking TED Talk with a magical bomb in his chest. And Karlach? Just a sweet infernal war machine trying her best. Protect her at all costs.\r\n\r\nCombat is the kind of turn-based nonsense where you can either elegantly dismantle a group of enemies with tactical genius... or just throw a chair, light the floor on fire, and hope gravity does the rest. And it works. It always works. Eventually.\r\n\r\nGraphically? Gorgeous. Emotionally? Devastating. Existentially? I haven’t been the same since the owlbear scene. You know the one. Don’t act like you didn’t try it. We all did.\r\n\r\n12/10. Would romance a druid in bear form again and not apologize to anyone.", 0.5358442068099976], ["Act 3 ruins the game completely. Going to be a slog to finish, but at this point I have to. Acts 1 and 2 are fantastic, though.", 0.5334681868553162], ["Having enjoyed the first two games in the series, and after having read all the good things folks have had to say about BG3, I had high expectations.  But after playing it a while, I have to say I don't think it's much fun to play.  It's the characters, I think  Speaking for myself, they're disappointing.", 0.5300509333610535], ["Ultra simplified reason first: I am not the target audience. \r\n\r\nWith that now said, I can see why people love this game, but to me it just comes off as a huge dip down in quality from what divinity original sin 2 offered in terms of actual game flexibility with how environmental interactions worked and the like. I recognize a lot of my problems with this game are purely due to the archaic nature of d&d in which spell slots hold you back from being able to use those really cool spells and play out the roleplay character you created. I recognize that there are plenty of build guides and videos on the matter and that I am likely very alone in my frustration with the endless stop and go the game forces you to do with the rest mechanic, seeing as its only alternate purpose is to force feed you events. In bg1 the rest mechanic made sense since you were already zoning in and out of areas near constantly and so it wasn't super exhausting when you cleared a zone and then rested to recoup before going to the next zone, but since BG3 is just one giant zone after another, it felt like more of a forced break in the flow of the game which I did not enjoy. Returning to skills and the like, I dislike (yet again another d&d problem that has no relation to Larian's design choices per se) the actual multiclassing dynamic, since you are often put into a position where you lose out on important stats if you try to get multiple things going, and it just felt like every idea I had was shot down by the fact that the level breaks are vile and you can't actually do a ton of different combinations effectively.\r\n\r\nRegarding the companions, I found immense dissatisfaction, as they are all very simple, one note characters who essentially want you to stay/become a good two shoes (Minthara is not fleshed out enough to be properly considered). Even outside of that, I still just found each of them very preachy and annoying, with this neutral audience appeal that never wanted to take risks, and I can't blame Larian for choosing to make them this way, as the goal was to appeal to the widest audience possible. In that regard, they surely succeeded, but by doing so individuals like myself are innately isolated and pushed away, which would have been fine if the companion quest lines were not the backbone of chapter 3 and basically 80% of the game. Another minor gripe would be that the early leveling process is so abysmally slow and boring that I fall asleep every time. I wish chapter one was sped up a bit with less annoying encounters and a faster EXP jump to get into the meat of the game and climax in chapter 3 where they could have thrown more stuff at you and let you explore Baldur's Gate, since that is the title of the game. I recognize their limitations and trouble behind the scenes so I don't take it too hard, but it is just something that would have been nice. \r\n\r\nI've grown tired of my own review bitching so I'll end it off here. Overall I believe the game deserves a solid 8/10, since nothing is perfect and even in light of my hatred of a good many annoying things, I can recognize a quality product. This game has a lot of love put into it and I admire that dedication. Thank you for taking the time to read this. <3 Stay blessed.\r\n", 0.5298545956611633]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1086940/6b6b46089067683cecf6acfc92b39fc4c72e3fac/header.jpg?t=1744744220", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1086940/3dd81008e9c385caf68152450c22353f6a8abec9/capsule_231x87.jpg?t=1744744220", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1086940/3dd81008e9c385caf68152450c22353f6a8abec9/capsule_184x69.jpg?t=1744744220"}, "support": {"support_website": null, "support_email": null, "game_website": "https://baldursgate3.game"}, "developer": "Larian Studios", "owners": "20,000,000 .. 50,000,000", "tags": ["RPG", "Character Customization", "Choices Matter", "Story Rich", "Turn-Based Combat", "Dungeons & Dragons", "CRPG", "Fantasy", "Adventure", "Sexual Content", "Romance", "Online Co-Op", "Multiplayer", "Strategy", "Singleplayer", "Co-op Campaign", "Class-Based", "Nudity", "Dark Fantasy", "Combat"], "languages": ["English", " French", " German", " Spanish - Spain", " Polish", " Russian", " Simplified Chinese", " Turkish", " Portuguese - Brazil", " Italian", " Spanish - Latin America", " Traditional Chinese", " Ukrainian", " Korean", " Japanese"], "concurrent_plays": 109198, "number_of_achievements": 54, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "LAN Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Adventure", "RPG", "Strategy"], "short_description": "Baldur’s Gate 3 is a story-rich, party-based RPG set in the universe of Dungeons &amp; Dragons, where your choices shape a tale of fellowship and betrayal, survival and sacrifice, and the lure of absolute power.", "long_description": null}