{"name": "Cyberpunk 2077", "app_id": "1091500", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "KRW", "original_price": "", "final_price": "₩ 66,000", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 287829, "negative_reviews": 41253, "reviews": [["This game is an absolute masterpiece. It's not perfect, but it is an incredible experience the whole way through. \nAmazing storytelling, amazing characters, amazing locations, amazing endings.\nIt is just so insane to me that this game went from being a buggy unfinished mess to an experience that is hard to get from any other game,\nI found myself thinking of Night City as a thing instead of a location. A horrible city which does everything it can to stop people from escaping. Kinda reminded me of the town from Uzumaki. \nIt also has insane replayability, I only did 2 playthroughs but you can get countless more with so many different builds. \nSomething I love is how your actions can change outcomes of certain things. Whether that's certain quests changing or just dialogue, I love it. Adds so much to the immersion, it really feels like V exists in Night City. One of my favourite things to do at the end of my runs is visit the graveyard. Names are added throughout the game as characters die. It's nice to walk through at the end and remember all the previous quests and people you've met.\nI truly wish this game released as it is now, it's incredible. It's just a shame it still has a bad reputation with some people after all this time.\nI'll never forget this game. I'm looking forward to future projects like a second anime, and whatever the next game is going to be. I hope its set in Night City but improved. I'd love to see their vision realised after all this time in the next game.\nThank you so much CDPR for this beautiful experience, this game will stick with me for the rest of my life.", 0.7550788521766663], ["Cyberpunk 2077, An open-world RPG set in the futuristic world of Night City in the cyberpunk universe. To convey about this title is enormous, because of how big it is and the content it has. CP2077 is often used for GPU benchmarks and stress tests, so i don't need to say much about how good the game is graphically. Gameplay is amazing especially the gun play, and the vast build choices in the game gives plenty of options for players with different playstyles.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3435052281\nThe main story of the title is actually short, too short because of how big the world it's set in. It's like a 30min conversation of 3hr movie. Also there's no NG+ which is a big letdown imo especially when the game has good replayability. The plot didn't felt that great but still really good, the characters and side contents are exceptional. But in the end felt like the story really needs more appreciation after exploring every endings. Sound tracks are good except for a few of them those were better than good. The World of Night City is something else, CDPR did an excellent job making the world. It's really immersive with all the gangs, chaos, corrupted system, crowded NPCs etc.. And ofc a great sight indeed, yet another gorgeous game world. Still there are lots the game lacks that were once promised by the devs and was already there.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3448157934\nThe RPG didn't felt that strong in the game as in like their previous title Witcher 3, but it was fine. CDPR nailed it with character creation, good work with both male and female V. For a custom created character they really make us emotional and the voice acting was top notch especially FemV. The photo mode in CP2077 is outstanding, and arguably the best game ever there is for great Virtual Photography. The DLC expansion Phantom Liberty succeeded in every way. It's plot, branching of storylines according to player choices, characters, new region, and the side contents that comes with it. It also includes many useful rewards and items.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3459037759\nHave no idea if I missed anything here, after all it's a huge title. Anyways in a nutshell Cyberpunk 2077 is yet another a great CDPR product and truly an exceptional work of art.", 0.7349931597709656], ["\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☑ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n", 0.7168076634407043], ["when 2.0 came out, there was a huge jump up in graphics. I remember booting the game after the update, and my eyes were like, I love you right now !", 0.6721678972244263], ["Enough of bad reviews, here is a game that deserves MORE than Overwhelmingly Positive!\r\n\r\nI don't care about how this game was at launch. All that shows is that the developers continued to work on this game to make it better, and that is admirable. It has one of the best stories I've ever seen on a game, and the DLC story manages to be just as good. This game reached exactly what a Cyberpunk genre would be like, the graphics are stunning, even 5 years later, and this game even with Path Tracing runs well.\r\n\r\nI just wish there were more activities to do in the open world, outside of missions, the world feels a bit flat and empty.\r\n\r\n", 0.5904895067214966], ["When it released I was pretty sure it would turn out to be a flop, and indeed it had a disastrous launch, and I'm glad I didn't play it back in 2020 and waited till 2024.\n\nPlayed after the 2.x update with the Phantom Liberty DLC and.. wow, one of the best games I've played in the last years. It hooked me from the beginning!\n\nThe world sometimes felt a little bit \"stale\" but the story is 100% worth the price!", 0.5620437860488892], ["I usually don't play single-player games that much, and they rarely manage to hold my attention for long. But Cyberpunk 2077 completely pulled me in. The story is gripping, the world feels alive, and the graphics are stunning. I truly felt immersed — like I was living in Night City, not just playing a game.\r\n\r\nI ended up clocking almost 100 hours in a really short amount of time, which says a lot coming from someone like me. If you're even slightly into story-driven games, this one is absolutely worth it.", 0.5577923655509949], ["Easily one of my favorite games of all time—if not the favorite. I still get goosebumps when I listen to the soundtrack even today. The main game is amazing on its own, but Phantom Liberty is just insanely good. The storytelling is phenomenal!", 0.547325074672699], ["Replaying it after version 1.2, so many changes and with a decent rig and ultra settings.. it's mind blowing seeing the graphics on vanilla game.. other games can only compete with mods.\nI hope they keep adding changes like they did to witcher 3", 0.5454545617103577], ["Cyberpunk 2077 + Phantom Liberty DLC nah, this game went from meme to masterpiece real quick. I played it after all the updates and honestly? It’s a whole different vibe than what people joked about at launch. You play as V, a merc in Night City, trying to survive in a wild, tech heavy future where body upgrades are normal and loyalty’s rare. The base game is already stacked with intense missions, insane customization, and choices that actually hit hard later on. The atmosphere? Straight cyber future chaos with a side of lusty neon drama. And Johnny Silverhand (Keanu Reeves) constantly roasting you in your head? Iconic. But Phantom Liberty? that DLC hits like crack. It throws you into Dogtown, a darker and more intense part of Night City. The story centers around Songbird (So Mi), a netrunner with major secrets. She’s such a well written character, and the more you get to know her, the more you're torn between helping her or questioning everything. The emotional weight she brings to the story? I just can't describe. If you're playing both? definitely finish Phantom Liberty before heading into the main story’s epilogue. Trust me, it adds so much depth. If you’re into futuristic chaos, deep characters, and emotional decisions, this combo’s a must play. Just make sure your rig can handle it as this world doesn’t play nice.", 0.5454545617103577], ["if i could go back and play this game for the first time again i would, but then i would keep doing that for the rest of time so it's for the best.\n\none of the best games i have ever played and i'm glad i put it off until after 2.1 was released. if you had been putting off playing this game because of the release definitely pick it up, especially if it's on sale", 0.5454545617103577], ["I never expected much from this game due to the fact how buggy and unplayable it was in 2020. They have done the impossible and turned this game into a gem. I will forever cherish this game in my heart, and I will never be the same after playing this. Nothing better than to ride far away in a tank with mi calabacita <3 and with my nomad family.", 0.5451064109802246], ["This game has come a long way from when it was first announced. I recall hearing so many ugly things about the game when all we saw were snippets within trailers. A lot of folks seemed pissed due to presumptions and perceptions they held. \n\nWhen the game launched on PC, it definitely had bugs. Though I didn't experience any that were game breaking, there were many minor issues. Emphasis on 'were'. I only recently played on Steam Deck and it runs nicely there, though my poor little Deck does sound like it's trying to take flight. Anyway, CD Projekt Red has done a bang up job of making this game run much more smoothly. That's not to say it's perfect. However, I no longer experience anything more than a minimal quirk once in a blue moon. \n\nFor the story? 10/10. I get hooked every time I boot it up. The side quests are interesting and many are challenging. The characters are varied and range from quirky to radical. A few are almost even wholesome, as much as one can be in this setting. The BS we get put through as 'V' is insane, and it seems everyone in Night City has their own Bag of Cats with which to contend. The choices we have to pick between, the risks we take, none are ideal. And yet, it fits. There is no 'ideal', not in Night City.\n\nI could probably say a lot more about this game, and it would all boil down to this: If you like the cyberpunk genre and RPGs, especially those that get your blood pumping, I recommend this game. \n\nNo spoilers, but make sure you pick up some cat food. \n\n", 0.54356849193573], ["I'll keep it short.  At launch, this game was hot garbage.  Now?  It's great.  Did it fall short of the unreachable standards established by nearly eight years of waiting followed by the biggest hype train I have ever seen?  \n\nObviously...yes.  However I find it to be an exceptional game regardless.  And they didn't just fix up the base game, they put out some pretty big updates like the 2.0 update that released alongside the expansion, adding new content and revamping some old content. \n\nThe expansion I think is even better than the base game.  I can't quite put my finger on why, but me and my work friend both recently played it and she agreed that Phantom Liberty's story and map are just... better.  Perhaps it's because they feel more focused.\n\nIf I had any complaints, it would be that there's no third person, dealing with Jackie Welles and Johnny Silverhand feels like a chore to me, Phantom Liberty seemed to be setting up new romances and then just didn't (cut content?), and Panam Palmer didn't climb out of my screen and maul me.\n\nIt's a really solid FPS/RPG with an expansive story, lots of side content, fun combat, great character customization (that you can only see in mirrors, menus, and motorcycles...), two solid romances (Panam and Judy), and fun driving with a large variety of vehicles.  I'm considering practicing driving in first person just to cruise around the world and take it in.\n\n10/10 would [spoiler]Uber an exploding clown around Night City[/spoiler] again.", 0.5390877723693848], ["Playing this game made me want to rip my dingaling in half and never stop rewatching the sex scenes with the womens\r\n\r\nHigly recommend to play this game", 0.5272727012634277], ["Assuming your computer can handle it, and now that PL + 2.0 exist, 2077 is a great time. It looks good, plays well, PL is spectacular, and is a complete start-to-finish excellent experience. Yes, there are small things that can be annoying but are either minor or moddable (or both) like driving on m/kb, but any game where I'm finishing a run and already planning a second has to be doing something right.", 0.5270270705223083], ["very good and immersive, i very highly recommend mods if you are able to. overall its a very nice game to play", 0.5270270705223083], ["I played cyberpunk the first week it came out and it did not feel like a game for me. Way to much story and talking and not enough action i felt after an hour or two. But the other day i heard a friend play it and tough id give it a try now when its been out for so long. And it was the best thing iv decided. Iv done all endings and they are heartwarming and heartcrushing. The really nail the story of this. I cant recommend this game enough! Worth every penny!", 0.5258620381355286], ["Great game with stunning visuals and rich story\r\nYou could easily get lost here for sever hundreds of hours", 0.523809552192688], ["At launch, cyberpunk was a disaster but over time it got better. There are still some rough edges but overall this is amazing game. From combat to story, it draws you in. The DLC and update 2.0 definitely made the game better.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1091500/header.jpg?t=1734434803", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1091500/capsule_231x87.jpg?t=1734434803", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1091500/capsule_184x69.jpg?t=1734434803"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.cyberpunk.net"}, "developer": "CD PROJEKT RED", "owners": "20,000,000 .. 50,000,000", "tags": ["Cyberpunk", "Open World", "Nudity", "RPG", "Singleplayer", "Sci-fi", "FPS", "Futuristic", "Mature", "Story Rich", "First-Person", "Atmospheric", "Exploration", "Action", "Violent", "Great Soundtrack", "Action RPG", "Adventure", "Character Customization", "Immersive Sim"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Czech", " Hungarian", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Thai", " Traditional Chinese", " Turkish", " Ukrainian"], "concurrent_plays": 32821, "number_of_achievements": 57, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Family Sharing"], "genres": ["RPG"], "short_description": "Cyberpunk 2077 is an open-world, action-adventure RPG set in the dark future of Night City — a dangerous megalopolis obsessed with power, glamor, and ceaseless body modification.", "long_description": null}