{"name": "Fall Guys", "app_id": "1097150", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 125238, "negative_reviews": 24175, "reviews": [["very fun and family friendly, until someone pushes you off for the 7th time in a row.", 0.574700117111206], ["Great game. Sadly is slowly being ruined by points rounds and catering to children between 2 - 12. Was a great game now you have mostly 30 second rounds filled with children.", 0.54356849193573], ["Very fun for new players, but I wish there was skill-based matchmaking. Just to make it easier and more fun for new players AND everyone.", 0.5354400277137756], ["Guys listen, look up kyogiasu a.k.a. Dylanssoto on steam. That guys swears he hates this game, I think that hate is unjustified and he just needs to really try to enjoy it. it literally has EVERYTHING this guy likes about games, it is a fricken battle royale, puzzle, mini-games, survival, and strategy all in one. I think that he just thinks this is for kids, but I say this is perfect for all ages! I have never once had a bad experience while playing, and it even has its funny moments! I suggest going to Kyogiasu/Dylanssoto's page and leaving comments for him to play!", 0.5275590419769287], ["would thumbs down the game cuz i cant get all dang achievements dun but its fun and i like it lots luv playing with my one friend and my little bruther", 0.523809552192688], ["Been playing this game for a few years now and I love it, I come back every couple of months to revisit it. It can be so chaotic especially when you're getting pulled by everyone in the lobby, whilst at the same time being funny especially when you're with friends and you all get eliminated in the funniest ways. It's lighthearted but can also be competitive at times when you are just 2 cm away from qualifying, it has an overall good combination with different modes to play, the skins are okay. One annoying thing is that there is no chat option in game, hope they add that in the future to make it easier for friends with no mics. In addition to this, the camera angle is so annoying you cant look up towards to the sky which is a pain especially in modes like FallBall, hope they change this in the future too", 0.5089285969734192], ["Fortnite was The game for so long and I was so bad at it. Then fall guys becomes The game and I was incredible so obviously everyone stopped playing it after a month.", 0.502439022064209], ["game crashes\r\n games suck \r\ncompetition is 3 year olds on nintendo switch", 0.5], ["\"Fall Guys\" is pure joy in digital form—a chaotic, colorful party game that brings out the competitive spirit in the most hilarious ways. Whether you're dodging spinning hammers, leaping across platforms, or scrambling to grab a tail, every round is packed with unpredictable fun. The whimsical design, upbeat music, and adorable jellybean characters add to the charm. It shines brightest as a multiplayer game, turning friendly banter into laugh-out-loud moments. Perfect for parties or online hangouts, \"Fall Guys\" guarantees an unforgettable time with friends!", 0.5], ["i remember wasting my money on this and then it became free a few months later just to get a cheap in-game battlepass that i never asked for. getting a refund would've been better. dead game. it was fun though with friends but it gets boring after a few games i think. overall rating 5/10.", 0.5], ["Super fun! You should get tgis game, its so cool to mess around in create! I have always wanted to make my own maps for games, and now you can. Definetly recomend!\r\n\r\nSincerely, TrainWreck930", 0.5], ["I miss how Fall Guys used to be before it opened up to other platforms, certainly the change of number of players in rounds is the greatest. However it's still a solid game that provides easy entertainment (and a bit of \"rage\" sometimes if you're seriously playing haha). \r\nAlso, to the developers, could you please fix the Happy Birthday Crown and return it to those that had it? It's been gone since that glitch and it was like my favorite item ever. I used it probably 95% on my bean. Please bring it back!", 0.5], ["ts (this) game is absalutly wonderful and helped me goon 10x more than i normaly would", 0.5], ["I got this game from paying it, still like it but I do not have friend to play sometimes. and I didnt get anything after they've changed the game for free", 0.5], ["Good for short or long session.  Fun to play by yourself, but better with co-op or in a team.", 0.5], ["I have over 500 hours on this game. the ranked has turned out to be so disappointing that i genuinely cant even recommend playing right now... its unplayable. the disconnects also still effect ranks. shutting it back down to go into maintenance until its playable is the right move. i will also edit my review with multiple paragraphs about why i DO recommend this game if its fixed but until then... its just get to gold and wait until its fixed because you cant even go anywhere. Also add squad ranked and duos ranked i get not having trios or even duos not being included... BUT SQUAD?! you know how many people i got to download this game cuz i thought we were gonna get to play together and they uninstalled upon finding out its solos only...", 0.5], ["Fall Guys is a hilarious and chaotic battle royale packed with colorful obstacle courses and unpredictable fun. Perfect for players of all ages, it’s a game where skill, luck, and laughter go hand in hand.", 0.5], ["fix your shit game, cant invite friends, same bug 5 years!", 0.4761904776096344], ["when I think of fall guys, I think of a flower. A beautiful flower blossomed from god's most golden hands. A blessing, within all of our lives that takes days and maybe even minutes to enjoy. I hope that people will soon see how great it is and truly give it the praise it deserves. Love, Club FG, foreverr\n\np.s. Thanks Guys", 0.5059880018234253], ["This game is not my style, but that's not my problem. My problem is that I spent around $25 to buy this game, which is now free, and all I get are some stupid costumes. I wish requested a refund while I still had the chance.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1097150/header.jpg?t=1698763175", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1097150/capsule_231x87.jpg?t=1698763175", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1097150/capsule_184x69.jpg?t=1698763175"}, "support": {"support_website": null, "support_email": null, "game_website": "http://fallguys.com"}, "developer": "Mediatonic", "owners": "20,000,000 .. 50,000,000", "tags": ["Multiplayer", "Party Game", "Battle Royale", "Family Friendly", "Massively Multiplayer", "Platformer", "Cute", "Funny", "PvP", "3D Platformer", "Controller", "Casual", "Colorful", "Action", "Online Co-Op", "Co-op", "Comedy", "Physics", "Indie", "Difficult"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 929, "number_of_achievements": 34, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action", "Casual", "Indie", "Massively Multiplayer", "Sports"], "short_description": "Fall Guys is a free, cross-platform massively multiplayer party royale game. Clumsily compete in absurd obstacle courses with friends or build your very own chaotic course to share with the community.", "long_description": null}