{"name": "Ranch Simulator: Build, Hunt, Farm", "app_id": 1119730, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£19.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 6786, "negative_reviews": 1760, "reviews": [["Is the game \"good\"? No.\nIs the game a mess? Yes.\nIs the game fun in the current state? Eh.\nDid my wife and I dump our whole weekend into it? Yes.\nDid the game pleasure my wife more than I ever have? Also, yes.", 0.8610239624977112], ["The game has a fantastic concept—building your own ranch, raising animals, and farming, all in third-person view. The idea of constructing a house, barn, or chicken coop sounds awesome, and in theory, it should be a great experience, especially in an open-world. \n\nUnfortunately, that’s where the positives end. It's incredibly buggy, poorly optimized, and seriously lacking in content or any kind of storyline. It feels more like an early tech demo than a finished game, and at this point, it doesn’t look like the devs are in any hurry to improve it.\n\nIt’s a shame because the potential is there, but in its current state, it’s barely playable. Even at a discount, it’s hard to recommend—definitely not worth full price. Maybe one day it’ll be great, but for now, it’s a pass.", 0.7460532784461975], ["if you like doing the same stuff over and over this is the game for you, all you do is drive a car that acts like your on ice, build a ranch and get more money to upgrade your ranch to get more money, so don't play this game if you don't have freinds as the only thing he has going for it is the charater creater  and the funny jump that's it, bad graphics, wonky first person, and lights flashbang you", 0.6347283720970154], ["Slightly over 2 hours in and too late for a refund. It's only after 2 hours that you finally start to build your barn. I thought it would get better, but it's just a mediocre game at best. I wouldn't recommend it as is right now.. Its tedious and feels like a chore, wonky mechanics for both walking and driving. Driving might be even worse as it's like skating on ice. The idea sounds great, building your homestead and life of the land. The execution is just meh. Building in this game is like \"Houseflipper\", but i found houseflipper more satisfying. Driving is just horrible and is better in any other game I guess. Hunting is better executed in COTW, and if you like farming, I had more fun in Farming Simulator. I bought it on sale, but even on sale it's too expensive for this assetflip.", 0.5649528503417969], ["Unoptimized to the point where my computer had to be hard reboot because this game crashed. And i was really looking forward to this game.", 0.5451654195785522], ["Game runs really bad performance wise, while if i look at the recommend specs i should be able to easely run it on my lenovo legion go. Refund it sadly...", 0.54356849193573], ["Great game! It has lots of potential for improvement.\n\nSpeaking of which, it would be great to have a system for easier placement—some sort of crate or rack for materials. Also, snapping to already existing structures would make building and decorating much easier. Alongside a grid system for building, this would make the game more fun. I’m more of a symmetrical guy, so having that option would be cool.\n\nThe second thing I’m looking for is roads. As players, we have these huge lands, and I want to use all that available space, but without roads to connect everything, it looks a bit boring. Being able to make dirt and asphalt roads would be amazing.\n\nAll in all, the dev team is doing a fantastic job. Keep up the good work!", 0.5426363348960876], ["Bad dev, releasing paid DLC's while the main game lacks content and QOL and optimization. \n-> don't purchase, the game is an asset flip", 0.541284441947937], ["Clunky game control. \nTerrible optimization. \nThe hands down worst control for a vehicle I have ever touched in any game. \nThey try to be realistic, but it just makes things annoying. \nWhere it could be realistic it tries not to be. For example, in the tutorial you have to go talk to various people in stores to buy things. However, they just tell you to use the terminal next to them. Why even put in a store with characters? \n\nI did not even finish the tutorial before I got too annoyed with the game and quit.", 0.5348837375640869], ["I bought this game to test out before I go buy my friends their own copies. Within minutes of running the game, the performance issues alone were evident, even on the lowest possible graphical settings across the board. I meet the minimum specs for this game, and no bottlenecking of hardware performance goes on when this game is running. The only problematic bit of hardware I have is my CPU, and that had no issues while the game was running. I have no idea why this game wouldn't run very well at all, other than Unreal Engine is just being Unreal Engine: unoptimized as all get-out. I refunded it shortly afterwards.\n\nMaybe once this actually runs on the minimum specs, I'll recommend it; until then, I'd recommend you forget about buying it unless you have something closer to the recommended specs.", 0.5302013158798218], ["Nice idea but poor execution. After playing hours and hours of other simulation games, this one just felt laggy and challenging to even do the most basic functions.", 0.5300260782241821], ["Its good game. You guys please fix the issue with the vehicle... my utv just stuck on top of a tree", 0.523809552192688], ["The game needs more content for a thumbs up.\nIn the beginning it's fun. The buildup, getting resources and money. But it doesn't take long before you start earning more money than you need. Just get a few pigs. So from now on there's no challenge left in the game. The only thing you can do is other tasks that earns you more money. But it's just more tasks to do, and you already earn more than you need, so why bother. The game needs reasons to earn those money.\n\nIt's the Minecraft effect. You have everything you need in a short time. From then on it's up to your creativity to find reasons to continue playing.\n", 0.523809552192688], ["This game feels like a very bare-bones, minimal development simulator with too many pain points for me to recommend to others.\n\n~Driving mechanics are ridiculous and handling is too sensitive, or not sensitive enough depending on what you're doing. It's a nightmare to hitch trailers to your vehicles, too.\n~Basic NPCs that leave much to be desired. They just sit in their stores/porches and never move. The general store lady just sits in the dark store overnight. Dialogue is boring.\n~Extremely basic tutorial quests, you're gonna need google to figure things out.\n~Building fences is too tedious to get desired angles, shapes, and alignment.\n~Poor UI for livestock info - this could be expanded to include sex/growth stage.\n~Animal AI & pathing is super basic. Unless you make 'airlock' style gates, as soon as you open a gate all the animals just make a beeline for the exit. This makes it almost impossible to house multiple animals in a barn stall. Devs have said they have no plans on changing this which is disappointing.\n~Pets - Dog will literally just run away and die if it isn't following you or fenced up somewhere.\n~Weather - Constant rain/thunderstorms that do absolutely nothing but bother you. You'd think it would water crops and fill water bowls but nope. It's purely for ambiance and has no functionality.\n\nIt's odd the devs have gone the route of expansions instead of improving the base game mechanics... but who am I kidding, this seems to be the standard these days. \n\n", 0.523809552192688], ["Ranch Sim is in dire need of mod support, devs want to use community ideas for DLCs i think, but this really aint that kind of game.\n\nEDIT: as soon as i post this review i head over to the Ranch Simulator Nexus page just to see that Yesterday someone has Created and Uploaded a Modloader for Ranch sim, Shout out to the creator MrSlevin what a Chad.", 0.523809552192688], ["-> Cannot play with minimum specs\n-> Clunky game control, terrible camera\n-> Horrible optimization\n-> Already launched a PAID DLC intead of fixing the game???\n-> The game is just a bunch of asset flip\n-> Roadmap for 2025? Sheeps - this needs to be a joke...\n\nThis is an example of a bad dev, don't be fooled for this game.", 0.523809552192688], ["Standard Unreal Engine asset flip that runs way too ambiguously for its content. This game is not worth the $7 it was on sale for much less it's normal price. DNR", 0.523809552192688], ["The worst game ever. Physics, graphics, everything is on the worst level. It's my fault for buying it, but I feel much more calm because I bought it for 5$, instead of 25$. If i made that mistake (buying it for 25$, i would rip my eyes out). Avoid this game at any cost!", 0.523809552192688], ["It's too slow and hard to earn money, and it's annoying to get around by foot or vehicle.", 0.520860493183136], ["Not good at all. The old graphics and driving are awful. Farm animals look strange, guns are terrible, and FPS drops. Just stay away, even if it's on sale.", 0.5124083161354065]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1119730/header.jpg?t=1743433526", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1119730/capsule_231x87.jpg?t=1743433526", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1119730/capsule_184x69.jpg?t=1743433526"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.excalibur-games.com/ranch-simulator"}, "developer": "Toxic Dog", "owners": "1,000,000 .. 2,000,000", "tags": ["Simulation", "Multiplayer", "Online Co-Op", "Open World", "Farming Sim", "Farming", "Job Simulator", "Co-op", "Realistic", "Hunting", "Sandbox", "Singleplayer", "Management", "Economy", "Trading", "Destruction", "Relaxing", "Immersive Sim", "First-Person", "Indie"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese", " Turkish", " Korean", " Polish"], "concurrent_plays": 1591, "number_of_achievements": 39, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Full controller support", "Steam Cloud", "Family Sharing"], "genres": ["Simulation"], "short_description": "Builder. Farmer. Hunter. Trader. Ranching certainly isn’t your average job. Think you have the skills to turn your family’s rundown homestead into the most prosperous ranch in the valley? Then it’s time to head out into the wilderness in this captivating single and multiplayer open-world simulator.", "long_description": null}