{"name": "STAR WARS Jedi: Fallen Order™", "app_id": 1172380, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "CAD", "original_price": "", "final_price": "CDN$ 54.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 67468, "negative_reviews": 8297, "reviews": [["[h1]Star Wars Jedi: Fallen Order[/h1]\nI’ll be honest — I’ve never watched a single Star Wars movie before playing Jedi: Fallen Order. I barely knew who the Jedi even were. But despite that, this game completely drew me in and made me curious about the entire Star Wars universe.\n\nFrom the start, Fallen Order impressed me with its cinematic storytelling and emotional depth. Cal Kestis’ journey felt relatable even without knowing the broader lore. The way the game slowly unveils his past and trauma kept me hooked, and the bond with BD-1? Instant favorite. The world-building, characters, and set pieces all felt so grand and immersive that I didn’t feel left out — instead, I felt pulled in.\n\nGameplay-wise, it’s a satisfying blend of exploration, puzzle-solving, and Souls-like combat. The lightsaber combat is incredibly fun, and using the Force powers just never gets old. The level design reminded me of Metroidvania-style games, with a real sense of reward for backtracking and unlocking new paths.\n\nWhat’s wild is that by the end of the game, I actually wanted to watch the movies and learn more about this galaxy far, far away. Jedi: Fallen Order didn’t just entertain me — it turned me into a curious fan of a franchise I had ignored for years.\n\nYou don’t need to be a Star Wars expert to enjoy this game. It stands strong on its own, but it also opens the door to a much bigger universe. Now, I’ve got a watchlist full of Star Wars content — all thanks to one game.", 0.7412110567092896], ["Had to be in the right mood for it (which took years), but damn this game is actually fantastic. Playing on hard where every parry or dodge matters, having intense duels and fun exploration on a big space adventure. Just a good time all around, with cool characters on both sides. It may not have the deepest narrative, but it was enough to keep me invested. Thank u Shameless actor man you did a good job even though you kinda look like a baby", 0.5911155939102173], ["[b]Star Wars Jedi[/b] turned out to be one of those rare games that feels both overproduced and underwhelming. I can’t recommend it—not with a straight face, anyway. Admittedly, I’ve never been a devoted acolyte of the Star Wars mythos. My exposure is limited to the cultural osmosis of flickering television reruns: something about a Republic, a Darth Vader, and a family named Skywalker. That’s the extent of it.\n\nThe one genuine cultural gift Star Wars ever gave me was a detour into mythology: [i]Joseph Campbell’s The Hero with a Thousand Faces[/i], followed by [i]Christopher Vogler’s The Writer’s Journey[/i]. That was the real adventure—an anthropological deep-dive into narrative structure, far more engrossing than anything this game had to offer.\n\nThe game itself is fragmented across planets, each a showcase of [i]Unreal Engine’s[/i] visual might. Strands of the protagonist’s hair sway delicately in digital wind; gears shudder and slam with satisfying weight. Horizons stretch wide, offering a sense of scale. And yet, once the novelty fades, you're left with the bleak realization: this is a plodding platformer with questionable design choices. Tedious sequences repeat with minor variations, and the Metroidvania-inspired save system means every small triumph is undercut by the resurrection of previously defeated foes.\n\nMy patience ended somewhere on the outskirts of Eilram, when a hologram murmured something about a \"fascinating tomb.\" It wasn’t. I quit shortly after, with the lingering sense that I had been wandering through a tomb myself—one built not for a Jedi, but for fun.\n\nThe first 40 minutes hinted at promise. After that, the narrative dissolved into a monotonous loop of wall-running, rope-swinging, and narrow corridors that induced more claustrophobia than cosmic wonder.\n\nA beautifully rendered box, yes—but peel back the foil, and it’s not chocolate inside. Just licorice taffy. Sticky, bitter, and impossible to chew through.", 0.584796130657196], ["-Combat is crisp.\n-Story is compelling.\n-Planets are looking gorgeous and fun to explore.\n-BD-1 is goated.\n\nVery solid single player Star Wars game.\n", 0.5454545617103577], ["Surprisingly, this is a good standalone game that does not really required you to watch any of the movies. I'm planning to watch it at some point though. All I can say this is a good game. \n\nProbably the only negative I have for this game is the ending felt rushed lmao", 0.54356849193573], ["Star Wars: Jedi Fallen Order is a phenomenal star wars game in years. Felt like it offered the right mix of adrenaline-pumping action and thoughtful exploration. With its amazing story, engaging platforming and combat mechanics, the game is a must-buy, despite the combat being too repetitive and some cringy dialogues on rare occasions which doesn't truly harm the experience as a whole, but still could have been better. By the way, I daresay that this game resembles what a modern Jedi Knight II: Jedi Outcast would have, if that combined the best elements of gameplay defining games, sensibly unified and supported by an amazing story which sets the rules without trying to be ground-breaking.\n\n8/10", 0.5360825061798096], ["Lightsaber combat feels weighty, and the Metroidvania-level design is clever. The story is predictable but heartfelt. Survivor improved it, but this is still a must-play for SW fans.", 0.523809552192688], ["Psst, hey kid, do you want to be a Jedi? Okay well how about some lightsaber combat mixed in with a crapload of extremely long & tedious platforming? \n\nNot only is this game mid, but you need EA origin to even play it.\n\nIf it weren't for the lightsabers, no one would remember this game.\n\nGive me KOTOR or Jedi Outcast over this boring slog any day of the week.", 0.523809552192688], ["One of the best Star Wars games I've played. Outsanding characters very good voice acting. Gameplay is very soulsborne like with puzzles. Great exploration of maps and worlds. 10/10 Overall Game. 100% worth it.", 0.523809552192688], ["This is more of a puzzle game than anything else. Some puzzles are absolutely unbearable and make the game unenjoyable. Good story but bad the endless puzzles ruin the game.", 0.5235601663589478], ["Very very constructive game\nFollows the original story very well\nHighly recommend", 0.5185916423797607], ["From the start, Star Wars Jedi: Fallen Order proves that it's a proper Star Wars game. The story takes place between Episodes 3 and 4, and the main character is Padawan Cal Kestis, who hasn't completed his Jedi training and therefore doesn't have full control of the Force. He has to hide from the Empire and the Inquisitors, who are wiping out the remaining Jedi across the galaxy. Cal is teamed up with pilot Greez and former Jedi Cere, who has decided to renounce the Force. The team must find the Holocron, a list of all children who wield the Force, in order to restore the Jedi Order. The story is fairly simple, but it's all the more beautiful because it takes place in the Star Wars universe.References, cameos and familiar locations - there's plenty of that and the authors have carefully integrated it all into the canon. Overall, fans will be extremely pleased with the plot!", 0.563880980014801], ["Played it originally on EA's Origin a few years ago when I had a subscription, but now doing NG+ on Steam after picking it up for $4 on sale to refresh myself on the story before playing Jedi Survivor. \n\nThe game still looks, plays, and runs great. \n\nIf you've never played it before then it's definitely worth picking up on sale. Regardless of your opinion on the state of Disney's Star Wars, Jedi Fallen Order is a worthy entry in the franchise with it's story and fun gameplay.", 0.5103092789649963], ["great star wars game, bad optimization though", 0.5078643560409546], ["[i]“Trust only in the Force.” - Cere Junda[/i]\r\n[u]Pros:[/u]\r\n+ great cinematic presentation\r\n+ good location design\r\n+ puzzles were fun\r\n+ difficulty can be changed anytime\r\n[u]Cons:[/u]\r\n- predictable story with an unsatisfying moment at the end\r\n- occasional fps drops\r\n- backtracking and zone reuse\r\n- limited enemy variety\r\n- exploration, while fun, feels unrewarding, with most of the rewards being skins for lightsaber/droid/ship", 0.554576575756073], ["I'm 5 hours into it and just got done with the tomb stuff and directions to go to another planet. I decided to explore my way back to the ship, which is ridiculous because it's difficult to learn any semblance of a map layout the way you maneuver through. Also, I'm just Jedi Knight mode and the combat is a pile of hot garbage. I'm using a controller and can't get the system to work properly. It's making it not fun. There's so much crap on Zeffo to explore and some points if  you take the wrong path you can't go back and do the other path you probably should have chosen. It's too convoluted. I got slow and push and they really don't do crap in combat. I don't think I care to go further. Maybe another day, but this just seems like too much work.", 0.5042253732681274], ["If you absolutely have to play a Star Wars game. Some of the content and story that I have watched on this game looks like it could be pretty decent if it was wrapped in a better shell.\r\nUnfortunately the controls are not good and transitions from one animation to the next are so jarring that it gets hard to play after 30 minutes. 2 or 3 times a minute these transitions in the character movement and camera result in the player looking like he is melting, I did not sign up to watch the ending of Roger Rabbit. Any nostalgia and immersion I felt in the first 20 minutes was gone after 90 and I lost interest.\r\nAlso, I just upgraded my graphics card last week and $1400 later, I thought this game would no longer run like Wolfenstien3D or Blake Stone.\r\nI was wrong... very wrong.\r\nDamn... I am so glad I got this for free.", 0.5042253732681274], ["One of the best games I've ever played. I don't want to spoil anything, so I'll just say this is the level I think of when I think about playing a single player game. The gold standard. Well done to all the people involved making this one, honestly :D", 0.5], ["I would rate this game a solid 9.1/10 - there are some interesting bugs still present in this game. Mostly with the lightsabers. That being said 95% of it is a beautiful experience. Great story and I liked where in the story Order 66 came into play. They could have played that hand early to garner sympathy for a new character. Emotional manipulation can fool you into judging something better than what it is. That doesn't happen here just overall great pacing and characters. I think Respawn did a great job. EA still sucks and I have no desire to use their software.", 0.5], ["complete waste of money. characters suck. they're boring. choices mean nothing. combat unresponsive. dodges are basically useless. this game tries to force you to memorize every single enemies attacks for no reason. even the weakest enemies have uninterruptible attacks and perfect dodging but your guy(i dont even remember his name it's that forgettable) cant dodge for shit. you can watch the enemies jerk an extra ten feet in the air towards you when you clearly dodged out of the way just to get a perfect hit on you that takes half your life. this game is nothing but platforming repeatedly through the same areas for cosmetics and horrible combat mechanics. less than half way through the game i just wanted it to be over. \nhas some big action sequences but you're so uninterested by the time they get here that it doesn't even matter. its one of those rare game that it pisses you off how bad it is. you can clearly see the cheating mechanics against dodging encoded into the game. \ni bought this one and the jedi survivor one at the same time, and now i have to do research and see if that game is gonna be as bad as this one too. i might just refund it anyways to be safe. i wish i knew how bad this one was before i put any time into it. i seriously regret buying it and you will too. id rather commit seppuku with a light saber instead of play this game again. \nstar wars? this game is more like doing star chores. got em. \nstar snores\n", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1172380/header.jpg?t=1725901454", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1172380/capsule_231x87.jpg?t=1725901454", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1172380/capsule_184x69.jpg?t=1725901454"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Respawn Entertainment", "owners": "2,000,000 .. 5,000,000", "tags": ["Action-Adventure", "Souls-like", "Third Person", "Open World", "Story Rich", "Swordplay", "Exploration", "Sci-fi", "Action", "Platformer", "Space", "RPG", "Fighting", "Puzzle", "Adventure", "Metroidvania", "Fantasy", "Atmospheric", "Hack and Slash", "Family Friendly"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 1064, "number_of_achievements": 39, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Remote Play on Tablet", "Remote Play on TV", "HDR available"], "genres": ["Action", "Adventure"], "short_description": "A galaxy-spanning adventure awaits in Star Wars Jedi: Fallen Order, a 3rd person action-adventure title from Respawn. An abandoned Padawan must complete his training, develop new powerful Force abilities, and master the art of the lightsaber - all while staying one step ahead of the Empire.", "long_description": null}