{"name": "Red Dead Redemption 2", "app_id": "1174180", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "KRW", "original_price": "", "final_price": "₩ 73,000", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 218615, "negative_reviews": 20764, "reviews": [["---{ Graphics }---\r\n☑ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast (At lowest settings)\r\n☐ Rich boi\r\n☑ Ask NASA if they have a spare computer (At maximum settings)\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☑ Will eat 10% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore \r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☑ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale \r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10 (Seriously, enough reading the reviews, BUY RED DEAD REDEMPTION 2!!!)", 0.8865676522254944], ["The game didn't really sit right with me until I realised that I didn't need to craft every outfit, find every dino bone and obsess over every cig card. This game made me realise that I honestly don't actually enjoy open-world games, and that's fine, because once I put aside the boring hunting and focused only on the story, I had a great adventure.", 0.7416039109230042], ["Rockstar’s Red Dead Redemption 2 isn’t just a game. It’s an entire world frozen in the grit and glory of the American frontier. From its sweeping landscapes to the smallest, dust-covered detail, this is an experience that excels at every level: story, mechanics, immersion, and sheer atmosphere. The voice acting is stellar, and the immersion and emphasis on the day-to-day actions of the NPCs on this game is mindblowing. Hell, you can see NPCs actually hammering nails in, the focus on the small details is that deep.\n\nThere's also a plethora of roleplaying communities set in the world of RDR2, text and voice alike, if those are to your liking.", 0.6646755337715149], ["Rockstar’s New Update: A Privacy Nightmare?\nI’ve always enjoyed gaming, but Rockstar’s latest update has crossed the line. Imagine needing to grant extensive access to your PC just to play an offline game—sounds absurd, right? But that’s exactly what’s happening. The game now demands permissions to read my system and run in the background. For what purpose? It’s invasive, unnecessary, and raises serious privacy concerns.\nTo make matters worse, the update seemingly restricts tools like IP blockers or changes—tools that many rely on for cybersecurity and protection against hackers. Instead of safeguarding us from vulnerabilities, this move feels like gamers are being put in harm’s way while also being stripped of control over their systems.\nThis level of overreach is unprecedented. No game should demand this much access to a user’s PC. I believe it’s time to take a stand—not only for our own privacy but for the entire gaming community.\nFor those who feel the same, reach out to Rockstar and demand accountability. Request refunds if needed. Let platforms like Steam know about these over-the-top permissions. Spread awareness and encourage others to hold companies like this accountable. Rockstar has 30 days to issue a full refund or address these concerns appropriately.\nTogether, we can send a message: our privacy matters, and we won’t compromise just for the sake of a game.", 0.6336989998817444], ["The best game I've ever played in my life. Perfect world, gameplay, voice actor, the vibes, the story, the details, all is just soo perfect. If only the mission never ended i will play forever.", 0.6321424841880798], ["Fuck rockstar and their metadata sucking launcher. Would be a great game if I could A) play the SINGLE PLAYER GAME OFFLINE and B) I wasn't forced to download a fucking launcher to play a SINGLE PLAYER GAME I purchased on STEAM.", 0.6319749355316162], ["the game is solid and very fun or at least it was until i found out that rockstar has bound my steam account to my dead daughters email that i cant access so now i can never play any of rockstar games again so i guess im out for all rockstar products for life and every time i try to play i g et to dwell on my lost child, im not saying dont play it, cause i love the game but be very careful before you deal with rockstar", 0.6156284213066101], ["Rockstar's account linking is god awful for PC users. I don't care if the game is an 11/10, if you make it a pain to launch and play because of the account linking crap I'm down voting your game so others know. Also, this is my second time buying this, gave it rave reviews on PS4. But this account linking stuff is nonsense. Not all players want to go online anyway, so save that as a prompt for if you open the online section, simple. However, forcing it on every user who buys it, is reprehensible, especially knowing how you milk your games more than any company in the history of gaming. Now you've had Skyrim copying you, regarding selling the same game for a premium price across multiple generations, but at least that game doesn't force you to create an online account to play it. This will be the last time you swindle me out of my money again Rockstar, I'll wait till you've added all the cool DLC 14 years from now before I touch GTA 6, maybe... If i even decide to play it. \n\nAt the end of the day, I just wanna buy, install, and play a game. Not jump hoops to play a rehashed game that's 6 years old, especially when I never intend to play it's online mode anyway... At this point, between this account linking mess and the atrocious trilogy remake they released recently that everyone hates, I have lost faith in Rockstar until they regain it with actions that the gaming community will benefit from.", 0.6033461689949036], ["I dont like american XIXth far west setting.\r\nTo me, most open world games feels the same and i lose interest rapidly.\r\n\r\nYet i love this game because it has a soul.", 0.6016786694526672], ["- Paid for the game.\n- Unable to play due to Rockstar's launcher. \n- Contact Rockstar's support team.\n- Support team asks for proof I own my steam account, have a receipt in my email, ownership of email. \n- Send them the exact screenshots they have requesting providing proof of ownership. \n- Say it's not sufficient evidence and close the ticket. \n- Refund game\nROCKSTAR GAME'S SUPPORT TEAM SEARCHES FOR \"PERSONALITY\" ON PORNHUB\nROCKSTAR GAME'S SUPPORT TEAM COULD SUCK START A SEIZED 6.7L CUMMINS \nROCKSTAR GAME'S SUPPORT TEAM EATS SNICKERS UPSIDE DOWN TO FEEL THE VEINY PART ON THEIR TONGUE\nROCKSTAR GAME'S SUPPORT TEAM THE TYPE OF PEOPLE TO SAY \"GEEZE LOUISE\"\nROCKSTAR GAME'S SUPPORT TEAM HIRE AN ESCORT AND ASK THEM IF SHE'S IN IT FOR THE MONEY\nROCKSTAR GAME'S SUPPORT TEAM SAYS \"WOW I NEEDED THIS\" WHEN OUT WITH FRIENDS\nROCKSTAR GAME'S SUPPORT TEAM COVER EACH OTHERS EYES AND SAY \"GUESS WHO\"\nROCKSTAR GAME'S SUPPORT TEAM POINT GUNS AT NPC'S AND THEN PUT THE CONTROLLER DOWN AND SAY \"I CANT DO THIS\"\nROCKSTAR GAME'S SUPPORT TEAM STANDS BEHIND YOU AT THE WATER FOUNTAIN AND SAY \"1,2,3, THAT'S ENOUGH FOR ME\"\nROCKSTAR GAME'S SUPPORT TEAM SAY \"WE GOT COMPANY\" WHEN COPS ARRIVE", 0.5964559316635132], ["At the time of writing this review, no game has ever made me feel such a wide range of emotions—happiness, sadness, and laughter. No game has ever left such a deep impression on my heart. Red Dead Redemption 2 deserves to be recognized as the game of the century.", 0.5652173757553101], ["Tried buying this since it's on sale. I launched only to find out I can't play because the rockstar launcher automatically assigned a deleted email to the account. The only way to change this email is to open an email sent to it which is literally impossible. \n\nI won't be buying any future games from rock star and am refunding this one unless they get rid of there nonsensical drm system or at the very least make it reasonable. If I buy the game on steam let me launch in through steam why do I need to verify through your garbage launcher you don't even maintain? Probably just going to pirate this game at this point drm is lame as hell.", 0.5640296936035156], ["Red Dead Redemption 2 feels like Grand Theft Auto in 1889 western America – playing as an outlaw involving in shootouts, robberies, theft, chases and more. Hunting is a new addition, but it does not feel significant as it could have been. The in-game economy is also flawed - while making money is a core motivator, there’s little to spend on. I also ran into the issue of getting a bounty out of nowhere, and losing honor for actions like looting corpses feels unfair. Still, gameplay remains enjoyable overall, even if it is not particularly innovative or highly interactive.\n\nMy biggest complaint with the game is the control: since almost every interaction requires holding buttons, it feels slow and inconvenient. It was designed to mitigate wrong input, but oddly, picking up weapon is one of the few interactions that only takes a quick tab – the same as holstering weapons. As a result, you often change weapons by mistake when you merely want to holster them. There's also an issue with interacting with objects: prompts often fail to appear unless you adjust the camera just right, and sometimes you can “select” certain items at all if it happens to have multiple interactive items in the vicinity.\n\nEven though the game was released in 2018, it still holds up as one of the best-looking games today, but only if you figure out the complex graphics settings, otherwise, it may look blurry and run poorly. But with the right tweaks, the world is just stunning, not just because of the beautiful landscapes and realistic western towns, but also how Rockstar built the world is amazing. The way people behave, the tone they talk, the activities they have and the thoughts they hold – all are brimming with a deep sense of history and culture. This rich cultural atmosphere makes the world feel genuinely lived-in and authentic.\n\nHow the world interacts with players is also very refreshing. In typical open worlds, like those lifeless checklist open worlds from Ubisoft, players are asked to grind event icons on the map. To me, it feels like players have to deliberately push things to happen, otherwise, the world remains static. In Red Dead Redemption 2, there is no overwhelming number of icons. Instead, events unfold naturally as you explore – you might encounter random events that turn into mini quests, discover secluded locations with secrets and backstories, or meet NPCs who have interesting information to share. The world feels dynamic and alive, like players just happen to be in the right place at the right time, giving a strong sense of “encounter”.  I think that is why the world is so immersive.\n\n\nThe story features a lot of characters, and each develops through character specific quests. Honestly, quests are not enough in terms of number and depth for such a large cast of characters. However, from what it has, I think the game still does a good job of establishing key character traits with concise dialogue and thoughtful plotlines. More importantly, it portrays characters with both their beautiful and ugly sides, adding the complexity that makes characters human. It is rare to see stories where characters aren’t just simple black and white, and this nuance gives the story much stronger emotional impact and greater depth. The extraordinary writing brings a soul to the game.\n\nThe lingering music and outstanding voice acting definitely add more flavors to the game, but at the end of the day, it is the immersive world and exceptional writing that make it one of the greatest games of all time. Surely, the game is a slow burn, with control feeling clunky at first and several gameplay flaws, but once the game starts to click, it becomes an unforgettable experience.", 0.5507985949516296], ["The game can and will crash at random, whether it be a driver issue or otherwise. I do not recommend buying or playing this game if you have an AMD graphics card. None of the fixes I'd seen online work.\n\nGPU: RX 7800XT\nCPU: Ryzen 7 5800X3D\n\nThe game itself is beautiful otherwise, and is a gem. \n\nNothing bad to say about it other than this PC port is very poorly optimized, and for that reason, I can't recommend it under that circumstance.", 0.5465975999832153], ["Yeah, the game’s got a painfully slow start—no denying that—but it’s all intentional. It’s designed to pull you into the world. I hit that same wall restarting on PS4 Pro, then PS5, and finally just muscled through it on PC. No regrets.\n\nIf I had to sum up the game in one word: beautiful. The open world is insane—nothing else really compares. Arthur? He’s a funny asshole, and somehow, you end up loving the guy. The gang’s a wild mix of people you’ll cheer for and want to punch in the face.\n\nIt’s the cowboy simulator, plain and simple.\n", 0.5449531078338623], ["Don't buy it.... You need a rockstar account and use their idiotic game launcher which probably has already linked your steam account to an email that doesn't exist, which pretty much makes this game useless the moment you try to launch it.\n\nRockstar certainly managed to put together the worst system ever known to man in terms of game launchers and game activations.\n\nLong story short, you basically throw you money into a fire pit. If this is your kind of kink then go for it.", 0.5419847369194031], ["Red Dead Redemption 2 is more than just a game, it’s an experience that sticks with you long after the credits roll. I’ve played a lot of games, but very few hit as hard as this one. It pulls you in with its beautiful open world, its insane level of detail, and most of all, its characters. Arthur Morgan is one of the greatest protagonists ever written. Not just in gaming. You watch this man wrestle with guilt, loyalty, and redemption in a world that’s slowly dying around him. His journey is powerful, but also heartbreaking. And it’s not the kind of heartbreak that’s forced or cheap—it’s slow, quiet, and painfully human. The way it all plays out? It gutted me.The story itself is incredibly well-written and mature. It takes its time, gives room for every moment to matter, and when it chooses to break you, it really does. It’s rare to see a game with that kind of emotional weight. And none of it would land if it weren’t for how alive the world feels. The open world isn’t just big, it’s believable. Every inch of it has purpose, and even the most mundane moments feel special because of the way it's presented. Even just riding a horse through the countryside while a somber song plays can feel more impactful than most “epic” moments in other games. The combat is solid, the mechanics can feel a little sluggish at times, but honestly, it works for the kind of game this is. It’s grounded. It wants you to feel every movement, not rush through it like an arcade shooter.\n\nRed Dead Redemption 2 is easily one of the greatest games ever made. It respects your time, your patience, your emotions and in return, it gives you something that stays with you. I loved it. And it broke my heart in all the right ways.", 0.6415979862213135], ["rockstar launcher sucks wont even let me load this game, tried re-installing, deleting everything relating  to launcher and game, adding game and launcher to firewall exception but nothing works. was a big fan  but why do these companies have to always create these horrible launcher wasted like £60 for a game i cant play.", 0.5393244028091431], ["First 3 hours of the game is forced story which felt slow.\nThe 5 hours I played you were free to explore, which felt amazing. \nThen the game crashed and the rockstar client refused to ever connect to the servers ever again. Forced online DRM in a single player game with the absolute worst launcher ever is a recipe for failure. The client is a minefield of problems and for some people it never even works from the beginning. I have to refund the game.\n\n+Game is good\n------------------------ Launcher is literally the worst pile of dogshit you have ever installed. Worse than malware.", 0.535768985748291], ["Im playing this game in a VR headset with xbox controller. I HIGHLY RECOMMEND!!\r\nExtremely Immersive. You would not regret buying this game. Well Unless you have a life and wife and kids. you will be hooked playing this game.", 0.53125]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1174180/header.jpg?t=1720558643", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1174180/capsule_231x87.jpg?t=1720558643", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1174180/capsule_184x69.jpg?t=1720558643"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.rockstargames.com/reddeadredemption2/"}, "developer": "Rockstar Games", "owners": "10,000,000 .. 20,000,000", "tags": ["Open World", "Story Rich", "Western", "Adventure", "Multiplayer", "Action", "Realistic", "Singleplayer", "Shooter", "Atmospheric", "Horses", "Beautiful", "Mature", "Third-Person Shooter", "Great Soundtrack", "Third Person", "Gore", "Sandbox", "First-Person", "FPS"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Portugal", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 51374, "number_of_achievements": 51, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action", "Adventure"], "short_description": "Winner of over 175 Game of the Year Awards and recipient of over 250 perfect scores, RDR2 is the epic tale of outlaw Arthur Morgan and the infamous Van der Linde gang, on the run across America at the dawn of the modern age. Also includes access to the shared living world of Red Dead Online.", "long_description": null}