{"name": "NARAKA: BLADEPOINT", "app_id": "1203220", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 10518, "negative_reviews": 2313, "reviews": [["Very underrated game, good BR, big boobas, thick thighs and mechanics, 10/10 would recommend", 0.6437742710113525], ["Not gonna lie, I really enjoy this. The pvp is great and making different combos with the weapons is fun for me. I've unlocked all the heroes without spending a cent and even unlocked skins without having to spend anything.\n\nPeople whine about bots and whatnot in some reviews ive seen. Where some others say the servers are bad. I've never once ran into this issue with the 200+ hrs ive played so far.", 0.523809552192688], ["Better then other battle royals and sick customization, can be frustrating at times but love this game!", 0.5], ["i love this game. gameplay is tight, maps are gorgeous, characters are all fun and different. Getting better at the system mechanics feels rewarding and theres so many weapons and combos  to master. If there were more freebies, or more free ways to earn the beautiful cosmetics in this game- it would be one of my favorite pvp games of all time. The game is just too expensive if you want to enjoy all the amazing designs.", 0.5], ["This is the best BR game in my opinion. I tried many and this stands out the most because of the uniqueness of combat.", 0.5], ["Great game but just dont play ranked its filled with the most jobless and maidenless mofos in the planet", 0.5], ["Overall was good but just that there's still a little difficult for beginner to control", 0.5], ["Definitely would recommend for anyone looking for a unique combat experience 10/10 \n\nAlthough its rough around the edges and can take some getting used to, the game is amazing once you get a grasp on it and has all kinds of fun and challenging experiences as you go through your journey of playing.\n\nCombat fundamentals are like a fighting game\nMovement options like a parkour game\nDesign and customization like an MMORPG\nVaried game modes and unique maps like a battle royale\n\nTheres going to be something that anyone can appreicate from this game and hope more people give it a chance", 0.5], ["I really love this game I would highly recommend this to people who really like martial arts i can never get bord from this game", 0.4848484992980957], ["When wealth gathers, people disperse, and when wealth scatters, people gather", 0.52173912525177], ["d", 0.4761904776096344], ["Last time I played was like 2 years ago. I reinstalled it today and login, first thing that pops on my screen is the loudest cosmetic ad video playing, second thing is the bottom right where it said non skippable untill 15 seconds. SO I exit the game and uninstall it and go watch Youtube instead :)", 0.5090987086296082], ["that shit, i played on 4090 24g, i9 14900 but only this game keep fuckin crash", 0.5], ["༼ つ ◕_◕ ༽つ =–—=} ↷\n\na very good game and I am very positive about the game. Since it is only a \"Free Game\", the game offers a lot of exciting game experience as well as a lot of action and that not a little. The style of the game and the options you have in the game are very appealing and fun. The game is highly recommended in my opinion, it's worth a try", 0.5], ["I've been playing this game on & off for around 4 years (this will be the 4th, as I was D1)\nA lot of time was spent in the beta servers or PS.\n\nThis game came out at a terrible time, being the craze and hype of Apex, Val and resurgence of Fortnite.\nIt kept to it's community which MY GOODNESS is AMAZING. The devs are constantly taking criticism and talk with their community via various media platforms and it's shaped up to be a REALLY good BR. If not one of the best. \n\nNaraka sports an EXTREMELY HARD learning curve and it will take time to learn weapon combos, movement combos and character combos. That seems like a lot, because it is.. The characters you play work better with various weapons, till you play long enough to vet and interchange weapons with the characters without any issues. Combos in this game are key once you get into ranked, more so the higher side of ranked. That alone takes the cake for me, as I play fighting games a lot and find myself competing in tournaments as well. To tie into the community aspect, they have Dojos via their Discord, which are essentially people well versed in the game, who are open to coaching you on all aspects of Naraka, whether it be Characters, weapons or movement. (pretty Neat right!) \n\nEvents are very frequent, normally having a handful each season, which snag you nice costumes for your weapons and characters, items to open lootboxes or help with your ranked/showdown experience. The only stinker is that they are all limited events and only some select things from those events stay in shops for you to buy said skins, so this game, like many others are BIG in Fomo. \n\nAlong with the events, each season comes with a lootbox pool (or banner for my gacha players), which can snag you EVEN MORE outfits outside of what is offered in the Battle Passes. I often find myself lost in the amount of cool things each lootbox offers, but these can always be opened even beyond the date of the season pass, which I think is amazing, because if you miss out during the season, you aren't locked out from those items, though they are harder to get the specific boxes to unlock them.. so it's a trade off and one i'm not complaining over. \n\nThe characters themselves are fresh and come with unique skill sets and full of personality. Another feature that Naraka has Introduced into the BR scene, is the ability to fully customize EACH and EVERY character to your liking, as if you were playing an MMO, which I've never seen done in a BR, to this scale and I absolutely find myself spending a good couple hours creating themed outfits for my mains.\n\nI find it cool that a game like this exists as it's been something that I've wanted for a while, as the other BR games are cliche (fps wise). You have to truly learn the game and adapt to different situations. I'd highly recommend this game if you enjoy a challenge and even more so if you enjoy fighting games, or games with good movement. Though do be weary that your first couple of games will be bots and past that you'll get thrown in with high ranking players, as it's going to be casual play only. \n\nNaraka has a great solo \"story mode\" called Showdown, which I myself never tried till recently and want to slap myself for not doing so when it came out about a year or so ago. Also great practice for new players as it's PVE only. \n\nOther than that, some items are easy to come across, While others will take you a fair amount of time to acquire. You get a lot of nice goodies when starting out, but there are a decent (understatement) amount of purchasable skins, which unfortunately are pretty costly, but do go on discount rotation quite frequently. \n\nTLDR- Give it a shot if you enjoy fighting games, character customizing and BRs, but expect to put time into it to learn through it's steep curve.", 0.5], ["This game is difficult to start and often crashes.\nThe most important thing is that the developers of this game do not respect PVE players, constantly improving the level of consciousness and constantly launching new jades.\nThe soul jades, consciousness levels and potentials that players have worked hard to obtain with time and energy have become a joke after the version update.\nAlthough I like this game very much, if the game developers do not respect the players, there is no future.", 0.5], ["Git Gud Simulator would get juggled again.", 0.523809552192688], ["Riddled with cheaters.", 0.5], ["i love this game", 0.5067817568778992], ["great game", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1203220/69531442db0cbb2581bfe842a24e270536648b5b/header.jpg?t=1743561922", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1203220/e2363e02564c4f887a6e6386fcb53b8cd879139a/capsule_231x87.jpg?t=1743561922", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1203220/e2363e02564c4f887a6e6386fcb53b8cd879139a/capsule_184x69.jpg?t=1743561922"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.narakathegame.com"}, "developer": "24 Entertainment", "owners": "20,000,000 .. 50,000,000", "tags": ["Battle Royale", "Multiplayer", "Martial Arts", "Mature", "PvP", "Action", "Female Protagonist", "Character Customization", "Massively Multiplayer", "Fighting", "Survival", "Third Person", "Swordplay", "Hack and Slash", "Anime", "Parkour", "Adventure", "Free to Play", "Violent", "Gore"], "languages": ["English", " Simplified Chinese", " Traditional Chinese", " Japanese", " Korean", " French", " German", " Spanish - Spain", " Russian", " Turkish", " Portuguese - Portugal", " Vietnamese", " Thai"], "concurrent_plays": 145364, "number_of_achievements": 40, "categories": ["Multi-player", "PvP", "Online PvP", "Steam Achievements", "Steam Trading Cards", "In-App Purchases", "Partial Controller Support", "HDR available"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "short_description": "Dive into the legends of the Far East in NARAKA: BLADEPOINT; team up with friends in fast-paced melee fights for a Battle Royale experience unlike any other. Find your playstyle with a varied cast of heroes with unique skills. More than 20 million players have already joined the fray, play free now!", "long_description": null}