{"name": "The Sims™ 4", "app_id": 1222670, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 39237, "negative_reviews": 5165, "reviews": [["As someone who loves the Sims 4 franchise, I absolutely do not recommend downloading this. Not only is it's status as a \"Free to Play\" game an insult to those of us who spent good money to buy this game before EA made it free, but an EA account being required is just unnecessary for those that don't have the need for one.\r\n\r\nFurther more, the advertisements for DLC packs are everywhere, meaning as long as you are playing, you are allowing yourself to have ads shoved in your face in the menu. I will not judge you if you want to download this, but those of us boycotting EA would appreciate it if you didn't.", 0.8053684830665588], ["Nah ... For you all it's free and for that it's good, but essentially it's just a marketing strategy for you to buy each DLC individually – which in turn means it's not really \"free\". Many have bought the base game before it was free.\n\nIt's just a little over $1000 to get all the DLCs ...\n\nNo – it's not a joke.\n\nIf this doesn't faze you, then you're already lost. It's over. I feel sorry for you.\n\nI mean, with that money you can travel to Japan or buy a decent couch if there's a sale.\n\nMy message: Honestly, do whatever you want. This franchise is just trash and there's better options to spend your money on – especially since most people will eventually spend money on things they invest their time on.", 0.5861851572990417], ["I love this game but i cannot support the absolute CASHGRAB this game has become. Yes, they made the game free, but that is because every DLC is the price of an ENTIRE game!! These DLC are small enough that they can make hundreds of them, too. ($900 for all of the DLC, and half of the content they add seriously should've been in the base game, but they intentionally leave it out so that they can get more profit later. would be better if the individual prices were lower or if they combined a lot of these dlc.) it used to be better...\n\nAs for game play, Sims 4 focuses on the sims relationships and actions more than the world. The world is NOT open and you only really focus on one building and its surrounding areas at a time. While this is a downgrade from Sims 3, the interaction, AI, and relationship dynamics are much more interesting and enjoyable in the Sims 4 over the Sims 3.", 0.5454545617103577], ["still a fantastic life sims game that offers endless creativity and fun. but i must admit the expansion packs often feel overpriced and fragmented. Many core features that should have been in the base game are locked behind costly DLCs, making the full experience expensive. Plus some expansions lack depth.", 0.5454545617103577], ["\"This game is an insult to gamers.\"\nI paid for The Sims 4 only to watch it go free while being locked out of what I paid for because of EA's dumpster fire of a launcher. It’s not just the bugs, the crashes, or the constant updates breaking things—it’s the sheer disrespect for paying customers.\n\nAnd let’s not forget the $2,028.06 worth of DLC. Yes, you read that right. A full collection of Sims 4 content costs more than most gaming PCs. It’s a blatant money grab disguised as a life simulator, squeezing every penny from loyal players.\n\nEA’s business practices have been shady for years: overpriced DLCs, pay-to-win mechanics, and now a launcher so bad it makes me nostalgic for the days of CDs. If you want to alienate your player base and push people to other platforms, congrats, EA, you’re doing a fantastic job.\n\nInstead of building trust, they double down on greed, and the result is a franchise that used to be beloved but is now a hollow cash grab. Gamers deserve better than this corporate nonsense.", 0.5395127534866333], ["Bought the game roughly 10 years ago. Had a lot of fun for 10 hours or so, but ran out of interesting stuff to do and moved on. Felt like playing again after a while and had fun for 2-4 hours before realizing i was doing the same things as my first save and once again ran out of stuff to do. Couple years later, bought DLC during a sale and had fun for a few hours before once again feeling like i had my fill of the gameplay loop. Now in 2025 i feel like i would like to play for a bit once again, but i know it will be the same gameplay loop as last time unless i buy more DLC. \n\nEvery other game I've owned for 10 years has had countless content updates or at least a squeal/successor. The Sims 4 has simply had more DLCs. If i want to play other 10 year old games with all their new content updates, i just play them and do so. With The Sims 4, if i want to play a 10 year old game with all its content updates, then i need to pay (at the time of writing) $1,400 USD for all the DLC they've pumped out in that same time. Now you could argue that most of that is cosmetic packs, but just one of the most recent actual content update packs costs $40 USD; this more than i had payed for the actual game originally before it went F2P.\n\nAll in all. If you've never played any of The Sims games, its worth it for as long as you're entertained without buying any DLCs. If you do buy any, you will get bored of them just as quickly you did the base game and feel the need to buy another. And another. And another. This is how EA milks their customers: by providing the bare minimum of innovation and charging a AAA premium price for the privilege of experiencing it.", 0.5334685444831848], ["I've only played Sims 4 so far for maybe a few days, but the only DLC I could stand to buy for it was Seasons and the game hasn't really impressed me at all.\nThe world's kind of tiny and there's not much to do, except decorate the house and sit around in it until you're bothered by random neighborhood joggers who think a fun evening is knocking on a stranger's door and asking to come in.\nThe jobs are all mostly interchangeable and meaningless. The only places to go are the bar, the gym, the park, and the \"lounge\"—you can't even go have dinner at a restaurant or anything like that—and I'm honestly just kind of disappointed with the content available in such a flagship AAA series. This DLC backlog also makes Stellaris' and Crusader Kings' look like an honest bargain, it's nuts.\nMaybe my thoughts will change if I give it more time. I still haven't tried mods as of writing this, but as it stands, vanilla Sims 4 just doesn't engage me at all.\n\n[b]EDIT:[/b] \nSo I've been messing around with Sims 4 mods, and I guess the game's a little better. It's still not very great. Like, I'm happier now that I've learned I can enable \"no trespassing\" to keep randoms from knocking on the door, and I guess it's nice that I can mod more guitars in where the game only had like three. But I'm still disappointed that the actual simulations only seem to happen in the small area that you're in. Every person in the world does regular walks down your street at least once a week, probably because they just wouldn't exist if they didn't.\nAnd I just don't like that making friends means that your friends spend half of their waking lives on your couch, watching your TV, (poorly) playing your instruments, or browsing your books until they [i]need[/i] to be somewhere else. Like I regularly have guests over until 2:00AM long after my sim's gone to bed, just making themselves at home. I also don't like that I can't go literally next door without facing a loading screen.\nI thought the game might turn around if I gave it some more time, tried modding through what I didn't like, and really tried to enjoy it. But I just don't like it, man, I don't know. And I don't think any of the DLCs could possibly address the parts of Sims 4 that bother me.", 0.523809552192688], ["honestly surprised there aren't more negative reviews, this game is fun for a while but the DLC is nearly required to enjoy it fully due to the lack of actual free content there is in the game. The DLC and EA themselves are a big joke, such a good potential game wasted on a greedy company, don't play this if you aren't willing to drop a grand on the DLC.", 0.52173912525177], ["I would recommend this if it didn't lock functionality and gameplay behind DLC paywalls that are as expensive as a AAA game. But what is an EA game without EA greed, amirite?", 0.5185185670852661], ["It's an ok second screen game but I don't recommend to get deep into this game because the numerous price model is very predatory. For the price tag of $10 per DLC, other games give this as free content. If you were to buy every DLC, game pack, and kit, the cost would be around $1,200.", 0.5096582174301147], ["Fans got me a 3-day ban on reddit so I’m deeming their game as inferior to inZOI in my book. Anyone who spends the thousands EA demands needs to reassess their lives.", 0.5045045018196106], ["Been playing for years on different platforms, this game has gotten exponentially better since it first dropped, are there still things wrong? Yeah. With every DLC and pack they add there will always be things that break. While the DLC and stuff is fun, don’t buy it unless it’s on sale, and remember kids mods exist. \nThe game gets more and more difficult and entertaining the more packs you have, but that also means if you have a potato it will be baked.", 0.5], ["All DLCs are too expensive.  :d\r\n.\r\n.\r\n.\r\n.\r\n.\r\n\r\nRating\r\n\r\n---{Graphics}---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☑ Decent\r\n☐ Bad\r\n☐ 16 bit\r\n\r\n---{Gameplay}---\r\n☐ Very good\r\n☐ Good\r\n☑ It‘s just gameplay.\r\n☐ Not good\r\n☐ Bad\r\n\r\n---{Audio}---\r\n☐ Very good\r\n☐ Good\r\n☑ Not too bad\r\n☐ Bad\r\n☐ Mario sound\r\n\r\n---{Audience}---\r\n☐ Everyone\r\n☐ Kids\r\n☐ Teens\r\n☐ Adults\r\n☐ The elderly\r\n☑☑☑ Pool Murderer\r\n\r\n---{PC Requirements}---\r\n☐ windows 98\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast PC\r\n☐ alienware\r\n☐ NASA computer\r\n\r\n---{Difficulity}---\r\n☑ Just use mouse.\r\n☐ Easy\r\n☐ Easy to learn / Hard to master.\r\n☐ Difficult\r\n☐ Dark Souls IV\r\n\r\n---{Story}---\r\n☑ No Story?\r\n☐ Memo\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It‘ll replace your life.\r\n\r\n---{Game Time}---\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ Infinity\r\n\r\n---{Price}---\r\n☑ It’s free!  (Previously...it wasn't free.)\r\n☐ Worth the price.\r\n☐ Not Worth.\r\n☐ You just burn your money.\r\n\r\n---{Bugs}---\r\n☐ Never heard of.\r\n☑ Minor bugs.\r\n☐ Can get annoying.\r\n☐ There are bugs every 1 minute.\r\n____________________________\r\nFor this game.", 0.5], ["$1,429.06.  Hiding so much content behind an insane paywall makes it impossible to recommend this game.  It is enjoyable, but you just feel like you are missing out on so much and constantly waiting for sales.  I can't see any justification on that price for DLC.  Poor form EA.", 0.5], ["I really enjoy this game, very good for story telling and creativity. only downside is that each expansion cost as much as a whole game would on its own ;( but even when working with the basics or very few packs you can make a good storyline thats fun to follow.", 0.5], ["I've been trying to launch the game for hours and instead of launching so I can play, it's launching in the background and counting those hours. Mind you, I have yet to get a play in so this kinda sucks. It launched two times when I was checking to make sure it works and I haven't been able to launch it since then.", 0.5], ["The DLC is what makes this game a ripoff, the basegame is very empty feeling, get Sims 3 instead", 0.5], ["I love the game play in general but it'd be more enjoyable if people didn't have to buy so many packs and add-on's just to actually be able to create something. Some people struggle with money and can't spend it on a video game. So if you don't have some spare money to spend on this game, I don't recommend buying it, but if you do and enjoy building unique houses and characters? Feel free.", 0.5], ["game wont fucking launch. keeps telling me to reset my password and that the app needs to be restarted", 0.5], ["I have been an avid Sims lover since childhood. I really do love the Sims 4!! However, EA/Sims Team really needs to listen to it's players because there are broken packs and features that are really annoying. Other than that, great game!!!", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1222670/header_alt_assets_7.jpg?t=1744305171", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1222670/20f1b36f311b56cd6863fa9bc909abab482792df/capsule_231x87_alt_assets_7.jpg?t=1744305171", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1222670/20f1b36f311b56cd6863fa9bc909abab482792df/capsule_184x69_alt_assets_7.jpg?t=1744305171"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.ea.com/games/the-sims/the-sims-4"}, "developer": "Maxis", "owners": "10,000,000 .. 20,000,000", "tags": ["Life Sim", "Free to Play", "Character Customization", "Building", "Romance", "Simulation", "Sandbox", "Singleplayer", "Dating Sim", "Relaxing", "Casual", "Realistic", "Funny", "Family Friendly", "Fantasy", "Cute", "Immersive Sim", "Adventure", "Cartoony", "Nudity"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Czech", " Danish", " Dutch", " Japanese", " Norwegian", " Polish", " Portuguese - Brazil", " Russian", " Swedish", " Finnish", " Traditional Chinese", " Simplified Chinese", " Korean"], "concurrent_plays": 32652, "number_of_achievements": null, "categories": ["Single-player", "Steam Trading Cards", "Remote Play on Tablet"], "genres": ["Adventure", "Casual", "Simulation", "Free To Play"], "short_description": "Play with life and discover the possibilities. Unleash your imagination and create a world of Sims that’s wholly unique. Explore and customize every detail from Sims to homes–and much more.", "long_description": null}