{"name": "Battlefield™ V", "app_id": "1238810", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£44.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 22166, "negative_reviews": 9124, "reviews": [["Can you PLEASE fix your Goddamn anti-cheat? I can't even launch the game, even after closing almost every running program and enabling secure boot.", 0.7043167948722839], ["Requires EA app to launch, which was understood. \r\nWhat isn't fine is that the EA app (and even back when it was Origin), is unreliable and buggy. Have not been able to play for about a week, and there is no official statement or guide on fixing the error despite finding multiple threads about the same issue.", 0.6925292611122131], ["[b]Delist EA[/b]. Forcing third-party accounts and banning for inactivity with no appeal is predatory.", 0.6274895668029785], ["This review is based on 100% completion and 55.5 hours of gameplay.\n\n[h1][b]Recommendation:[/b][/h1]  \nWould I recommend this game? I would, but with caveats. While the game is decent, I would encourage players to consider other titles in the [i]Battlefield[/i] series, such as [i]Battlefield 1[/i] and [i]4[/i], before settling on this one. Also, be aware that it's quite large, taking up 91.5GB of space.\n\nBefore I go into what I enjoy about this game, I want to highlight an important factor for anyone in the Oceanic region, like myself. Although finding games is possible, you will likely experience a high ping, averaging around 125. Occasionally, you might stumble upon a dedicated Oceanic server, but in my experience, these tended to pop up mainly on weekends. This is crucial to keep in mind since the game is primarily an online experience, and the quality of your connection can significantly impact your enjoyment.\n\nVisually, the game is stunning; the developers have clearly aimed for a cinematic experience in the design. However, the user interface leaves much to be desired. It’s not intuitive at all, and many improvements could have been made to enhance usability. The sound design generally works well, although I found that playing without headphones made everything feel a bit quiet and off. Overall, the audio experience is decent but could be better.\n\nThe short campaigns in the game are okay — not remarkable, but they do offer some engaging narratives. I found that when playing on hardcore, the AI can be merciless with their aim, so you'll want to remain close to cover as often as possible. Nevertheless, it is entirely feasible to complete each story on the hardest difficulty.\n\nThe multiplayer component, which is the core experience of this game, can be a real mixed bag. It can be exhilarating one moment and incredibly frustrating the next for a variety of reasons. One of the main issues for me is the connectivity. As mentioned earlier, this is largely beyond anyone’s control, but it does create challenges when playing with friends, especially if they live across the globe. In such situations, someone inevitably has to cope with poor connections. Another downside is the presence of cheaters and hackers, which can undoubtedly tarnish the gameplay experience. I encountered two prominent types: one that annihilated the entire lobby repeatedly, including their own team, and another that had speed and invincibility. Additionally, the limited selection of maps can lead to monotony quite quickly. In my case, it was largely due to not enjoying the maps themselves, but this is subjective and may vary for different players. \n\nFor myself, I often found my options limited to conquest modes since those were the only games I could join with a low ping; if you're located closer to Europe or America, this likely won't be an issue for you.\n\nThough I could spend time detailing various complaints about connection issues and the toxic behaviour of some players, I did manage to enjoy myself when the games were running smoothly. There's a broad array of weapons to experiment with across different classes, each offering its own unique playstyle. The vehicles are also quite fun to use [i](I’m referring specifically to tanks, as I struggle with flying in these games)[/i], and like most multiplayer experiences, it's far more enjoyable when played with friends.\n\nIn conclusion, the game is a decent choice if you’re looking to hop into a [i]Battlefield[/i] experience. However, if you reside far from major player bases, like I do in the Oceanic region, you might want to think twice before investing your money. While I believe the game has its merits, I would not recommend purchasing it at full price; instead, I suggest waiting for a significant sale before making a decision.\n \n[h1][b]Achievements:[/b][/h1]\nThe achievements in this game are predominantly focused on multiplayer, with a few tied to the campaign and difficulty.\n\nCampaign achievements aren’t too complicated, but they do require you to complete three out of the four stories on the hardest difficulty. This can be quite challenging due to the AI's remarkable aim at this level. I highly recommend taking your time to clear each area before moving on or tackling objectives whenever possible. Stealth is your best friend here; try to engage enemies without drawing too much attention. Fortunately, since you only need to complete three stories, this makes getting the achievements a bit easier.\n\nWhen it comes to multiplayer achievements, the experience can range from straightforward to quite difficult. Most of the achievements are simple and can be completed during regular gameplay. However, one that I recommend boosting is \"Death from Above,\" which requires you to destroy five manned stationary weapons using an airplane. As someone who struggles to pilot in these games, I found boosting this achievement essential.\n\nTo boost effectively, you'll need at least four players [i](two on each side)[/i] to create and/or start a community game. Unfortunately, this game must be set to public, which means random players might join. If this happens, try to communicate your intentions to them and hope they don’t grief you while you’re going for the achievement. One additional issue at the moment is that the game has a bug that prevents you from saving your configurations when setting up a game, so unless you have a previously configured game, you may need to search for a suitable lobby in the browser.\n\nI recommend the map [i]Panzerstorm[/i], as it’s relatively flat, making it easier to achieve the required kills from the air. However, be prepared for a bit of trial and error as it’s still tough to fly.\n\nIf you’re looking for more guidance on this achievement, there are excellent resources available online, and I suggest checking out [i]TrueAchievements[/i] for helpful tips.\n\nAside from that one multiplayer achievement, the others are relatively easy to obtain. However, keep in mind that the majority of the achievements in this game are centred around online and multiplayer play.", 0.6031745672225952], ["Fun game. No skill based matchmaking. Great for casuals who just want to mess around and shoot stuff, without needing a sweat cloth on standby.", 0.5652173757553101], ["Just buy BF1 at this point. This game had a lot of potential but the amount of bullshit that this game has... Japanise women wearing a general uniform fighting in Norway for wermacht... Like come on bro... Everything is also too vibrant for ww2. In bf1 you could see the dirt and horror of war...but in bf5? Its just modern cod at this point. This game has fun and lil better mechanics than bf1 but still it doesnt compare to the aura and atmosphere that bf1 has. Im really sad that DICE went this way for a ww2 shooter. 4/10", 0.5600000023841858], ["I love the chaos in this game (The sniper tanks), there is so much happening at the same time   (only sniper tanks). One of the most realistic games ever and it is extremely funny to play", 0.547325074672699], ["\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☑ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10", 0.5454545617103577], ["me when I go to play game after 4 years of not playing game and it doesn't want to launch (also eff that external launcher BS)", 0.5419847369194031], ["it still holds up really well. i recommand everyone to use dx11 version. maybe a bit lesss fps, but no stutter. even got stuttering on dx12 after playing whoile day and shader compilations, so even if it would got away, after every setting change or graphic card update, you would have to apply shader compilation again.", 0.523809552192688], ["Encountered the Flash in game....... XD\n. \n. \n. \n. \nBlatant Hackers, otherwise a fun game.\nThe game is visually stunning, filled with chaos and thrill...  While playing multiplayer it's not about the win for me, but the gunplay is what I enjoy the most, the quick scope with the Arisaka 99 and many more.\nAlso most of the players in my team are always running around like zombies exhausting respawns.\n. \nIf you really want to enjoy this game, I would suggest you to get it during a discount sale of 70-90%...", 0.52173912525177], ["Impossible to play rn. Hackers ruining all conquest games. If you see DWJC0517DD in your lobby prepare to not play the game.", 0.52173912525177], ["Let me play the game you bastards, give Linux chads some love", 0.5184261202812195], ["this game is not that bad ,it is quite enjoyable but the bigger problem is cheaters this game don t have any anti-cheat ! Every match you need to play against cheaters !", 0.5131086111068726], ["Please don't buy. Came here after mediocre but fun Battlefield 1 to this garbage. So much wasted potential.Repetitive and reskinned single player campaign. Lackluster characters. Great visuals is the only good point. Game breaking bugs where you can't shoot are still present 4 YEARS LATER. Campaign is hard but unfair and unsatisfying and reminds me of the old Battlefield 2. Please don't buy.", 0.5105932354927063], ["okay-ish game, maps are terrible, server browser for SEA are limited", 0.5074626803398132], ["断更，无限滑铲挺恶心.重心放在大逃杀没人玩，加入积分机制", 0.5], ["So bad, the only thing they did properly is this slimy mechanics,gameplay,etc.... that makes u play more than u should so they can pump hours by player and look good in front of actionists.", 0.5], ["ts game filled with max level players and movement demons ts game cannot be played for the first time anymore ts pmo </3", 0.5], ["Battlefield V offers breathtaking visuals, fluid gunplay, and immersive WWII battles. Its team-based gameplay and dynamic environments create thrilling, strategic experiences that reward coordination and skill. A bold, engaging shooter.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1238810/header.jpg?t=1738598409", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1238810/capsule_231x87.jpg?t=1738598409", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1238810/capsule_184x69.jpg?t=1738598409"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.ea.com/games/battlefield/battlefield-5"}, "developer": "DICE", "owners": "5,000,000 .. 10,000,000", "tags": ["FPS", "Multiplayer", "Singleplayer", "World War II", "Shooter", "War", "Military", "First-Person", "Massively Multiplayer", "PvP", "Combat", "Open World", "Action", "Historical", "Destruction", "Battle Royale", "Atmospheric", "Violent", "Sexual Content", "Female Protagonist"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 15429, "number_of_achievements": 21, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Steam Achievements", "Full controller support", "Steam Trading Cards", "HDR available"], "genres": ["Action"], "short_description": "This is the ultimate Battlefield V experience. Enter mankind’s greatest conflict with the complete arsenal of weapons, vehicles, and gadgets plus the best customization content of Year 1 and 2.", "long_description": null}