{"name": "Halo Infinite", "app_id": 1240440, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 18429, "negative_reviews": 8466, "reviews": [["Long time Halo fan and I am not easily disappointed but holy hell did they ruin one of the most iconic franchises and best stories ever with this pile of utter rubbish from killing long standing characters off screen to adding character that are either pale Imitations or just out right serve no purpose other than to say well done player you did a thing. \ngame play is very gimmicky adding grappling hooks and other tools that you will most likely never use because the combat is so easy why bother unlike the armor abilities of old given to us in reach where each ability flowed with the pace of the combat. \n\nFor years people having been wanting an open world halo game so when one finally came out everyone was understandably hyped, but in the end all we got was a hot mess of a game with a very low difficulty boundary with bosses that are more generic enemies with more health than actual bosses and are about as memorable as a generic enemy as well.\n\nThe end game for the open world boasts absolutely no end game content at all, with the world after the campaign feels so lifeless aswell as the campaign having no replayablity value what so ever as I can't imagine anyone wanting to trudge through that again...\n\nI hear people asking already why am I making this review after the game being released after almost 4 years at this point? And honestly, it's because I am scared, scared of the threat of them making another lifeless, dull and overall awful game dragging a once great franchise with amazing characters through the mud just so they can make some quick money off of the faith that maybe this time they won't mess it up, rather than sending Halo out with a bang they just kept poking the lifeless corpse with a stick to get a few extra bucks out of it.\n\nLastly to the publishers and developers of this massive disappointment (not that you'll ever read something written by a member of your community) I hope none of you worked on the prior titles that were loved so much by your community because if you did you really fell from grace and I think a long look at what you created and how you fell so far is needed, do us all a favour add halo 5 to MCC and leave Halo alone.", 0.8179926872253418], ["glitch in multiplayer that resets your controller settings. 343 never make another halo game ever again please, oh wait you guys dont even make your games, you just outsource the work , and rely on players to make maps in forge. disgrace", 0.7300381064414978], ["So you made a playable game, and then you just broke it? I can't even get past the startup screen. I just want to play the somewhat enjoyable campain....", 0.5454545617103577], ["Everytime I try to load the game it freezes within the first menu. Tried the online fixes but it never worked.\r\nWasted my money on it because even when you can play, the multiplayer is kind of garbage and is nothing like the original halo games. Dont even get me started on the dog water campaign thats just a huge map with copy pasted assests all over the place. Doesnt have any of the \"sparkle\" that the old halos did. Its just a microtransaction pit now.", 0.5454545617103577], ["An issue persists on pc that they have known about for years. while the gameplay is great, the fact that you sometimes just cant get it to work due to some sign in issue that they just never fixed is just sad.", 0.5454545617103577], ["Multiplayer is mid. Campaign is ok. Custom games with friends is the only good thing about this goofy ahhhhhhh game bruh.\nlike halo more like gaylo. 343 studios more like cant make a good game studios. halo fell off. -rep not bussin bruh.", 0.538922131061554], ["I love Campaign :( I hate that its super short, I miss the long co-op stories they use to make. Story mode is a dying breed </3", 0.5375375151634216], ["I loved the Bungie produced Halo games and I even enjoyed Halo 4. It was a cool 360 game. Then they made Halo 5 Guardians. Absolute slap in the face to Halo fans. Its like the show where the producer boasts that he hasn't played the games and won't be tainted by the source material. I cried my eyes out in sorrow. Then this game was announced. At first I was excited. The net-gen renders of Master Chief (may he rest in peace) and I dared to hope again just to have them smashed to bits by this games poorly made unrelated undermining story along with gameplay that didn't really feel like halo. It feels like these people don't want to work here are stuck with the short straw. On no have to go work in the halo coal mines for another month. So its fair to say I am disappointed. The problem isn't just that Halo Infinite is a bad Game. The problem is that halo games were incredible and pushed the limits. This only thing this game pushes is people away from the series. I wish that the Halo studios re-brand would fix things but I wager it will only make things worse. I hope I am wrong. Look Halo Studios, if you are listening still, you'll need to review closely the first five halo games and try to recreate that feeling.", 0.5287907719612122], ["I legit cant load the game anymore, loading screen freezes and i let it run for about 1 hour", 0.5272993445396423], ["343 refuses to listen to community. who cares about new skins where is the new vehicles, new boss fights. give the players more freedom with modding on steam workshop. also do ya'll make your vehicles outta cheap plastic cause it feels like it", 0.523809552192688], ["Can no longer access game. Just stops at account screen and never does anything ever again.", 0.523809552192688], ["Only speaking to the campaign, but while the premise is compelling, the outcome is underwhelming. The open world terrain is too uniform and non-descript in its biomes; the ability to approach enemies by any angle undermines encounter design; and the ability to utilise airborne vehicles from about the midpoint of the campaign completely trivialises open world encounters. Coupled with the extreme value for money that is Master Chief Collection, Infinite cannot be highly recommended for a single player experience.", 0.5222930312156677], ["Literally breaks every other update to where you cant even progress passed the hit start menu. \nSouless cashgrab mess, if you support this you make Arbiter cry", 0.5220588445663452], ["Can't believe there are still game breaking bugs in the campaign after nearly 4 years lmao. TWICE I've tried to beat this game, once 2 years ago and another a month ago. Both times it bugged out so hard the save file became unusable. Fix. Your. Game. Please. God. My. Heart. Can. Only. Take. So. Much.", 0.5199999809265137], ["The game will not  go past the start menu.\n\nEdit: I had to reset the login process by removing my credentials from Halo Infinite just to get past the start menu. that's insane.", 0.5138888955116272], ["honestly i just get more and more disappointed as time goes by. i cant even get past the sign in screen and i know im not the only one. just throw out the whole game and start over", 0.5138888955116272], ["story is mid at best. and multiplayer is pure trash. should of got the dumpster fire award.", 0.5063291192054749], ["Stopped playing the game/ since it feels like they abandoned it, came back to see how it's going. Getting Log-In errors, that's enough for me.", 0.5054945349693298], ["Halo CE was the first game I ever played and every since then I've been mesmerized by The Halo universe, but I can't wholeheartedly recommend anyone to play this one because the campaign feels soul-less and the multiplayer just doesn't feel like halo anymore. 4/10 super sad", 0.5034052133560181], ["Objectively bad game and scummy company they constantly hurt their fans and ruin their IP they've started making stories outside of the game rather than in the game and act like that makes up for the games issues and lack of content", 0.5012427568435669]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1240440/3c103afc1db13776d5d411ccfd3037e2f43f3a5b/header.jpg?t=1744138118", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1240440/bcfa7b8186e34905aec0b910be19d81f11547d16/capsule_231x87.jpg?t=1744138118", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1240440/bcfa7b8186e34905aec0b910be19d81f11547d16/capsule_184x69.jpg?t=1744138118"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.halowaypoint.com/halo-infinite"}, "developer": "343 Industries", "owners": "10,000,000 .. 20,000,000", "tags": ["Free to Play", "FPS", "Multiplayer", "Singleplayer", "Shooter", "Action", "First-Person", "Open World", "Sci-fi", "Co-op", "PvP", "Competitive", "Story Rich", "Space", "Adventure", "Aliens", "Lore-Rich", "Cinematic", "Atmospheric", "Soundtrack"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Dutch", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese", " Danish", " Finnish", " Norwegian", " Portuguese - Portugal"], "concurrent_plays": 1261, "number_of_achievements": 144, "categories": ["Multi-player", "PvP", "Online PvP", "LAN PvP", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "In-App Purchases", "Steam Cloud", "Includes level editor", "Remote Play on TV"], "genres": ["Action", "Free To Play"], "short_description": "From one of gaming's most iconic sagas, Halo is bigger than ever. Featuring an expansive open-world campaign and a dynamic free to play multiplayer experience. ", "long_description": null}