{"name": "Sons Of The Forest", "app_id": "1326470", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£24.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 87293, "negative_reviews": 11948, "reviews": [["This game is way too fun and is a great game to play with Friends. But only if you're friends are nice and not stinky", 0.7905924916267395], ["---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10", 0.7651005983352661], ["After about 800 hours in The Forest I decided it was time to give Sons of the Forest a chance and i don't regret it. The forest is one of my favorites game of all time and I'm a big fan of series Lost and Sons of the Forest really exceeded my expectations. Great graphics, great environment, great performance. I really like the idea of having Kelvin who can helps u doing stuff around your base even tho sometimes is a bit buggy. I don't know if I will like SOTF as much as I like the original but I can see myself putting a few hundreds of hours into this one. So far so good for me and i totally recommend this game to anyone that loves survival games and watched Lost.", 0.73530513048172], ["Ran into a baby fawn with a golf cart, while its family watched and ran away. Then, the baby fawn whilst crying on the ground unable to move, suddenly got eaten out alive by a cannibal that appeared out of nowhere as I sat and watched. 10/10", 0.7800170183181763], ["Building furniture out of Cannibal bones is a highlight of the early game experience.", 0.6688573360443115], ["This game actually feels like an upgrade over its first part in every single way (very rare to see these days), even though I’ve only played for few hours. \n\nThe world feels so much more alive, and the AI is a big upgrade. The enemies are way smarter, they don’t just rush at you anymore. Combat feels way more intense, especially when you’re fighting the cannibals. The forest looks really good too, so much more detailed. The building system is way better than the first game. \n\nThe companions in this game are seriously next level (including enemies offc) compared to most other games. They don’t just follow you around like passive NPCs, they actively contribute to your survival.\n\nOverall, Sons of the Forest is an awesome upgrade with smart companions, intense combat, and a super cool world which can feel very scary at times", 0.6575570106506348], ["Literally only have an hour of play time on this game but its generally the most fun I've had with a game in a very long time. I'm really not a big fan of survival games at all because they never do a good job at teaching you how to actually play the game which, I know that's kind of the point but take for example a game like terreria, which in not trying to throw shots at that game but I don't think one person can look me in the eye with a straight face and tell me they beat Terreria without a guide. Which this is why i like sons of the forest it does not really tell you straight up what to do but its still a fine experience I don't feel 'naked' or lost when starting off in this game, this games atmosphere is also very very amazing I feel so paranoid at all times like im always being watched no matter where I am. I never played the first game but I did watch my favorite youtubers play it when i was younger lmao. overall if your thinking about getting the game already I say get it, its not super tedious in my opinion or too easy. In my 1st hour I already found a giant mutated baby, a gun, and a golf cart, if that doesn't make you want to play this game than I don't think you ever will.\n\nThe only downside I have is the audio. I have some very good headphones but for some reason most sounds don't sound directional, when you hear something you just hear it, its kind of hard to tell where and what some sounds are coming from but maybe i need to mess with the audio settings.", 0.599158525466919], ["great fun game to play with friends, a bit of horror and survival in one", 0.5956274271011353], ["HUGE fan of The Forest and in my opinion THAT ONE is WAY better than this one and this is the newer of the two games. Basically it's the same game as The Forest with better graphics and new backpack layout. The scare factor is WAY lower and the enemies are boring. The Forest is brain numbing and reminds me of everything I hated about Green Hell. It's very repetitive visually and there is way too much greenery. Weapons are harder to use and when I play this game only, I have a line glitch through the entire screen. I am glad I bought this on sale. I am going back to playing the original because this one is really getting on my nerves. Game play and visual wise. I recommend The Forest over this version.", 0.5643084645271301], ["Sons of the Forest isn't as good as the first game, but it's still a ton of fun with friends. It just lacks the overall creepy atmosphere of the first game, and the story was better there too, I feel. Still, the game looks great and it's definitely a good time.", 0.5614035129547119], ["This game is just amazing, it feels like a improvement over the first in every way and has so many fun things to do. The cannibals feel much more significant and like much more of a threat.", 0.5454545617103577], ["Fun game. Missed a prime opportunity to call the cannibal meal Greg, Stew of Stu. Gotta love the free slave labor Special K (in Kevin we trust) Also taught me a life lesson in nvr messing with a dudes 3 armed 3 leg mutant girlfriend.", 0.5454545617103577], ["Helicopter crashed\r\nfound out my buddy is deaf\r\nfound some berrys, ate them\r\nwrong berrys, got sick started dieing\r\nfound aloe, got healed\r\ngot jumped by canibals\r\ndied. 10/10", 0.5454545617103577], ["Sons of the Forest is a difficult game, not because that the enemies but because of how it's built up. There is no incentive for me to build a base. If I want to go along the story I will get enough supplies to constantly overfill my backpack. And talking about the backpack. I get that it's convenient to have everything with you at all times but it was also frustrating. I pick up a new thing and have to search through my backpack like a spelunker after gold. It would have been better if inventory was more restricted and I needed a base to store and upgrade my gear but no, instead I had to go from cave to cave to cave to get along in the story. The building system did seem nice but why would I stop to build if I could get to explore the story further? It would have been a nice change in scenery if some of it at all had been above ground. Instead, all you get is a cave explorer simulator, which at one point becomes just frustrating. You dodge or kill the enemies and just run through them in the hopes of getting the item or whatever you need to eventually get above ground only to look for the next cave. The addition of seasons made it not more difficult but just annoying limiting your stamina in the frigid cold. Totally unnecessary. The story as as a whole leaves many gaps, which will not be answered. In the first Forest game, you had a very clear mission and goal. In Sons of the Forest, you just go along with things. The graphics are nice tho.", 0.5416666865348816], ["9.7/10 game just wish:\r\n\r\nthey added own character making and add female characters cause i hate playing as a male.\r\n\r\nadd more bigger map and more to do.\r\n\r\nmore story and crafting and weapons.\r\n\r\nand etcs.", 0.5383614897727966], ["Love the game but as long parts of your base can just collapse it wont get a positive review from me. Its not a new bug but i see posts from last year complaining about it, 7 April 2025 still an issue. Frustrating enough to let this game go till its getting fixed.", 0.5299229025840759], ["pretty fun puzzles and gameplay; i liked traveling through the caves to get special items to advance the story and it's overall a very good survival game", 0.5275590419769287], ["So not a huge fan of horror games but I feel like the Sons of The Forest is only a little bit horror, or maybe I got used to it by playing on easy with big heads turned on. Either way it is a beautiful world to explore and build in and is 100% worth your time if you enjoy that sort of thing.", 0.5258620381355286], ["A great sequel to at game with poor pay off. This not only expands upon its predecessor mechanically but it also shows the devs have matured with their process'. Wheras the first game lost itself and many plot threads led to nowhere, this game will give explanations within the world without cramming them down you throat.  I very much recommend this game both for mechanics and for the atmosphere. I look forward to a sequel.", 0.525547444820404], ["very niceee game superr fun eperience kelvin is very helpful but he is dumb sometimes and the monsters here are very scary, they should lessen the darkness in the night. but overall its a nice game a nice sequel for the forest game.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1326470/header.jpg?t=1708624856", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1326470/capsule_231x87.jpg?t=1708624856", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1326470/capsule_184x69.jpg?t=1708624856"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Endnight Games Ltd", "owners": "10,000,000 .. 20,000,000", "tags": ["Survival", "Open World", "Multiplayer", "Co-op", "Survival Horror", "Base-Building", "Horror", "Crafting", "First-Person", "Exploration", "Building", "Adventure", "Singleplayer", "Atmospheric", "Sandbox", "Action-Adventure", "Action", "Simulation", "Immersive Sim", "Early Access"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Czech", " Finnish", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Swedish", " Traditional Chinese", " Turkish"], "concurrent_plays": 13706, "number_of_achievements": 32, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "Simulation"], "short_description": "Sent to find a missing billionaire on a remote island, you find yourself in a cannibal-infested hellscape. Craft, build, and struggle to survive, alone or with friends, in this terrifying new open-world survival horror simulator.", "long_description": null}