{"name": "鬼谷八荒 Tale of Immortal", "app_id": "1468810", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£15.49", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 19, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 2693, "negative_reviews": 767, "reviews": [["Really liked it when I could play it. Haven't been able to for a while now. Don't buy this game if you're in the USA until they fix this.", 0.5761160850524902], ["So I hate long reviews so a very short one.. Do you like cultivation/xianxia novels well if you do and you still haven't bought this game then you are making a monumental mistake. This game is a great cultivation game and anyone who even slightly enjoys cultivation are being the biggest villains in their own story by not buying this game. I as a westerner never heard of cultivation or xianxia before this but let me tell you I played this game a little and got absolutely hooked on the idea of cultivation. Let me tell you I started readind a few cultivation novels just a few weeks before my midterms thinking I would get bored of this game and the novels but let me tell you as plainly as I can. I will have a very hard time at the finals passing my tests as I botched my midterms as spectacular as the heavens willed it to be. So If you havent heard of cultivation or xianxia just give this game a chance and if you heard of them why are you still reading this just go and buy the game you will not regret it. \n\nNote:For my fellow westerners this game will not work on your computer that's why the reviews are so low. But do not worry this game is great and to open this game  you just have to complete a 3 sec process simply find the game's folder by right clicking on the game on your library and delete version.dll and you are all set! Also game's translation is almost complete and there are very little places that haven't been translated so you can play this game with ease.", 0.5620437860488892], ["The role-playing style of the story is quite engaging, the effects and combat moves are very beautiful, there are elements of Chinese martial arts that look very beautiful, the features are similar to online games but are designed offline in a lively way and help offline players feel excited when playing!\r\n", 0.5], ["A game's highest difficulty should test your knowledge of the game's systems. Any playstyle should be viable as long as you know how to compensate for its weaknesses. This game's highest difficulty, chaos mode, only tests your patience as a good chunk of the game revolves around RNG and hoping you get good manuals- namely a guide manual with a shield attribute.\r\n\r\nOn chaos mode you are punished for picking any martial art or root that isn't strong and has high range in the early game. You are more or less railroaded into picking sword if you don't want to have a miserable time- and just switching to another MA later on.\r\n\r\nThis could potentially be one of the best cultivation games out there but I can't recommend it. Only try it if you're able to tolerate bad RNG.\r\n", 0.5], ["Please provide us with a Vietnamese version. Your game is very popular in our country. A version with Vietnamese language support would help many players in Vietnam access this game and other future games from your development team.", 0.5], ["Shape your world as if you were in a xinxia or wuxia ln. Love the game! Currently on a break and getting ready to conquer half of the entire region sects.", 0.5], ["Translation is rough at times and completely untranslated at others. However if you can get past that, or just use a translator, the game itself is great and fun with a lot of stuff to do.", 0.5], ["Let's get to the point, shall we?\n\nPros: \n1. This is similar to the xianxia you read, yes, the world, the story. You won't realize you've spent hours in the game once you get comfortable (just like reading xianxia novels)\n2. Gameplay is quite fun, like vampire origins.\n3. Open world with many possibilities. You can make your own story outside the main story, today you might kill someone and tomorrow their family comes to take revenge. \n4. Zero to hero, very satisfying when you break through to a new realm\n\nCons:\n1. English translation is not good enough. As a non-native English speaker, I had to read it several times to understand it. \n2. This game is grindy as hell, just like Xianxia in general. Every time you go to a new region/enter a new realm, you have to train new skills to adjust to it. If you want to be an OP MC, there are only two choices, train hard, Spend decades, or with Mod/cheat the game, just like the MC in Xianxia!\n3. About the mod, there are many mods that use Chinese language in Steam Workshop, it's quite hard to find English mods, so, be prepared to use Google Translate if you want to find a good mod.", 0.5454545617103577], ["IF GAME DOESN'T START: \nOpen Windows Settings --> Time & Language --> language tab --> administrative language setting --> Change system locale --> enable [Beta: Use Unicode UTF-8 for worldwide language support] (need to restart after setting)\n\nYou're welcome.", 0.5], ["This isn’t just a game. It’s a cultivation trial. A legend in the making.\n\n10/10", 0.4761904776096344], ["9/10\r\nvery addictive", 0.46815767884254456], ["Does not start anymore", 0.5634920597076416], ["Cleanup isle my pants", 0.46875], ["great game", 0.46815767884254456], ["good game", 0.5], ["good game", 0.46815767884254456], ["good", 0.5], ["Like it very much", 0.5], ["Love it", 0.46815767884254456]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1468810/header.jpg?t=1735812680", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1468810/capsule_231x87.jpg?t=1735812680", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1468810/capsule_184x69.jpg?t=1735812680"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "鬼谷工作室", "owners": "10,000,000 .. 20,000,000", "tags": ["Management", "Singleplayer", "Simulation", "Mythology", "Sandbox", "Tactical RPG", "RPG", "Choose Your Own Adventure", "Dating Sim", "Action", "Adventure", "Exploration", "Hack and Slash", "Story Rich", "2D", "Action RPG", "Procedural Generation", "Hand-drawn", "Action-Adventure", "Strategy RPG"], "languages": ["Simplified Chinese", " Traditional Chinese", " English", " Korean"], "concurrent_plays": 6514, "number_of_achievements": 169, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Workshop", "Steam Cloud", "Remote Play on Tablet", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG", "Simulation"], "short_description": "Tale of Immortal is an open-world sandbox based on Chinese mythology and cultivation. You will grow to become immortal, conquer the beasts from the Classic of Mountains and Season, make your choices carefully and grasp your own destiny.", "long_description": null}