{"name": "Battlefield™ 2042", "app_id": "1517290", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 45322, "negative_reviews": 50618, "reviews": [["EA really brought this game back to life after its abysmal launch. The gunplay is tight and the maps are well designed. I like almost everything about this offering, but the lack of Rush as a dedicated game mode is a major letdown. On nights with a high player count this game is good fun. I recommend picking it up on sale and giving it a shot.", 0.6523757576942444], ["I can't fault it anymore. Played this after release and uninstalled after 30 mins because it felt so bad, played here and there again during free weekends, still felt but, but now?\r\n\r\nHero classes are gone, they have tons of classic maps from BC2 or 1942, got it for 5$ at a sale... I really can't fault it. It feels like Battlefield and I'm getting from it what I wanted. I do recommend it,", 0.6201808452606201], ["A great game, although you should probably wait for BF6 xD\r\nAfter having grinded out this game for what its worth, i think it's a fun experience, especially messing around with friends.\r\nAnybody who says its a buggy mess hasnt seen the game in its current state, since theyve fixed a whole lot\r\nGet the game if its on sale, mess around, and test out the Ghostmaker R10 (The T1 was NOT fun to get)", 0.5807510614395142], ["Decent Battlefield now after all the updates, but the older BF titles are still better. Recommend picking it up only when its on a heavy discount.", 0.5705882906913757], ["Mixed feelings on this game, as it's certainly not perfect, but honestly... for the 5 euros I paid for it, it's decent and more than worth the money. It's just not worth a full price. Despite its issues, I've had a fair bit of fun while playing it trying to complete it.\n\nAlso to EA: Get back to your more user friendly anti cheat (one that also is compatible with linux), since I've encountered more cheaters in this game than I have in BF3, BF4 and BF1 combined, and it certainly does not have more players than those.", 0.5454545617103577], ["Great gameplay just wish the portal had more options like BF3 and BF4 among of the others that are great.", 0.5454545617103577], ["Even the bot matches (which have to be online) have horrible latency problems. Couple that with cheaters because they use easy anticheat (which is not an anticheat software, it's just spyware) and the game can be unplayable at times. buy it at 2 or 5 dollars and just play bots. You'll get the day one experience of every BF game ever - buggy, horrible netcode, and cheaters unencumbered by the so-called anticheat.", 0.5406339168548584], ["[h1]FANS DESERVED BETTER THAN THIS[/h1]\n\nBattlefield 2042 is the latest installment in the long-running Battlefield franchise, developed by DICE and published by Electronic Arts. Set in a near-future world on the brink of collapse, it aims to deliver a high-stakes, large-scale first-person shooter experience. Marketed as a return to form after the disappointment of Battlefield V, it instead fell short of expectations - arguably becoming an even bigger misstep for the series.\n[b]As much as I’ve enjoyed the game since Season 5, I still can’t recommend it.[/b] Sure, the updates have been solid - DICE fixed, reworked, and added a lot of content - but it shouldn’t have taken so many months to get here. \nThe game launched in a terrible state, comparable to the rocky premieres of Cyberpunk 2077 and Fallout 76. And even now, it still falls short in many areas when stacked against previous Battlefield titles. I do appreciate DICE’s commitment to improving the game - especially when you consider how quickly Battlefield V was abandoned - but it’s simply not enough. [b]DICE and EA: if you want players to leave positive reviews, try launching a GOOD and FINISHED product next time.[/b]\n\n[b]Story[/b]\nDisappointingly, there's no campaign mode at all.\n\n[b]Game Modes[/b]\nConquest (64 and 128), Close Quarter Conquest (64), and Breakthrough (64) are really the only default game modes that matter. I personally play almost exclusively in CQC - it’s intense and fast-paced - but unfortunately, the map pool is limited to just three. If you're looking for more variety, larger maps, or vehicle gameplay, Conquest and Breakthrough still hold up well. No complaints from me on that front.\nOccasionally, the game introduces special events with unique modes and rewards. While they can be hit or miss, they offer players a welcome change of pace and something fresh to experience.\n\n[b]Portal[/b]\nBattlefield Portal is an incredible concept that ultimately suffered from a lack of new content. It lets players create custom matches with a wide range of gameplay options and share them with the community. Overall, it's a fantastic feature that deserves to be a staple in future Battlefield games.\n\n[b]Hazard Zone[/b]\nHazard Zone is essentially an extraction shooter, aiming to be a Tarkov-lite set in the Battlefield universe. Unfortunately, it failed to capture interest, and as a result, it faded away quickly.\n\n[b]Specialists[/b]\nI’m one of those players who couldn’t care less about the specialists. Do I think it was a bad idea that doesn’t fit the Battlefield formula? Absolutely. Does it make the game unplayable or even significantly less enjoyable? Not really.\nOn one hand, I like the idea of gadgets and unique traits for each operator, but on the other hand, it's a bit odd to see 20 Sundances in a single match. With a few adjustments, it could be a fun gimmick in future Battlefield games - just don't make it the core focus.\n\n[b]Gunplay[/b]\nGunplay is always subjective, so I won’t spend too much time on it. Personally, I enjoyed it. It’s casual and doesn’t demand much mental effort - perfect for players who don’t have the time to master every nuance of the game. Most of the weapons are easy to handle, meaning even with average aim, you can still find yourself topping the leaderboards.\nThe TTK (time to kill) feels solid overall - fast enough to be satisfying, with the exception of three or four guns. As a result, enemies rarely feel like bullet sponges. That said, there are still issues with hit registration, lag spikes, and occasional desyncs. These problems can make the TTD (time to death) feel frustrating at times, as you can be one-shotted without any chance to fight back. While these issues aren’t as prevalent on smaller maps, they become much more noticeable in matches with 128 players.\n\n[b]Vehicles[/b]\nI don’t have much to say about the vehicles in BF2042, since I rarely use them. The controls feel clunky, the vehicles move awkwardly, and flying helicopters and jets isn’t all that satisfying.\n\n[b]Server Browser[/b]\nThere’s no server browser, and it’s hard to understand why DICE was so determined not to include it. It remains one of the dumbest decisions they made.\n\n[b]Destruction[/b]\nCompared to older Battlefield games, this one feels like a step backward. Rather than enhancing the existing systems to allow for more impactful destruction, they scaled it back. Even visually, the explosions and building demolitions lack the satisfying impact we’ve come to expect.\n\n[b]Maps[/b]\nThe maps in Battlefield 2042 are a real mixed bag - some, like Spearhead, are solid, while others, like Kaleidoscope, miss the mark. The release maps were especially bad before their reworks. They were too large, too open, with vast flat terrains and hardly any cover. Thankfully, most of them are now at least playable.\nIt might be controversial (or maybe not?), but I genuinely think the later maps from the new seasons are fantastic. Redacted especially stands out - it's easily one of my all-time favorites in the Battlefield franchise.\n\n[b]HUD & UI[/b]\nI like the overall design of the HUD. It’s modern, minimalist, and provides all the essential information without cluttering the screen (for the most part). Unfortunately, the customization options are limited, so if you’re not a fan of the default HUD, you're pretty much stuck with it.\nAfter several patches, the UI has become much more solid. The menus have been streamlined, and even something as simple as changing attachments is no longer a hassle.\n\n[b]Visuals[/b]\nIn my opinion, the game looks (mostly) good. While the older maps could use some improvement - often feeling too clean and lacking in detail - the newer ones are visually stunning. Redacted is packed with incredible detail, while Exposure impresses with its breathtaking environmental design.\nThe dynamic weather is an impressive concept, but in the long run, it doesn’t quite deliver. While random tornadoes or sandstorms can add unpredictability to fights, they often don’t feel impactful enough. It would be better if these events were rarer but capable of causing real havoc on the battlefield.\n\n[b]Audio[/b]\nTechnically, the soundtrack isn't bad. It's solid electronic music with a subtle noise element. The problem, however, is that it doesn't suit the game. While it fits the theme, it doesn’t match the gameplay. What we need is something that hypes us up, something to pump adrenaline into our veins! This is an FPS, not a horror or sci-fi game.\nThe rest of the audio is decent. Nothing groundbreaking, but at least everything sounds as it should.\n\n[b]Technicalities[/b]\nPerformance heavily depends on the map and game mode you're playing. From my experience, fewer players usually means better FPS and less desync. That’s why I’ve always avoided the 128-player mode - it’s essentially a technical nightmare. Interestingly, newer maps seem to be better optimized compared to the older or reworked ones.\nThere are still a fair number of bugs and glitches. Aside from major issues like wonky hit registration and lag spikes, there are also smaller problems - like falling under the map or encountering flying vehicles.\nThe game supports crossplay with consoles, but if you're not a fan, there's an option to disable it.\n", 0.5355535745620728], ["My game constantly lags even on low settings. My game crashes a lot too. i just tried to hop on with my buddy and he was banned for absolutely nothing. he last played about two months ago and i watched him through discord. No cheats, nothing. EA sucks. I even uninstalled Apex because that game is hotdog water. thanks for making me have miserable experiences with your games. Awful servers. Awful games and everything you do is just a cash grab. I dont think ill ever play a EA game ever again.", 0.5302013158798218], ["The game is still quite bad tbh. Entering games as a full party often leaves some or a few of the party out, the player base is really low too so you can often not enjoy all game modes. Frankly it's no surprise though. Hoping the next BF will get their shit together.", 0.524970531463623], ["For less than $5, yeah, I recommend this game.  wouldn't pay full price though.\n\nThis feels like COD, but for the battlefield universe.  \n\nIs it amazing?  nah, but its fun to play for a few hours and snipe some dude from across the map.\n\nAre you looking for a quick game to go in and have some fun?  then this is it.  Don't expect the old school battlefield, but its fun enough if you get it for sale.", 0.523809552192688], ["Unlike All negative rates I give this game 9/10 \r\nIt's an new wave of modern battlefield with a lot of features.\r\nthe rating for this game is brutally unfair to me. If play it more than 10 hours you will get that this game is amazing.\r\nCool maps \r\nstunning sound effects\r\nPerfect Shooting mechanism\r\nand for the last Being a Battlefield", 0.523809552192688], ["This game is great. I like it. It's so much fun!", 0.523809552192688], ["Bugs from the original release seem to be fixed. They've steadily increased the game's content (weapons, maps, characters).\n\nPros:\n\n- Gunplay still feels like Battlefield, but smoother.\n- Vehicles feel more usable. I don’t feel like I’m going to be instantly destroyed by targeting weapons the moment I’m spotted.\n- Continued support via updates.\n\nCons:\n\n- Portal mode lacks content from previous Battlefield generations. (Would love to see more 1942 content.)\n- Destruction isn’t as good as in past Battlefields. It’s there, but it just doesn’t feel as substantial.\n- No great meat grinder map. (Thinking Operation Metro from Battlefield 4.)", 0.52173912525177], ["people whine & moan about how terrible this game is. its literally battlefield bro lol dont take it serious, ts is hella fun and chaotic", 0.5196850299835205], ["This game is an unbalanced mess for new players and there's a reason no one will touch this game unless it's on a MEGA sale costing less than $5 american. Even when people try the game out on sale they never stick around and there's a reason for that. \n\nThe maps are too big and open, So you either never see anyone or you encounter 10 people at once and instantly die. It ends up just being a walking simulator at times and you get frustrated and bored. You end up spending the majoirty of the match just running from point A to point B and from point A to B there's like a million different ways you'll get instantly killed, It could be people waiting for you. It could be a random helicopter or jet. It just gets too annoying. \n\nThere is too much visual noise and clutter in this game making it almost impossible to spot enemies. I understand this works for and against the player but it makes deaths and getting kills so inconsistent which leads to frustration. \n\nThere are moments of fun here and there but the overall game is just not fun. I went in with such low expectations and i was still let down.\n\nIt's beyond frustrating to lose about 80% of your fights with another player because they have better weapons and attachments than you. Unfairly so, Letting them turn around and kill you even if you already got the drop on them and started firing. \n\nThe amount of times i have seen an enemy, Aimed down sights, Start shooting with perfect aim with my crosshair never leaving the enemy player model only for them to do a 180, aim down sights and shoot me dead with them on 10% life left is RIDICULOUS. \nI don't know if there are damage protection systems in the game preventing someone from dying too fast or some other nonsense but there is no way this is natural. There is something going on behind the scenes. \n\nThe game is just flatout unfair to new players and i refuse to slog through tons of levels just to unlock basic items that will put me on an even playing field with other players. \n\nIn no place in reality should a player lose a fire fight if they got the drop first and started firing into someones back. It isn't fair and the game suffers greatly for it. No one is going to keep playing your game if they just instantly get ground into dust when starting your game. \n\nGame is a 5/10", 0.5178729295730591], ["Now, it's underrated, just like Battlefield V was underrated, too. Glad to see more new weather like tornado, sandstorm added; Glad to see advanced AI soldiers in Multiplayer/Singleplayer/COOP mode, which not only bring back long waited Battlefield 2's multiplayer AI, but also seems more advanced; But I'm sad to say maps still not enough, and Hazard Zone doesn't have its own maps. Night maps are too few.\nAnd I wish Frostbite engine could be used for some non-Battlefield games, if new Battlefield games are still not well-accepted by players, I would like to see DICE using Frostbite to develop some sandbox open-world games or RTS+FPS/3rd person mixed games. Because Frostbite's graphics tech of characters face is so realistic, maybe as good as that in Unreal Engine 5.5, & better than GTA5 enhanced or even upcoming GTA6's character face.", 0.5145630836486816], ["This game was garbage in the beta, garbage on release, and still garbage now.\nEA is the slum lord king pin of the gaming industry. (followed closely by Bethesda)", 0.5130932927131653], ["Servers having packet loss every 5 mins, DC'ing mid game, even with a stable net", 0.5128205418586731], ["Coming from putting a couple hundred hours each into bf4 this game just feels like it lacks a soul.\n\nThe bad;\nSignificantly smaller weapon selection, attachment options, and weird operators that make cringy one liners before each match. Disappointing that the overwhelming majority of weapon/vehicle/operator customization is locked behind you needing to give EA more money for a game you already payed for, unlike in BF4 where you just needed to get kills with a weapon to unlock camo's now you just need to swipe a credit card for something that doesn't look trash.\n\nThe good;\nBigger maps, weapon modding in the field, different ammo types can subtley change how a weapon performs which slightly but not entirely makes up for the lack of weapon variety. The ability to use any weapon on any class, along with overall smoother animations.\n\n", 0.5128205418586731]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1517290/header.jpg?t=1744718390", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1517290/capsule_231x87.jpg?t=1744718390", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1517290/capsule_184x69.jpg?t=1744718390"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.ea.com/games/battlefield/battlefield-2042/"}, "developer": "DICE", "owners": "10,000,000 .. 20,000,000", "tags": ["FPS", "Multiplayer", "Shooter", "Military", "War", "Singleplayer", "Action", "First-Person", "Combat", "Team-Based", "PvP", "Futuristic", "Vehicular Combat", "Modern", "Destruction", "Physics", "Cinematic", "Adventure", "Hero Shooter", "Casual"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 6625, "number_of_achievements": 34, "categories": ["Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "In-App Purchases", "HDR available"], "genres": ["Action", "Adventure", "Casual"], "short_description": "Battlefield™ 2042 is a first-person shooter that marks the return to the iconic all-out warfare of the franchise.", "long_description": null}