{"name": "Gorilla Tag", "app_id": 1533390, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£16.75", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 30615, "negative_reviews": 2055, "reviews": [["Good game. But you have to fix your report thing cause i was using a legal menu in a moded private lobby and i was using it and people joined not know i was modding and i said \"This is a private modded lobby and yes i'm using a legal menu\" but they did not cause and they reported me and i got banned so if you could unban me that would be great. Oh and yall the best and yall make the best update i suggest everyone plays this game.", 0.6480122804641724], ["i played this game on stand alone in 2022 it was really fun i would get it if you want mods but if you have a stand alone headset and don't want mods stay with stand alone if you don't want mods but if you do i recommend", 0.600375235080719], ["This game was originally F2P, but in 2022 the devs decided to charge 20$ for it. My issue isnt the price itself, but the reason behind it. Instead of implementing proper anti-cheat measures, the devs chose to fight cheaters by putting the game behind a paywall. Honestly, a genius move. The game was (and probably still is) in a rough state, so why fix anything when you can simply put a price tag on it? Literally free money. \n\nTo be fair, old players could still play game for free, which i appreciate. And here is a tip: if you have Meta Quest set, the game is F2P in Meta services(the only reason I refunded the game), so you know what to do.", 0.5630891919136047], ["i cant even get into a game and the computer screen is blank in game\n", 0.5591397881507874], ["\nreally good game gtag with mods is prob the best thing i ever seen in a while so yea best game ever", 0.5496829152107239], ["the game is my fav but the modded lobys dont work for some reason (but just for me)", 0.5454545617103577], ["best game ever its just you need high tech wi-fi which is really annoying because my wifi is great its just it always says that how to play it once u have baught simply go backto the gtag page and press download once downloaded download steamvr steam on ur vr download steam link find ur computer and then it should take u to the menu of steam then press gtag and press play and boommm\r\n have a grEAT DAY\r\n", 0.5393258333206177], ["this game is sooooo good! but there are a lot of little children screeming slurs.:{", 0.5268816947937012], ["This game is VERY fun,  plus on steam you can get mods and have a lot of fun. And the game is super fun without them! the hats and badges are good, the maps are good, everything is great! Best 20$ purchase!", 0.523809552192688], ["TLDR: Devs don't care about the game only money.  The community is full of toxic squeakers and cheaters.  Take those $20 and buy a better game\n\n\nUtter Horseshit, I let some kid use my account to play the game but I used to play it on quest a bunch.  The problem is they don't fox their game.  \n- The game is over run with cheaters\n           - There is no anti-cheat\n- The game is over run with babies who were given a quest because their parents are incapable of raising them\n- The devs don't fix any bugs or play test before releasing an update\n- The devs only focus on milking money from the daycare of a player base they have accumulated\n\nThese 5 things just make the game shit, the devs don't do anything and more and more little kids and cheaters play.  I liked the game for its movement but I can't even enjoy it anymore.  The quest applab is filled with Gorilla Tag knock offs due to gorilla tag's code being open sourced.  Spoiler Alert all the knock offs are half assed and poorly made.   \n\nIf you still really want to play this game you can for like a few hours or so.  Don't be surprised when you see a cheater or a squeaker screaming slurs.  God forbid you try to be the good guy and report these people and then your game will crash, you fly out of the map, or the whole lobby reports you.  The best you're gonna get is a little kid throwing a tantrum and then leaving after saying a slur.", 0.523809552192688], ["got banned for no reason, they then refused to unban me, other than that its an amazing game however ill have to give it a bad review", 0.523809552192688], ["this game is so trash all that happens is when your good at the game and show your skills in publics they say your modding when your not modding and get reported. this banning and reporting system needs to be removed.", 0.5165745615959167], ["Gorilla Tag is like nothing else I’ve ever played. The movement system is wild—forget buttons, you’re literally swinging, climbing, and leaping with your virtual hands. It feels chaotic at first, but once you get the hang of it, it’s incredibly rewarding.\r\nThe game thrives on its simplicity, yet the community adds layers of excitement (and sometimes, frustration). If you’re in for laughs and adrenaline-filled chases, this is your game. Just remember, it's as much about dodging toxic lobbies as it is about dodging gorillas. Still, the raw fun makes it worth the adventure!\r\n10/10 for pure monkey madness! 🐒\r\n", 0.5], ["pretty fun if you get good at the game a little bit of rude players but fun to play with friends has good cosmetics and yeah", 0.5], ["really good game for playing with friends but dont get mods cuz most of the mod menus have trojans and its a growing nice community", 0.5], ["ive played this game for three years now and it never get old. updates every two weeks or so, thousands of dounloadable mods, and much more i definitly recomend it.", 0.5], ["This is a great game i would really recomend this game my son plays it so much and i am really happy my son has fun on this", 0.5], ["Really fun, just watch out for toxic players or modders.", 0.5], ["It is fun game if you didnt have little children screaming the n word at you all the time so a+\n", 0.5], ["this aint really about gtag but more on steamvr its so laggy with pixel monkeys and runs bonelab fine so i dont flipping know what to do", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1533390/header.jpg?t=1715638911", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1533390/capsule_231x87.jpg?t=1715638911", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1533390/capsule_184x69.jpg?t=1715638911"}, "support": {"support_website": null, "support_email": null, "game_website": "https://gorillatagvr.com/"}, "developer": "Another Axiom Inc.", "owners": "1,000,000 .. 2,000,000", "tags": ["VR", "Psychological Horror", "Multiplayer", "First-Person", "Parkour", "Funny", "Horror", "3D", "3D Platformer", "PvP", "Action", "Survival Horror", "Nature", "Physics", "Platformer", "Casual", "Moddable", "6DOF", "Early Access", "Minimalist"], "languages": ["English"], "concurrent_plays": 834, "number_of_achievements": null, "categories": ["Multi-player", "PvP", "Online PvP", "Cross-Platform Multiplayer", "Tracked Controller Support", "VR Only", "In-App Purchases", "Family Sharing"], "genres": ["Action", "Casual"], "short_description": "Run, jump, and climb using only your hands. Play tag or infection with people online. Run away from the infected players, or outmaneuver the survivors to catch them. Embrace your inner ape.", "long_description": null}