{"name": "Forza Horizon 5", "app_id": 1551360, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "KRW", "original_price": "₩ 59,900", "final_price": "₩ 29,950", "discount_percent": 50, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 67858, "negative_reviews": 8749, "reviews": [["Forza Horizon 5 is a very nice game, to me at least. Very fun, with or without friends. Many cars available, huge map. It's perfect for just wanting to relax and drive/race. I haven't played any of the previous installments in the series, so, I can't compare them on which one is better or not. But overall, it's a nice little game. Worth the price (for the Standard Edition), although, I would recommend buying the Premium Edition on sale. Here's my review:\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10", 0.8095389604568481], ["installed the game\ngrinded the \"storyline\"\ngot a few cars\nshot at 430 km/h over a mountain\ncrashed into a rock\nlost drift series of 1.8 million points\n10/10 game", 0.7778038382530212], ["It requires Microsoft login.\n\nso now my Microsoft account is under perpetual hacking.\nMicrosoft themselfs will not allow you to change your account name, so the hackers got you for eternity.\nMicrosoft will require you to change your password, and tell you the problem is solved... only for it to be the same thing in a few weeks.\nI would like to play this game and not jeopardize my copy of windows that i paid USD for.\n\nMY MICROSOFT ACCOUNT IS PROBABLY LOCKED FOREVER. SO NOW I CANT DRIVE MY CELICA IN MEXICO.\n\nPLAY AT YOUR OWN RISK", 0.6876692771911621], ["I love cars, I love racing, I love daily/weekly objectives. This game hits all those niches!", 0.6561460494995117], ["Im looking the trailers and videos about this beautiful game and after years i get it and i see everydetails like IRL, big thank you for the devlopers and creator <3", 0.6172667145729065], ["i crashed into a daycare at 300 kmph and committed multiple speeding violations and crimes\n\nthen i went home to play this game", 0.5871559977531433], ["I have 15 outstanding warrants for my arrest due to felony traffic violations. Driving in the game is pretty fun too.", 0.5740363597869873], ["Forza Motorsports died with real money transactions, leaving a lurching corpse of underwhelming and poorly received products. I didn't expect to like Forza Horizons 4. Horizons is Forza Arcade. Even without playing it most people realize that. But like it I did. And while the setting for 5, I think, is a step down, it's still a fun, albeit massively unrealistic driving game, with loads of vehicular eye candy - without having to shell out 2-5 times the original games cost.\n\nI would still take a Forza game from decades ago with updated physics and graphics over any version of Horizons. But M$ is all about the money... regardless of how it gutted the game design.", 0.5710943937301636], ["i wasnt interested racing games until I met Forza\ngood graphics and well optimization\nspecialized car tune and upgrade where you can spend hours for customizing your cars\nhaving all the well known car brands and variety in missions and racing makes more engaging gameplay", 0.5477545857429504], ["Cars handle really well. Fun casual game play. I love how you can make the game as easy or difficultly as you want it to be. Nice low skill floor and extremely high skill ceiling. Really anybody can enjoy this game of all skill levels. Runs super well on all types of computers as well.", 0.541955828666687], ["So much potential, but the end result is a soulless game for the masses.", 0.5408560633659363], ["As far as casual play goes, FH5 is a perfectly fine game, but for me there is one major glaring issue. The progression system sucks. Instead of starting the game with the lowest class of car and working your way up higher and higher on the performance ladder, the game starts you out with 3 cars that sit in the upper middle section of performance classes. Having cars that start at A and B class ratings invalidates classes C and D outside of experimenting for fun several dozen hours into the game. There's also the wheel spin system of level-up rewards that makes leveling up feel less rewarding. Instead of starting at 5-20k dollar rewards and, as you play, increasing this to higher value cars and greater cash rewards, there is a chance that the level up reward for reaching 20 is a Ferrari FXX and the level reward for reaching level 80 is 20k dollars. It doesn't make me get excited for leveling up as it kinda kills the idea of progressing rewards for progressing levels. All of this led me to feeling like I have \"completed\" the game 5-10 hours into the game after I got a S2 class supercar through the wheel spin relatively early on. A car that would usually be rewarded in the last few \"levels\" of other racing games, found its way into my hands as I was still beginning. I felt great that I had gotten so lucky, but after a while it kinda killed my drive to keep playing as much as I had. The game is still fun on a purely driving basis, and I can imagine it is even more fun with friends; but the idea of random progression rewards turns you off, there are probably other options available.", 0.5396621227264404], ["I can't stand the cutscenes in this game. There is a good game behind the cringe for sure, but I just wanted to drive around and play, not look at videos half the time, and since no other button worked to skip the story, Alt-F4 saved the day. \r\nI bet that most of the almost 150GB used up must be the videos, what a shame.", 0.5371332168579102], ["bought this game last year (2024). having a great time driving these amazing vehicles. however there are some accolades which bugged for many years but didn't fixed. most of the cars have the same spoiler whether it is a modern or classic. so if you need some extra downforce while looking good you are doomed. even though i bought the premium edition there were some more DLC car packs which needed to buy separately. which i did and found both loving and dissatisfying factors. like the bentley covertable dont backfire with the stock exhaust or fast x flip car cannot flip even a NPC. \r\n\r\nAs a suggestion i would love if there was more maps added to the game with time. at least in the next game.", 0.5842924118041992], ["Feels exactly the same as the last 4 games\nJust way more yapping in my ear about sh*t I do NOT care about", 0.5841264724731445], ["!!!BUYER BE WARNED!!!\nI received a warning for \"Cheating/Unallowed modding\" around 180 hours into the game, reached out to support (surely a player got mad and reported me)\n*3 Days Later*\nSupport: You were warned for \"Running cheat software on client alongside game. Future infractions will result in a ban.\"\nwhat??? \nNot sure what program triggered it but be cautious of buying the game, you might accidentally enjoy it then be called a cheater for playing it. I'll keep you posted if they do ban me for continuing to enjoy the game o7", 0.5332198143005371], ["Lots of flash; very little substance.\n\nVery poor integration with Logitech G29 Wheel/Pedals setup.\n\nNot possible to dial out the absurd amounts of steering oscillation. Checked the (mostly useless) online setup guides and tested their settings however the underlying controller interface is not sufficiently flexible to tune out the yaw without deadening (and substantially degrading) the overall steering performance.\n\nMight work with a controller, however I purchased it in the hope of being able to drive cars in a semi-arcade / semi-simulation mode using a wheel and pedals. During the \"refund window\" most of the game time was spent yawing from one side of the track to the other and ending up backwards.\n\nDespite lots of bump vibration through the FFB wheel the actual engagement between the vehicle and the track is remote and lacking in any real road feel. If the car behaved more in an arcade mode (i.e. did not enter excessive yaw oscillation at the slightest provocation) this lack of track engagement would not be so much of an issue. However in the current case the lack of track engagement, and the tendency to oscillate wildly at the slightest provocation, the overwhelming sensation is one of lack of control.\n\nThis means the game sits uncomfortably between \"arcade\" and \"simulation\" modes. It is neither accurate enough to even approach a \"simulation\" nor unrealistic enough to perform well as an \"arcade\" style driving game.\n\nRequested a refund.\n\nLooks like it is back to Assetto Corsa (surprisingly good car simulation) or iRacing...\n\n", 0.5265279412269592], ["Good luck even logging into this game. Can’t log in on Steam Deck nor Windows PC. If you search online for “Forza Horizon 5 login issues”, you’ll see tons and tons of threads of people complaining about this issue. Despite enjoying it near launch, I cannot recommend this game to anyone.\n\nI won’t be buying future Forza games, both Horizon and Motorsport. If the devs can’t even figure out how to make a login message to appear and actually function, I can’t trust them to make actual good gameplay. There’s so many better racing games out there on PC. Spend your money with a different game development studio.", 0.523809552192688], ["Why the fuck is the multiplayer so goddamn hard to figure out. Fucking hell this game is bullshit.", 0.523809552192688], ["Account troubles allaround. Getting locked-out after just one typo in my password. Kindof sick of the gazillion different accounts needed for games from arrogant studio's like M$.\r\n\r\nApart from that, it's an uninspired, bland money grabbing affair.  Waste of time&money.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1551360/d466b468fb5d5c7efe08507852eb3c0b40707aec/header_alt_assets_2.jpg?t=1745496023", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1551360/1284a0f32be0649dd25681b1f8a7658691073796/capsule_231x87_alt_assets_2.jpg?t=1745496023", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1551360/1284a0f32be0649dd25681b1f8a7658691073796/capsule_184x69_alt_assets_2.jpg?t=1745496023"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.forzamotorsport.net"}, "developer": "Playground Games", "owners": "5,000,000 .. 10,000,000", "tags": ["Racing", "Open World", "Driving", "Multiplayer", "Automobile Sim", "Realistic", "Simulation", "Adventure", "Arcade", "Exploration", "First-Person", "Co-op", "Online Co-Op", "Sports", "PvP", "Atmospheric", "Singleplayer", "Beautiful", "VR", "Action"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Czech", " Hungarian", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese", " Turkish"], "concurrent_plays": 24973, "number_of_achievements": 164, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "HDR available", "Family Sharing"], "genres": ["Action", "Adventure", "Racing", "Simulation", "Sports"], "short_description": "Explore the vibrant open world landscapes of Mexico with limitless, fun driving action in the world’s greatest cars.", "long_description": null}