{"name": "BONELAB", "app_id": 1592190, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£29.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 9818, "negative_reviews": 2764, "reviews": [["Overpromised, underdelivered, abandoned.\n\nBONELAB is a game that owes its entire monetary success to an initial wave of unearned hype. Let me make this clear: I LOVED Boneworks. It's one of the best VR titles available - even now, years after its release. But this game, despite all the bold claims of having \"full modding support!\" and being \"like Boneworks but bigger and better!\", BONELAB is nothing but a hollow shell with a pretty painted exterior - a glorified tech demo for a promising concept that will never see the light of day. \n\nNever before have I felt so scammed by a developer I had come to trust. Stress Level Zero, you should be ashamed. And to anyone reading this review who is considering buying BONELAB, do yourself a favour and just go play Boneworks instead. There's nothing worthwhile for you here.", 0.6616411209106445], ["Despite BONELAB being a VR game, it has quite frankly changed my life; modding is my main hobby and has led me down a path of a gamedev career that I would have NEVER thought about before. The game itself is great, it sets out to do what it intends; a VR title centered around modding and a campaign to demonstrate the capabilities of the 1Marrow interaction engine. Each \"patch\" contains improvements to Marrow, and incremental improvements to the campaign. Don't think of BONELAB as a campaign with modding support tacked on; this is a VR modding platform, driven by 1Marrow, demonstrated in the campaign.\n\nThe raw value a user gets out of this game should not be determined by the campaign, which many perceive as too short. Rather, it should be determined by the value from mods, and the campaign as a side value. The MarrowSDK is still relatively basic, at the writing of this review we still only have official support for levels and avatars. However, the advent of the community contributed to and created by, Extended SDK, allows for spawnables and complex mods in general to be made. People say that the MarrowSDK is \"holding back the mods\", however most modders utilize the Extended SDK, making this \"limit\" people say is hindering the game, not be an issue. \n\nAs a modder myself, I am FULLY satisfied the the game as a whole, the SDK and Extended SDK capabilities, and community.    I have NEVER had to limit my scope of a project because of a limitation; I've been able to accomplish what I set out to make, could be a map, gun, avatar with abilities, etc. The strongest aspect of BONELAB mod creation and development is the community; a strong, resourceful, and inviting community willing to embrace and help create. Starting in late 2022, I've amassed over 1.2 million downloads across all my mods. If that doesn't show the success and value people hold of this title, then I don't know what does. If you think this game is \"dead\" and people don't care about it anymore; you are greatly mistaken; just take a look at the download count of some of the most downloaded mods.\n\nPurchase this game if you value the hard work of modders, the fun of mods and a campaign, and the hard work Stress Level Zero and their dedicated team have put into Marrow. To date, it is the has the most sophisticated VR player rig in any VR title so far; and with indirect progress being made towards future titles via Marrow being the backend of them, it will only, and always get better from here.", 0.5839394927024841], ["i absolutely love this game it's just like boneworks 1.7 with a bunch of more content and cool lighting!! also you cant break your wrist like how you can in boneworks tho :( but im not sure if this is intentional but when i go in slowmo sometimes it has slowmo on for a bit and im not holding the button down. also when i am heavy/tall avatar for some reason the virtual arms go farther than where my controller actually is also not sure if thats intentional but overall really nice game!!!", 0.5634920597076416], ["The base game is just boring, the mods dont do anything intresting. And being able to change your charcter is not really a feature thats worth buying the game over any other vr game. Its the difference between being a 10 pound anime girl or a morbidly obese fat man, aka just size and damage.", 0.5302364826202393], ["Absolutely amazing game! The entire thing is really fun, a decent sequel to Boneworks, though I definitely think it should have had more side story activities like Boneworks did like with the entire quest needed to unlock the dev guns (it was a pain but SO incredibly fitting). having to get a bunch of dragon balls was really funny to. While I do prefer the unlock system of the previous game, with the sheer amount of new items in Bonelabs, the capsules definitely work, but I definitely think you should have to have to go through the process of finding a huge amount of capsules before unlocking the vending machine. All in all, unlike other people, I think the music is amazing, even if it doesn't all fit together like in the previous game. Anyways, this is a must get game for vr and it is still getting better even if it is slowly, and only on thursdays.", 0.523809552192688], ["wish it had a better campaign, but the mods and custom content are always fun to check out every couple of weeks. The modding scene carries this game HEAVILY.", 0.5], ["One of my most favorite sandbox physics game of all time, everything is just perfect.\n\nstory is a 10/10\n\ngraphics are awesome\n\nyou can download mods without being scared of downloading a virus. \n\nEverything about Bonelab is just 1000x better then Boneworks my opinion at least.\n\nif you are thinking about getting Bonelab then go strait for it! It's okay for 12 or 13 + year olds, nothing really to inappropriate.", 0.5], ["this game made me realize im a terrible person and i deserve to be executed by a firing squad but ford is funny :steamhappy:", 0.5], ["Absolutely wonderful game. I remember playing it in 2022 when I had my Quest 2 for maybe a few months or so, now both my Quest 2, and myself alike, are much older, and this game still remains a masterpiece. I was extremely immersed from the first level, thoroughly enjoying looking for every keycard, keycard door, and minor lore piece I could find. It's just a shame that the campaign is so short, it would be wonderful if it was longer.", 0.5], ["Very fun. the campaign is surprisingly good. the sandbox is really fun to just spawn fords and kill them in it. plus there are so so many mods to have fun with!", 0.5], ["The last game Stress Level Zero made was called \"Boneworks\". And in that game my bones worked fine and now i play \"Bonelab\". And it appears that my bones have started becoming a lab. Like i can hear the half life scientists and arthur ford in my bones. Please Help. /s", 0.5], ["good game  i kinda hate that the updates broke some older mods but still has some cool ones", 0.5], ["Very good game sometimes I find a few bugs when I use dev tools but no suprise story wise Idk don't do dat stuff but Just fun wise 11/10 play it", 0.5], ["who cares about the \"short\" campaign, it's a really fun game on both quest and pc,\r\njust download sdk mods and code mods to make the experience better (especially fusion)\r\n\r\nthe interactions are good and feel natural, and the contents of the game are full of cool and exciting stuff!", 0.5], ["Punch Ford, Punch Null, Punch Crablet, Punch Wall, Punch Barrel, Punch Box. Get pew pews, shoot zombie, celebrate, touch own virtual boobs. Celebrate. Get bored...\r\n\r\n\r\nKill more ford. 10/10", 0.5], ["Even if the base game campaign isn't very long, there are plenty of collectibles to find and TONS of mod to install.\nFusion is a must-have.", 0.5], ["Beat the game in 5 hours here's my review and opinion\r\n\r\nLets start with the basics and what i knew when going into the game\r\n- Bonelabs is underwhelming compared to boneworks\r\n- Bonelabs is more like a modding engine then a game\r\n- Bonelabs has \"the best\" physics\r\n\r\nHere's what i felt when i beat the game\r\n- Campaign is alright its like people said underwhelming the campaign is mostly based off of minigames then a actual deep story.\r\nThe puzzles in the campaign i often accidentally skipped instead of completing them... Oops?\r\n\r\n- The modding integration is kind of ass? It uses Mod.io i already dislike Mod.io for how it always crashes or spits out errors compared to Nexus mods and here it didn't even automatically log in compared to blade and sorcery and it didn't even allow browsing mods. Is that a luxury or something? To browse mods in game...\r\n\r\n- The physics are honestly not that crazy for my feel i often even disliked it.\r\nyour character is fully physics based getting hit by a fast moving object in the chest will cause you to be flung by it which makes sense. HOWEVER my character would REFUSE to climb as he would be kicking the walls for no reason and i also managed to soft lock 5 times during my 5 hours. (Technically 7 but i managed to glitch out of the softlock) The reason why this happened was cause my hand somehow clipped into the wall and there is no way to reset it once that has happened apart from making it pick up a weapon while its going crazy\r\n\r\nIn general you could say this is a negative review.\r\nAnd you WOULD be correct however the reason i am giving it a positive is mostly cause i lack knowledge of any actual good vr campaigns then anything else if i played a FUN and GOOD vr campaign then this would easily have been a negative\r\n\r\nSo here's the positives\r\nThe campaign allowed a decent variety of approaches. I often found a side route that i used to either get rewards or skip a part of the game which was funny in my opinion it felt like doing something unintended\r\n\r\nThe world has a nice vibe. \r\nI always liked watching boneworks and labs for its world, its got this hint of virtual reality X realism that makes it fun to watch and explore FOR ME atleast.\r\n\r\nThe death mechanic is cool! \r\nSounds weird but i like the fact that you can be dying and still survive by killing a enemy just like in borderlands! Makes battles a bit more intense when everything slows down and you HAVE to kill a guy or you die.\r\n\r\nAvatars with their own skills.\r\nWhile in this game it was more of a gimmick then a actual \"yeah we give you the tools figure out this puzzle goodluck\" even the puzzles where you did have to swap it was plainly OBVIOUS what they wanted you todo so like. Eh... But apart from that its a cool CONCEPT, now to see it actually get utilized properly in a more interesting manner.\r\n\r\nnow the negatives.\r\nThe physics for me were Super wack. I don't know if i had something wrong but if a item would be on the ground i could not crouch and pick it up as my hand would move away from where i guess you could say my feet are and into where ever the void is. So i would have to avoid crouching physically and instead crouch using the joystick then walk back a bit and THEN grab the item like ??? You have a force grab but like cmon i just want to hold the items in a specific way while doing it with just one hand. And of course my hand would often clip through objects for reasons that i cannot explain as i still don't know how it happened\r\n\r\nControls were fucked too\r\nI would get very off putting movement like getting stuck behind a wall and then launching forward\r\nVery \"ice like\" movement i would slip and slide around. Holding a item would make it try to calculate how i grabbed the item through my hand position AND compare both hands which made a bunch of items like a bat break whenever i tried to swing it compared to swinging it with one hand. Also you always needed a start up with running in order to jump otherwise you would do the most pitiful jump known to man. Running is also confusing as its barely noticeable if you are running or not (That's probably a me issue though as i prefer physically swinging my arms in order to run in game then standing idle)\r\nTHOUGH after i played a bit i got used to all this so its just something you gotta get used to i suppose.\r\n\r\nNow after ALL this i am not done with the game yet. As there is infact a port of boneworks for this specific game, and there's also a bunch of mods which make their own campaign that's the one advantage bonelabs has its a game about modding. So who knows what could be created given enough time", 0.5], ["definitely not my first playthrough, but my first on PCVR and man it was something, definitely should buy this game if you can, amazing mod support as well.", 0.5], ["Game is great, only after installing a bunch of mods though. If it weren't for mods, I'd only have maybe 3 hours on this game. If you're planning on playing this game, i'd recommend playing the campaign once, installing a 100% percent save (so you don't need to play the campaign again) and then just stick to modded content.", 0.5], ["It's a shame that the developers for this game couldn't pitch in as much as the modding community expected, but they are still updating slowly but surely, which is something. This game is definitely best while using mods, in which there are a huge amount of different guns and skins to use, but not so much in the gameplay department. It feels sort of like a hollow g-mod in a way, especially when using the fusion mod for multiplayer. Overall this game is a bit overpriced in my opinion as a large portion of the content in this game is provided by independent mod creators rather than the game developers, but if you can find a good price when it's on sale it has a short 5-ish hour campaign and the rest is all sandbox mechanics, which is just ok.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1592190/header.jpg?t=1672959398", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1592190/capsule_231x87.jpg?t=1672959398", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1592190/capsule_184x69.jpg?t=1672959398"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.stresslevelzero.com/"}, "developer": "Stress Level Zero", "owners": "500,000 .. 1,000,000", "tags": ["VR", "Physics", "Sandbox", "Action", "Shooter", "FPS", "First-Person", "Violent", "Action-Adventure", "Puzzle", "Combat", "Underground", "Experimental", "Psychological", "Indie", "Dark", "Story Rich", "Singleplayer", "Female Protagonist", "Atmospheric"], "languages": ["English"], "concurrent_plays": 151, "number_of_achievements": 55, "categories": ["Single-player", "Steam Achievements", "Tracked Controller Support", "VR Only", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Adventure", "Simulation"], "short_description": "BONELAB is an experimental physics action game. Explore a mysterious lab filled with weapons, enemies, challenges and secrets. Escape your reality, or wreak havoc. No wrong answers.", "long_description": null}