{"name": "Lost Ark", "app_id": "1599340", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 27243, "negative_reviews": 11706, "reviews": [["TL;DR: A great game, but way too expensive\n\nFirst off, the biggest positive of this game (for me) - it has the most satisfying combat system in an ARPG I have played. The skills are visually intensive, feel impactful, powerful. The boss fights are good, often have individual mechanics while being readable and well telegraphed. Learning a new raid is a satisfying experience, playing a raid is a satisfying experience. Getting into one - not so much.\n\nAnd this is where it all goes downhill. The game has multiple gear progression systems, which are both mandatory (to the point you can't enter an encounter without meeting some requirements) and VERY expensive. This creates a pretty unpleasant environment for players who don't want to spend either too much money or too much time in the game. And to make things worse, spending only too much time doesn't cut it. You get enough to meet the \"minimum requirements\" for the most recent content, but nowhere near enough to be considered \"strong\". As a result, the LFG experience is often extremely frustrating. You can legitimately spend more time trying to join or gather a group than you spend afterwards playing the raid. \n\nThis is what drove me away from the game in the end. I was playing the maximum allowed 6 characters in the endgame in order to maximize my income so that I could stay at the \"poorly geared\" category. It's exhausting and not worth it, despite the satisfying experience of the actual gameplay.\n\nI would gladly go back to the game in case they make a major overhaul of the endgame structure, scrap the multiple-character gold earning and reduce the power gap between the free-to-play users and the whales. Which is probably not happening, so I'll probably keep playing other games instead.", 0.7782060503959656], ["Better stay away for this gacha game before you fall into the addiction (I did).", 0.6694890856742859], ["Pro: 8/10 content (dungeons, bosses fights)\r\n       10/10 skins\r\n       8.5/10 graphic\r\n       10/10 cinematographic and music\r\n       7.5/ story line\r\n       ongoing updates and balance class \r\n       Even though, is seems that SG is listening more of the Asia community than the America or Europe, this game still has an active company which is looking for improving the game play experience and ease the difficulty of this game for new players. \r\n\r\nCon: 1.5/10 Community is extremely toxic and prefer to gatekeep 1640 chars in a 1620 content, making to lose a lot of time in lobby simulator. I don't know if the developers can solve this as it depends mostly of the community, maybe to ease the difficulty of the raids even more, or add more resurrections tries per raid.\r\n         5/10 repeatedly content \r\n         \r\n", 0.5593224167823792], ["Excellent combat with some of the best dungeon and fight design in any MMO completely ruined by horrible progression and an absolute mountain of daily chores.", 0.5792793035507202], ["terrible community. play solo or with friends but anything involving with randoms- just stay away. amazing game but holy smokes the toxicity level put even league of legends players to shame. 2/10", 0.523809552192688], ["Prime Example of how it can look when dev's don't play their game and force as much pay 2 play as possible, like either swipe for 100$ or play 6 characters 2 hours a day for a month and not even you can finish stuff faster if you play more, nono it is all daily timegated.\n\nGame itself would be still pretty cool tho..", 0.523809552192688], ["I did enjoy it when I played before, but it became too time intensive that I couldn't play anything else if I wanted to keep my characters topped off.\r\n\r\nRecommended only if it's your only game.", 0.5185614824295044], ["Good game, little hard to catch up as a new player but if you get into the comunity and find friends to play and be helped will have tons of fun once you learn the basics, currently none mmorpg has the good animations, raids and action combat that lost ark has, so even with the difficulty to get into the endgame and some gatekeeping on raids if you  not have friends to play with, i recommend ! currently there is some work from the devs to solve this problems, so just find friends and have fun ;)", 0.513889729976654], ["The game mechanics and graphics are attractive with semi complex build potential to allow for many options with mid to end game content.", 0.4927385747432709], ["Don't believe anyone's review on this game who has less than 400+ hours on this game.\n\nThe game's main purpose is too suck up your time in the exchange for gold (in-game grind time or real $)\n\nThe single player its fun until you reach gatekeep where you have to do raids. They are fun once or twice, but after that, it's a bunch of repeatable mission. \n\nIf you like hardcore raids, (2000+ hours) this game is for you, or else, move on.", 0.4920961558818817], ["If you're a new or returning player don't even bother coming back.\nYou'll spend 80% of the time trying to enter a raid.\nYou need to find a static to play this, and good luck with that when everyone wants to clear all the raids on reset day (wednesday) and you have a life.\n\nSolo raids are a nice addition but they feel more like a tutorial, with little reward, instead of an actual raid. So I don't see myself doing that for months.\n\nI'm sad because I liked the combat system, but everything else is garbage.", 0.5121951103210449], ["This game is everything that MMORPG needs! But it also needs time to play, that i dont have. Non the less if you like MMO and dont know what to do, play this. You are good for the next few years...", 0.5], ["the game is fun if you take it with the bdo mindset that it's a marathon and not a sprint if you go with that mindset the game is quite enjoyable", 0.5], ["I think the game is great. It has overcome many major issues over the last few years. the event passes pretty much get you to endgame where you dont have to grind i-levels if you dont want to. the visuals are stunning and combat feels great. each class feels unique and different from the others and all feel impactful. the raiding and dungeons are some of the best ive experienced Ive played destiny 2 and several other mmos for context)", 0.5], ["I kept hearing about the amazing endgame and how much content there was, but the farther along I got the more I realized that entire \"game\" is just a thinly veiled marketing vector that throws a shit ton of stamina or time-gated systems at you to annoy you into spending money to get past them or make some grinds more rewarding. There's a huge difference between a game designed to be fun, and a game designed to be engaging, and I feel like a lot of people struggle to understand that. Lost Ark's business strategy is literally create a problem to sell a solution. I'm convinced everyone who still plays it just has Stockholm syndrome, because that's what it felt like to me in hindsight. Once I finally got off for longer than a week, the only feelings I could ascribe to the whole experience was a sensation akin to finding out someone I'd been hanging out with was only around to get me to buy things for them.", 0.5], ["Good game, friendly community, lots of stuff to do and collect, interesting and mechanic heavy boss battles, a little pit p2w but you don’t have to.", 0.5], ["nice graphics and gameplay. very addictive very fun.\nbut it doesn't respect your free time. it forces you to login everyday and do dailies the whole day..\n", 0.5], ["Much time, much pew-pew, much shiny.\r\nMuch collect-a-thon/vertical progression.\r\nWoW be damned if found maining this", 0.5], ["I  don't recommend anything published under Amazon Gaming worst company.", 0.5], ["why does this game still take 3+ minutes to launch", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1599340/header.jpg?t=1736361963", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1599340/capsule_231x87.jpg?t=1736361963", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1599340/capsule_184x69.jpg?t=1736361963"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.playlostark.com"}, "developer": "Smilegate RPG", "owners": "50,000,000 .. 100,000,000", "tags": ["MMORPG", "Free to Play", "Action RPG", "Multiplayer", "Hack and Slash", "RPG", "Character Customization", "Massively Multiplayer", "Sexual Content", "Action", "Adventure", "PvE", "Fantasy", "PvP", "Isometric", "Online Co-Op", "Class-Based", "Singleplayer", "Violent", "Gore"], "languages": ["English", " French", " German", " Spanish - Spain"], "concurrent_plays": 22412, "number_of_achievements": 156, "categories": ["Single-player", "Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support"], "genres": ["Action", "Adventure", "Massively Multiplayer", "RPG", "Free To Play"], "short_description": "Embark on an odyssey for the Lost Ark in a vast, vibrant world: explore new lands, seek out lost treasures, and test yourself in thrilling action combat in this action-packed free-to-play RPG.", "long_description": null}