{"name": "Palworld", "app_id": "1623730", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£24.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 129057, "negative_reviews": 6280, "reviews": [["This game is what I've wanted from Pokemon for years and years. Screw Nintendo for suing this company. They're only butthurt that someone made the Pokemon game that people have been wanting that wasn't them. They refused to allow the game to grow with the players or to make a more mature version of the game. I've made the decision to boycott Nintendo tbh. Anyway, this game is incredible. It's less like Pokemon and more like Ark with spheres that are used to catch the creatures in the game. What an incredible game. If you're on the fence about purchasing this game, you absolutely should just get it. Heck, I might gift it to you within reason. It's just that good.\r\n\r\n~Julia", 0.7119579911231995], ["With the newest update, the developers of this game added a EULA you now **must** consent to, lest you lose the ability to play the game you purchased in the past. This is EULA roofying at its finest (check out Louis Rossmann on YouTube for more information). They are retroactively changing the terms of the sale... after the sale. I do not support this, and though I loved this indie jam for defying the AAA space and all that, and though it breaks my heart to have to part with it, I cannot accept this exploitative consent-roofying, where they hold **your property that you purchased** hostage until you \"consent\" to a new EULA.\r\n\r\nGoodbye, Palworld. See you in hell, Pocket Pair.", 0.6185242533683777], ["Yeah, Idk. I wouldn't say I didn't enjoy it. It had its moments. However, as someone who prefers to play single player... this game felt janky. It had a lot of the components from other titles which, when combined, turned out to be pretty fun. You had Ark Survival, Pokemon, and LoZ:Botw mushed into a single game that provided a fairly unique experience.\n\nThe issue arises with everything beyond those core concepts:\n* The XP gain rates where out of sync with progression (Can be changed in server settings) \n* Build Area Limits felt frustratingly small (A build area that increases with base lvl would be nice)\n* End game grind is just tedious (Breeding, Blueprint farming, XP farming)\n\nNow I know I'm part of my own demise here, due to my stubbornness to tweak the server settings mid-playthrough... and yet I believe the game should have a preset scaling for single player. In my belief, with any open world game, you should only feel underleveled in a game if you rush the story. Rush the zones. Etc etc. LoZ BotW sort of treatment. In this game however, I had explored the entire map, gathering hundred of effigies, defeating every boss (some multiple times), and catching every single pal I knew existed... yet despite all this... I found that the lvl gap only creeped to be larger and larger. (I was at one point fighting enemies about 15 lvls above me, as I had nothing else left to do other then grind xp)\n\nI don't think the game is \"bad\", there is a lot of good in it. However, here are some adjustments I'd recommend (not tested personally)\n* Check out videos for a recommended (single player) world setting list.\n* Help yourself to the nexus mods page. There is plenty of mods out there, some addressing the issues I had.\n\nIn general, keep an eye out for anything that improves the breeding system, ensures a more fluent progression system, modifies the blueprint system, and enhances the building system. (If I ever go through the World Settings myself and determine what feels right to me, I'll update this. I'm open to suggestions if anyone can find a ideal progression system! The goal would be to hit lvl 60 the moment you've explored the full map, defeated every boss on the map, defeated the oil rigs, a little wiggle room for dungeons + predator pals, and finally defeated all the legendaries.)", 0.6047160625457764], ["Very good game. Enjoyed it a lot!\r\n\r\nin over 400 hours ive only had 1 crash, and that was after turning the game off, but it did not result in any data loss.\r\nThe building is fun and functional, there is a ton of different things you can build and style your buildings with. The Pal's you capture can run around your base planting, crafting, building things for you, Pal's have different skills of what theyre able to work with as well as different personality traits. Plenty of are useable as mounts and you can fight while riding. Some have other uses, like use a pal as a flamethrower by holding it for example.\r\n\r\nIf you ever see your pals being stuck / not moving, don't worry about it, they will haul, craft, eat and sleep on that spot until you get them unstuck, but theres no issue with them. (in rare occasions they might fall thru the world when you arent in base, and then just put them into the Palbox and let them heal and such. (this only happend like 5 times in 200 hours.) - Game recives patches very often, and never had an issue with it breaking a save or something, ever. Can still start up and play my save from a year ago without issues.", 0.5691887736320496], ["It's the biggest piece of dogshit, Collisions fail on base crafting and every aspect of the terrains biome. do not purchase this game until they released the full version and fixed every collisions of the game.\nexploring is not rewarding and the map is soulless.", 0.5682122111320496], ["9/10  \n\nThey teamed up with Terraria!!! and they have Pals i can train! Terraria with Pals! this is a game you can enjoy for years. i cant wait for the full release. each update proves to me that creativity creates a games longevity. \n\nthere are semi buggy and choppy moments but overall, im enjoying the experience and would love more customization on bases next. im excited to see where their creative minds take them. great game and macanics! with some visual edits we got a 11/10!", 0.5634920597076416], ["Early game is quite fun, but the second you get to around level 15 the grind REALLY sets in. This would be fine if the core gameplay loop was interesting... Unfortunately it just isn't.\n\nLong story short, it feels like this game lacks a lot of depth in every metric. Visually I find it uninspiring and uninteresting, AI feels extremely dull, fights are excessively repetitive, and overall the game feels empty. To me it very much seems like this game is just a remix of existing ideas and concepts, it doesn't feel innovative.\n\nI want to stress that I don't think Palworld is a bad game. I'm sure it has it's niché, and perhaps it is way more fun with some friends. I dove in with no expectations, and realized that it is just not for me.", 0.5545348525047302], ["Its been about a year since the game launched and so far its still a buggy mess. The only thing added to the end game loop are \"oil rigs\" which are easily the most boring, terrible activity they could have possibly come up with. All the enemies have x-ray vision and aimbot, giga inflated health pools and damage. To make matters worse you can't even really use your pals because the pathing is broken and the Pal AI is dumb as rocks (not to mention the giant laser beam towers that will immediately turn to where your pal is and shoot them through a wall until dead). This would be fine if certain necessary items weren't locked behind this activity so you wouldn't have to do it. Everything else remains to be the same as before, terrible building, breeding pals is basically \"sit around and pray\", dungeons are still as boring as they were when the game launched (no seriously they haven't been changed one bit). \r\n\r\nThe general progression is \"get big gun, get strong pal, get even bigger gun and stronger pal\". Early game this works because the progression is so fast and you get stronger in bigger increments + you have a real reason to go out in the world and get random pals because they might roll with specific traits you want. Late game the only pals that matter are legendary pals that only have 1 spawn on the map and respawn every in-game. So all you do is just stand around and wait while the working pals make you stuff and you get to go and kill the same legendary pal every single in-game morning, get nothing, butcher said pal and get nothing AGAIN. Then you get to come back home, pick up whatever eggs have been dropped from the pals that are breeding, hatch those eggs into pals that almost guaranteed will disappoint you with traits that you definitely do not want, rinse repeat until eventually you get bored. Nothing has been added that gives you a reason to continue, a stick with no carrot if you will. Whatever that may exist takes way too damn long to even be ready to do let alone actually attempt.\r\n\r\nThis game is basically just a worse ark survival evolved but the difference between the 2 is that at the very least ark has built in console commands that I can use to rectify w/e spaghetti code just caused me to get fucked over. This game is NOT pokemon and the pokemon comparison makes no sense other than the pal designs being obviously inspired by pokemon.\r\n\r\nTo make matters worse they have recently changed the EULA. Which for people that don't know how to read corpo bs, they are spying on you and taking whatever info they vaguely stated they can take and are using it for whatever they want. \r\n\r\n\r\n", 0.5541834235191345], ["i love having constant 7 gigabyte updates and whenever i try to play the game it just doesn't work at all no matter what i do, so i have to get a degree in coding and somehow quantum physics\r\n\r\nit's a good game, seriously, but these two issues is what really breaks it for me rn", 0.5524902939796448], ["Banning and censoring players on the forums that are not being abusive isn't cool.", 0.5503008961677551], ["Devs starting to lose their mind, the whole eula thing and now banning paying customers thatbare disgruntled with changes that where not discussed and universally hated.", 0.5453947186470032], ["I absolutely love the sandbox style exploration in this game. I also enjoy the building function and how unlimited you are in terms of where you can choose to create a base. The progression style of the game reminds me of \"Valheim\" and \"Satisfactory\" in the sense that you can connect multiple bases through portals, and harness resources from certain areas based on their geographical advantages. This game is fun and light, yet complex in the multitude of things you can do; from catching Pals and assigning them to work, building an aesthetic base, harvesting and collecting resources, cooking for and nurturing your Pals, and even more. The pure awe inspiring experience of exploring the vastly large landscape takes up a lot of my game play, which is why perhaps I find this game to be so relaxing. I recommend this game to all.", 0.5362302660942078], ["Give us male and female instead of A and B. Since you banning people on the forum for saying that you get it here where you can't do shit about it", 0.5339383482933044], ["I was getting rather tired of the repetitive gameplay and inane edge-lord humor, but today browsing the comments I learned about the new shameless EULA. Uninstalling immediately.", 0.5275158286094666], ["Expect addictive gameplay, dark humour and a bit of grind. Still in early stages but crazy promising.", 0.523809552192688], ["Even Valheim has more updates.\r\n\r\nThe more you play, the more you feel scammed.\r\nThe map is empty, and so is the game.\r\nThere’s not much to do, and it becomes repetitive quickly.\r\nIt’s fun with friends, though — but only for short sessions.", 0.523809552192688], ["Don't know what's going on with the game but I can't play more than a few minutes without it crashing and powering down my computer. Still trying to find a fix for this so I can play with my friends. :/", 0.5236220359802246], ["Game still has really bad AI in it, and the pals just wonder around stuck most of the time while playing on servers. the recent update is making it so they can track your data, and not specifying what they are. They made crossplay sure, but they connections while playing are terrible still even after it's been out for a year.", 0.5214521884918213], ["Palworld is a quirky and charming blend of Pokémon-style creature collecting with a dash of survival, crafting, and full-blown madness. At first glance, it's a wholesome world full of adorable Pals, each with unique skills and personalities. But don’t let the cuteness fool you—this game has depth, danger, and more surprises than you'd expect.\n\nThe crafting and building mechanics are intuitive, and watching your Pals help out around your base is oddly satisfying. Whether you’re farming, battling, or exploring mysterious ruins, there’s always something fun (or hilariously unexpected) happening.\n\nWhat makes Palworld shine is its balance between cozy and chaotic. One moment you're feeding your cuddly Pal a berry, the next you're gliding through enemy fire with a flamethrower on your back. It's weird, wonderful, and totally addictive.\n\nIf you love games that don’t take themselves too seriously but still deliver a rich gameplay experience, Palworld is a must-try. It’s cute, chaotic, and full of heart.", 0.5199999809265137], ["I bought this game for myself & my niece, to allow us to play a different game other than but somewhat similar to Ark, and this has been a great experience!\n\nSo many different Pals to capture! So many options for an Early Access game has been fantastic. Building, breeding Pals, stat configurations, Open World, dungeons, base building.... there is just so much fun to have. And RAIDS!! Even in Single Player (Optional too!).\n\nMy only gripes are that I wish the Base Radius could be larger as some items are huge. It forces you to build UP rather than out. Colors to customize even further yet. More love to Base Leveling. These are very minor issues and takes absolutely nothing away from the fun me and my niece have!", 0.5199999809265137]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1623730/058bd87dc17a7179e07c446aa64d0574ca43ab9d/header.jpg?t=1744776369", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1623730/4f823e476ad290ad4f19763e7d800723df422dfa/capsule_231x87.jpg?t=1744776369", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1623730/4f823e476ad290ad4f19763e7d800723df422dfa/capsule_184x69.jpg?t=1744776369"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.pocketpair.jp/palworld"}, "developer": "Pocketpair", "owners": "50,000,000 .. 100,000,000", "tags": ["Open World", "Survival", "Creature Collector", "Multiplayer", "Open World Survival Craft", "Crafting", "Co-op", "Adventure", "Sandbox", "Third-Person Shooter", "Automation", "Action", "RPG", "Early Access", "Anime", "3D", "PvE", "Indie", "Looter Shooter", "Hack and Slash"], "languages": ["English", " Simplified Chinese", " Traditional Chinese", " Japanese", " French", " Italian", " German", " Spanish - Spain", " Portuguese - Brazil", " Russian", " Korean"], "concurrent_plays": 32585, "number_of_achievements": 44, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG", "Early Access"], "short_description": "Fight, farm, build and work alongside mysterious creatures called &quot;Pals&quot; in this completely new multiplayer, open world survival and crafting game!", "long_description": null}