{"name": "Poppy Playtime", "app_id": 1721470, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 12831, "negative_reviews": 3141, "reviews": [["it was fun until yarnby came but i got rid of him so yall are good they fixed the patch", 0.523809552192688], ["This games is very fun and even the jumpscares are good but the graphics arent that bad but the glitches sometimes could get in the way of you playing i havent been able to get off one puzzle in chapter 4 but besides that these games are fire", 0.5], ["good game for those who love adventure,horror,and LOREEEEEEEEEEEE(creepy lore) than this is the game for you.", 0.5], ["this game is a fun horror game for the night it took me 6 hours to finish but worth it!!!", 0.5], ["Loved the all chapters of the game but don't like how i spent $5 on the 1st chapter just for it to be free next chapter", 0.5], ["This game is really cool and is very good game to play when your bored", 0.5], ["The game is super fun. For the first chapter. I mean, well done Mob Entertainment", 0.5], ["This game is a great horror game for people who want a very intense action horror game", 0.5], ["its a good puzil horror game if you like solving puzels and geting scared this games for you", 0.5], ["it is a very good brain booster game , however , i would like to see some more advanced in speed boost and graphic features .", 0.5], ["this game is full with fun scary expeariences like jump sacres and even more if you arnt playing this then wtf are you doing", 0.5], ["I love this game because ever since the first chapter came out I have been obsessed with the game.In January 2024 I decided to buy all chapters since chapter 3 was the newest one,when chapter 4 came out i was so excited to play.I did beat all the chapters and I hope you make more amazing chapters, keep up the good work", 0.5], ["the story is fine but the 3rd chapter is too long", 0.5], ["Its eh a nice game i was gonna make review about its now free for some reason. I bought it while it costed money about 3 years ago and now i just started the game and finished it for the first time. Last time i played was in 2022 Lol [GOOD GAME]", 0.5], ["Paid like $20 for the base game just for it to become free and for them to charge me for chapter 2 DLC.", 0.4893378019332886], ["I paid money for this & got no refund upon the price change. The company behind this game also sells nfts", 0.5258620381355286], ["Everything is too long but at the same time the story is rushed in weird ways for no reason. Very buggy for weeks after launch too.", 0.523809552192688], ["I actualy really love the game, the only issue is that i paid for the first chapter but it eventualy became free and i never got my money back TT", 0.4642857313156128], ["Mascot horror slop. I only have this garbage installed because my cousin who consumes brainrot all day likes it. Says a lot about what people enjoy these days...", 0.4583333432674408], ["very good but the others should be free im not paying money", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1721470/header.jpg?t=1745345916", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1721470/capsule_231x87.jpg?t=1745345916", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1721470/capsule_184x69.jpg?t=1745345916"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.mobentertainment.com/poppy-playtime"}, "developer": "Mob Entertainment", "owners": "2,000,000 .. 5,000,000", "tags": ["Horror", "Free to Play", "Singleplayer", "Puzzle", "First-Person", "Survival Horror", "Dark", "Mystery", "Psychological Horror", "Survival", "Indie", "Lore-Rich", "Adventure", "1980s", "Thriller", "Atmospheric", "Action", "Cartoony", "Action-Adventure", "Physics"], "languages": ["English", " French", " Italian", " German", " Portuguese - Brazil", " Russian", " Spanish - Latin America", " Japanese", " Korean"], "concurrent_plays": 1226, "number_of_achievements": null, "categories": ["Single-player"], "genres": ["Action", "Adventure", "Indie"], "short_description": "You must stay alive in this horror/puzzle adventure. Try to survive the vengeful toys waiting for you in the abandoned toy factory. Use your GrabPack to hack electrical circuits or nab anything from afar. Explore the mysterious facility... and don't get caught.", "long_description": null}