{"name": "Call of Duty®", "app_id": 1938090, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 126982, "negative_reviews": 91930, "reviews": [["Call of Duty — A Masterclass in Disappointment\r\nAh, Call of Duty. The game franchise that somehow manages to release the same game every single year, slap a different name on it, and still charge full price like it’s the second coming of gaming innovation.\r\n\r\nGameplay? Copy + Paste.\r\nEvery year it's:\r\n\r\nSprint → Slide → Jump → Die to some 12-year-old halfway across the world bunny-hopping with an MP5.\r\n\r\nRespawn → Get killed by a camper in the corner → Rage.\r\n\r\nThat’s the real Call of Duty cycle. Forget skill — this game rewards whoever can mount their gun on a window ledge faster than you can say \"broken hitboxes.\"\r\n\r\nMaps? Recycled Garbage.\r\nRemember that one map you liked from 10 years ago? Surprise, it's back! Only now it’s somehow worse. Either it's littered with a million objects that block movement or wide open fields where snipers thrive like mosquitoes in summer.\r\n\r\nSkill-Based Matchmaking (SBMM) — aka SweatFest 3000\r\nTrying to have fun? Not in this economy. The game sees you do well for ONE match and suddenly throws you into lobbies with professional esports wannabes rocking headsets more expensive than your console.\r\n\r\nMicrotransactions — The Real MVP\r\nWant a cool skin? $20. Want that same skin but in a slightly different color? Another $20. Want to actually feel like content isn’t locked behind a paywall? Too bad.\r\n\r\nIt’s like they sat in a meeting and said, \"How can we charge players for basic fun?\"\r\n\r\nWarzone? More like Bugzone.\r\nCheaters, invisible skins, broken guns, game crashes — it’s like a free-to-play FPS mixed with a beta test nobody asked for. Every patch fixes 1 bug and adds 3 new ones.\r\n\r\nFinal Verdict:\r\nCall of Duty isn’t a game anymore — it’s a $70 annual subscription to rage, sweat, and disappointment. But somehow... we all keep playing it. And that’s probably the biggest scam of all.\r\n\r\n", 0.8045846819877625], ["Honestly at this point I just play Call of Duty for zombies and to turn my brain off is small map hardcore mode. I would NOT be caught dead in Warzone.\n\nUpdate: I was caught dead in Warzone, thanks for the Casual mode.", 0.7151354551315308], ["    They banned you for nothing and when you ask what is the reason, they just made up something like you violated the terms of use. When you demand the proof of your so-called violation they simply say '' oh, sorry because of our security policy we can't tell you what exactly you have done wrong and please don't do the same thing again with your new account or you will be banned again.''  \n\n    So basically, if you are interesting in spending 60 dollars for a game and even more, if you are in to micropayments and spending hundreds of hours on it, you need to know they could take that away from you only because they want it without showing an actual proof. Moreover, you can't reach the customer service or a real person to sort this out in any possible way and find yourself in steam review section while writing this down.\n\n   To be honest, I am not pissing of because I am banned. If I deserve it, so be it. But you have to tell me what did I do.\nBesides, saying please don't do the same thing in future with new account or you will be banned again is simply a mockery. I got 486 hours on this game and I played same in each minute of it, then why you didn't ban me untill this time. Anyway, you guys get the moral of the story. This could be happened to anyone of you.\n\nBuy it at your own risk.\n\n\n        \n      Now, apart from the injustice of activision. Let's dive in the game review for multiplayer.\n\n1. Teammates can drag you to the direction they are running much faster than you could run and you have no control over yourself for a few seconds. But somehow you can't do the same to your teammates. This happens in hardcore all the time and they couldn't fix it for 15 years.\n \n2. Most of the maps are garbage. How 6 people can't eleminate other 6 people 75 times in ten minutes. That is how awfull the maps called redcard and rewind. Game should start with 20 people on such maps by default. So people don't have to select only nuketown 7/24 and steakout 7/24 for have some fun.\n\n3. Speaking of nuketown, in all version of this map, this version has the worst spawning mechanizm ever.\n\n4. Useless scorestreaks like interceptors and strategic bomber should be remove from the game.\n\n5. The matchmaking matches you different players allmost each time. So, you can't play with same people few games in a row and make some friends. People used to make friends with each other thanks to former matchmaking system. Players tend to spend more time in a game while their friends are around and I guess they just don't care about it.\n\n6. I bought an operator too. But come on, A turtle with an AK-47 ?\n\n7. I play only hardcore for much realistic gameplay. But all of the game modes are not available on hardcore and of course there is no ranked play for hardcore players.\n\nSo, these were the negative things I would like Activision to change to make this game much better. Nevertheless, none of them is matter anymore, since I am banned haphazardly. Eventhough, I liked to play cod ( look my hours ) I don't think I will buy a new bo6 or any other futher cod game. (Funny thing though, I have bought MW Remasterd and Infinity Warfare from Xbox discount just before a day I have been banned :D)\n\nThank you for reading this review and have a nice day. :)\n", 0.6447919011116028], ["I've never played or had a game that crashed so much as this game. I had it for xbox game pass and it crashed hundreds of time. Switched to Steam and same crashes. They don't care about fixing this game. It's all about micro transactions and revenue. Tickets do nothing other than waste your time. Avoid", 0.5367847084999084], ["Even with the return of Verdansk it's not enough to save Warzone......the movement, UI and the absolute circus full of clowns that is the ridicolous skins makes the whole game feel like \"The Fortnite for people who think they are too mature to play Fortnite\" \n\nNot recommended in the slightest if you used to play the old Verdansk since just by comparing videos of the old Verdansk experience shows a vastly different game than what it is now (movement, atmosphere, characters, weapons, everything is different now and not for the best) and even less recommended if you grow up playing the first CODs that actually took themselves more seriously and have a CLEAR and DEFINED artstyle and atmosphere, Warzone overall is one of the most jarring and unjoyable experiences I've come across in gaming", 0.5267686247825623], ["where do i even start number one i wanted to get my money back so i asked for a refund then they said no they cant do that because i had over 7 hours on the game which was bullshit at the time because i literly couldnt even play the damn fucken game because it took so damn long to load everything. Number two good luck finding a server with good connections because its impossible to find one even if you have a 100K pc setup there will alwyas be lag or packet bursts or some shit like that. Call of duty has completly fallen off its not enjoyable at all anymore and the campain is dog shit so thank you steam for not giving me my money back which i had all rights to get it back and thank you call of duty for being such an amazing game for us users. Fucken wankers", 0.523809552192688], ["Banned for \"altering game data\" 2 hours into playing the game. No infarction, no chatting, clean gamer tag. Account i had had forever. They addressed me as Hitler in my email. They wouldn't allow me to appeal. I believe i was hacked, they didnt allow me my refund back. What a joke.", 0.523809552192688], ["i hope i get to rape the fucking developers cuz this is the most retarded fucking game ive ever played", 0.523809552192688], ["paying for full game to play a zombie mode, even tho I payed last year the whole game. Fk off.", 0.523809552192688], ["Download is dogshit downloaded the game just to open it and download it again then wait for that to download and it not save my download because the game wasnt open", 0.523809552192688], ["The game size is ridiculous while only having 122gb of files installed in the launcher it takes up 200+ gb of storage its fucking stupid, 80gb worth of extra storage for a launcher? and the game is terrible optimization wise.", 0.523809552192688], ["This is probably one of the worst games i have ever played in my life. lets start off with not being able to play the game weeks after launch because a software they added made it unplayable for 1000 series cards, even tho it says on the steam page that a 1080ti is recommended.  i was getting 120 fps high with fsr on. they updated the game i was getting 45 fps with low settings and performance upscaler. it was unplayable. until i bought a new gpu that is. i was excited to try warzone only to find out i had downloaded a warzone HUB? 59 gbs???  i wasted 2.5 hours downloading a warzone hub that didnt even come with the game installed, so i now need to downloaded another 69 gb game. just to play warzone. 110 gbs for warzone and  a COD HQ HUB, wth is going on here. and i dont get how i went to the warzone page on steam to download the game and it still only downloaded the HUB and not the game. and lets not forget that i couldnt play the game for weeks  because they updated the game to make it unplayable.  i have a gtx 1070 and ryzne 5600x and i was playing stalker 2 with better performance. and that game doesn't know what optizmation is. so i dont understand how an fps shooter like warzone and black ops 6 to not get 60 fps on low settings. whoever thought of the COD HQ HUB should be fired honestly. because i shouldnt be downloading a 59gb HUB that does nothing expect make you close and open your games every 30 mins. so i couldnt play with my friends because a company who doesnt need anymore money needs to have a high player count on paper because everyone needs to have  the COD HQ open to even play warzone. and why are there 2 different warzone downloads to choose from anyway??? dont waste money on this dogwater of  a game.", 0.523809552192688], ["Good game it just sucks how they have to put all the games together takes up to much memory. && if your a good player they only put you up against sweats and tryhards give you all the bad teammates.", 0.523809552192688], ["Call of Duty is terrible, yet I play it... servers are awful. Hit reg awful.", 0.523809552192688], ["Really love how you took away resurgence  duos and trios, my friends love being forced to play the walking simulator verdansk where money is slim, weapons are slim, and good times are slim. stop taking away stuff from the game!", 0.523809552192688], ["300gb to install, updates are usally 100gb, microtransaction pop ups happen often, other players are 12 year olds that took too much adderal.\n\nzombies is kind of fun", 0.523809552192688], ["Game is steaming hot garbage. Cheaters and unemployed no lifes everywhere. Don't get me wrong I master prestiged and grinded the campaign along with multiplayer. The numbers of people leaving this game in droves speaks for itself.\n\nThe last great Call of Duty was Black Ops 2 and it's not even close.", 0.523809552192688], [" it crashes on me soooooo muccchh and ive done litterly everything to try to fix this issue but nothing works i wish there was some type of custumor service for this video game issue because i dont know who to go to for help with this. so i wouldnt recommend this game because it has made me more suicidal then was before not joking. the pop up i get is this beefoire it crashes...  DIRECTX ERROR error code 0x887A0005 (0x887A0005)", 0.523809552192688], ["b06 use to be really fun but every single update just causes my game or pc to crash in some regard, also doesnt help when all the new content is corny ai art and spirit halloween clearance isle skins. I really wanna ignore that stuff and enjoy myself but considering i cant even play for more than 5 minutes without a crash its not even worth keeping it on my pc. Still probably one of the better new cods all things considered and way better than new mw but its also the same directionless cod game they've been selling for the past 5 years.", 0.523809552192688], ["game is standard cod i only got it on sale to play with playstation buddy shit crashes if your gpu isnt fully up to date 100% of the time even then its a coin toss.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1938090/dd68f8902dcddadd3a47fecc4ccc586683592c6b/header.jpg?t=1744388487", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1938090/350e4e3df91961961e7a75cdf5b31bba0a7cc2c8/capsule_231x87.jpg?t=1744388487", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1938090/350e4e3df91961961e7a75cdf5b31bba0a7cc2c8/capsule_184x69.jpg?t=1744388487"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.callofduty.com/"}, "developer": "Treyarch, Raven Software, Beenox, High Moon Studios, Activision Shanghai, Sledgehammer Games, Infinity Ward, Demonware, Toys for Bob", "owners": "50,000,000 .. 100,000,000", "tags": ["FPS", "Multiplayer", "Shooter", "Singleplayer", "Action", "Military", "First-Person", "War", "Modern", "Tactical", "Violent", "Co-op", "Realistic", "Story Rich", "Atmospheric", "Mature", "Online Co-Op", "Gore", "Third-Person Shooter", "Third Person"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Korean", " Polish", " Russian", " Traditional Chinese", " Japanese", " Spanish - Latin America", " Arabic", " Simplified Chinese", " Portuguese - Brazil", " Thai"], "concurrent_plays": 67344, "number_of_achievements": 107, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Captions available", "In-App Purchases"], "genres": ["Action"], "short_description": "The Call of Duty® experience supports Call of Duty®: Black Ops 6, Call of Duty®: Modern Warfare® III, Call of Duty®: Modern Warfare® II and Call of Duty®: Warzone™.", "long_description": null}