{"name": "Lethal Company", "app_id": "1966720", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£8.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 258277, "negative_reviews": 6460, "reviews": [["Underpaid 10/10\nScared shitless 10/10\nFriends provide \"help and teamwork\" 5/10\n\nOverall an immersive gameplay in what it means to work in the modern day world.", 0.7562050223350525], ["There is one reason and one reason only on why I refuse to give this game a good rating: the lack of developmental progress from both the developer and the game itself.\nI, by no means, dislike this game, however I just couldn't bring myself to give it a good rating.\nGames like this that require an active fan base/community often need to have frequent updates to maintain relevancy. This game just doesn't have that.\nWhen Lethal Company was still active with updates, it was incredibly enjoyable. I loved it and I think everyone else did too. Recently, however, the game has become irrelevant from lack of developmental progress. \nThis game did mean loads to me and the community it created, but it could have easily been so much more.\nWith how much money the developer made from this game, I would imagine that they would have spent some on meaningful development of this game rather than letting it rot.\nI hate to see such a legend of a game go, but right now more than ever it seems like it's on the road to becoming another dead indie game among the many others like it.\nOverall, it is a good game, but it is a dead one. Nothing compared to when it first released.", 0.6730750203132629], ["This game is great with and without mods, you can play with fun and not so fun people, It's Balanced.\r\n\r\nWill get a good scream and many laughs out of you. \r\nHighly Recommend <3", 0.6628184914588928], ["This is a great game at its core, but honestly at this point it's probably never going to any more meaningful updates as the creator himself has stated that he's abandoned it for other projects, which also means no end game or resolution to the lore.\r\n\r\nIt's a great game to spend 20 or so hours in, and maybe have some fun modding, but don't expect a finished game from an abandoned early access title.", 0.6326043605804443], ["The game was very promising but has it been abandonned? \nLast upate was 4 months ago, and it was a minor one.\nAnother reason not to buy in Early Access.", 0.5766698122024536], ["Dev has basically abandoned the game adding maybe a very small patch once every 4-5 months. Completely lied about early access being only 6 months lmao.", 0.5547693967819214], ["really good mix of humor and horror, with the horror basically scaled to how many friends you're playing with, lol. better with mods, but decent on its own, too. interesting mechanics and monsters and runs beautifully on my laptop, even *with* extensive modding. i have more hours than it shows on my account, also, the ballpark is probably closer to 200. the memes aren't joking about this game turning anybody into a voice actor, lol", 0.5391113758087158], ["The sad fact is I cannot say that I would recommend someone buy this game in its current state. My friends and I have had COUNTLESS hours of fun and some amazing memories and nights of tear filled laughter because of this game and the modding community and many a game night was had with this as the centre focal point of the night.\n\nHowever after promises made by the developer that are never followed up and his recent \"Inspiration\" to develop more mechanics in the game because of the success of a similar game REPO shows that not only is he lying to his firstly Loyal fan base but also willing to borderline rip off ideas from more successful games to try and bring his back into the lime-light. That said, my opinion may change if he came back, made some original ideas and made the game fun again. Until then I cannot recommend you buy this game.", 0.5268816947937012], ["this is probably the best game i ever played it is super fun with friends but very scary at moments with things like the ghost girl there is new lore coming soon with the drill at the company building and i love lore like fnaf lore. yes there will always be room for improvment like every game but honestly the only big problem is its a pc game and most of my friends don't have a pc but if anyone gets one this should be the first game you should suggest.", 0.523809552192688], ["A great and stupidly funny game that you can play with friends or solo, if you like psychological horrors and chaos.. there's definitely a lot of that in lethal company, i 1000% recommend playing this!\n\n The only way your going to know if this game is for you is to try it yourself.\n\nHappy playing!", 0.523809552192688], ["I just can't stop playing this game.\nThe graphics, the soundtrack, the gameplay, the comedy and the terror of this game and the way it's all connected is what makes it a masterpiece. Playing it with friends will make it a great funny experience, but playing it alone is where you can truly see and hear the real horror of this game. I would definitely recommend this game for you if you want to die of laughter and terror at the same time. Masterpiece.", 0.523809552192688], ["This game is peak \"horror-comedy\" with friends. One minute you're genuinely tense, running around trying to avoid monsters, the next minute utter chaos erupts and you're laughing hysterically while your friend gets dragged into the darkness. It's simple, incredibly effective, surprisingly replayable (especially with mods!), and generates some of the best dumb-fun/high-adrenaline moments you can have in co-op. Occasionally though, the core loop can feel repetitive sometimes, and playing with randoms is a total crapshoot compared to a dedicated group. Overall, I highly recommended if you've got a group of friends to play with.", 0.523809552192688], ["Suuuper fun to play with friends. \n\nCan get scary when you wander the Maps alone, but most of the time its just whacky fun and laughs.\nThe Monsters and learning how to avoid them is pretty cool, and proximity chat adds a lot to the experience\n\nNow, go back out there we need to meet quote!", 0.523809552192688], ["lethal company - a game that will be quite scary and difficult to play alone, but with friends it becomes much more fun and easier\r\n\r\nand mods will only add either fun or hardcore to the gameplay\r\n\r\n definitely recommend it, but don't play alone if u dont want to go gray", 0.523809552192688], ["I enjoy this game a lot! There are many monsters, many moons, and many different items to collect. Each time you play is completely different from the last.", 0.523809552192688], ["Fun game with friends. Lots of content and places to explore, modding makes the game very replayable. 9/10 would play again.", 0.523809552192688], ["8/10 - Incredibly hilarious | Terrifying | Great with friends!\n\nLethal Company is a game created purely to play with friends. It's a game all about locating items with value and safely carrying them back to your ship to sell all whilst avoiding creatures of insanity & incredibly twisted designs. Find yourself upgrades / items to assist you / methods to increase your life stability & enjoy some of the most ridiculous items that you can imagine. \n\nI believe the Developer has taken a break from furthering development for this game which saddens me, I'd have loved more content. This game has so much more potential, hopefully one day there will be. - HOWEVER there is still a good 20-50 hours of fun to be had, easily.", 0.523809552192688], ["This game rocks - love it. I've had so much fun in this game, the modding community is great. If it was consistently updated, I think this would be one of my all time favourite games but it does feel like Zeekkerss has moved on.", 0.52173912525177], ["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☑ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n---{[M] = w/ mods}---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☑ 6\n☑ 7[M]\n☐ 8\n☐ 9\n☐ 10", 0.5154619216918945], ["The game is worth every cent! It's so f***ing funny when playing with friends, while still being creepy like other horror games when playing alone. Not only that, but the modding opportunities are endless since the game has such a big community. Definitely recommend", 0.5059880018234253]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1966720/header.jpg?t=1742986399", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1966720/capsule_231x87.jpg?t=1742986399", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1966720/capsule_184x69.jpg?t=1742986399"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Zeekerss", "owners": "10,000,000 .. 20,000,000", "tags": ["Online Co-Op", "Horror", "First-Person", "Co-op", "Survival Horror", "Exploration", "Funny", "Psychological Horror", "Sci-fi", "PvE", "Atmospheric", "Procedural Generation", "Aliens", "Time Management", "Adventure", "Dungeon Crawler", "Action", "Early Access", "Action-Adventure", "Perma Death"], "languages": ["English"], "concurrent_plays": 6328, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Partial Controller Support", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "Early Access"], "short_description": "A co-op horror about scavenging at abandoned moons to sell scrap to the Company.", "long_description": null}