{"name": "Tomb Raider", "app_id": 203160, "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£12.49", "final_price": "£1.87", "discount_percent": 85, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 43969, "negative_reviews": 2624, "reviews": [["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☐ One and done\n☑ Maybe after a year\n☐ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☐ None\n☑ cosmetics and other stuff\n☐ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☑ 8\n☐ 9\n☐ 10", 0.6170749664306641], ["This game for the price is worth it!!!\r\nGame is 13 years old and its still kicking,graphics are amazing same as combat \r\nMaybe one day we can get a remake", 0.5652173757553101], ["When it comes to storytelling, this game makes many mistakes with cheap sacrifices, Lara freezing at inopportune moments, and then charging into situations out of emotion rather than reason at other moments.\r\n\r\nThe game mechanics are rough. I can't decide whether the developers just didn't know how to work with a 3D environment or if they deliberately made things more difficult for keyboard and mouse to simulate controller gameplay. Either way, game mechanics are annoying.\r\n\r\nMy third big issue with this game is camera control. Cut scenes pop up without warning. One moment you can be fighting or scrambling for your life, trying to anticipate the next move, and suddenly you have no control because an unexpected cutscene starts that doesn't even feel like a cutscene at first. There are also many places in the game where you are forced to use specific camera angles while trying to navigate terrain which will hide the path forward from you.\r\n\r\nOverall, this feels more like a game designed for people who like to do speedruns rather than play for story or RPG.", 0.5478567481040955], ["amazing gameplay . absolutely worth buying , the game got so immersive in between . the whole world building is great and the mechanics and puzzles feels amazing . graphics are great too , modern AAA games should learn", 0.5286884903907776], ["played for the 1st time in 2013, replayed a 2nd time 12yrs after release and even tho the graphics are not super, the game itself is still very enjoyable. nice characters and development (from clean look, to banged up and bruised), nice looking maps and explorable areas, enough different types of enemies and behaviors, and most of all, a fantasy like, thrilling story that keeps you motivated to keep going on.  a single run 100% item collection took about 30 hours and honestly, looking at some achievements missed, it shucks that you can not replay a specific chapter in the game, but overall a classic to love.", 0.5253164172172546], ["I love this game, and even though it’s been around for a while, it’s still just as fun and relevant to play today.", 0.523809552192688], ["Tomb Raider (2013) is one of the best games I've ever played. The story is super engaging, the action feels smooth, and watching Lara grow into the badass we know is just so satisfying. There’s a perfect mix of exploration, puzzles, and intense moments. If you’re into adventure games, this one’s a must-play.\n\nTrust me, it’s worth it 👌", 0.523809552192688], ["Still the best story out of all three of survivor trilogy. There's something about it that is unsettling and unnerving that the other two can't hold a candle to.", 0.523809552192688], ["7/10\r\n\r\nI played this game on a whim, to get some good time after hectic days at work....and let me tell you, it was good. We've heard about Lara Croft everywhere, but playing the game is a different experience on its own. I would definitely recommend this game if you wanna get into Lara Croft world!\r\n\r\n", 0.523809552192688], ["[h2] A survivor being born from life or death decisions, [i]Lara Croft[/i] is the young girl that throughout the journey takes on the task to find out the truth and with that also become the infamous tomb raider. [/h2]\n\n[b] Trapped on an island by ancient magic, Lara is tasked to find out the source of what is stopping them from leaving the island, breaking that curse and with that also rescuing her friends that is part of the crew [i]Endurance[/i].[/b]\n\nThis game is really only [b]alright[/b]. It's very linear in the story telling and even though it has a large map, it's giving you access to one area at a time along with the story, with the option to go back with fast travel via campsites to explore more or to grab the few collectibles or challenges you might have missed out on during your first visit. All because you wasn't paying attention or because you lacked the equipment to access that certain area when you first encountered it.\n\nThis game does offers really great puzzles that you have to solve to progress, that had me confused more than I wanna admit. A few of the optional tombs can be accounted for here aswell. \n\nGameplay is great, with a few bugs... It's not game breaking, only really annoying. Game is really boring at first but it gets better with more advanced gear and equipment as you progress the story. Game has an easy way to find the stuff you highlight and with more skills earned you can also see collectibles through walls for more easy access. The best way is to look at the map and highlight the collectibles one at a time. The only thing that is impossible to highlight are the challenges required in each area. That's all up to you but I cleared every single one of the challenges without any guides. You just have to pay really good attention and use the survivor instict to find the required things that is asked from you amongst the environment you traverse.\n\nThe game is as I said only alright, it's not the best game I've played but not the worst on the list either. It's a nice origin story for the remake of character that is Lara Croft going from the innocent girl to the ruthless killer that does anything to get what she wants out of any situation. \n\nThe best part of the game is the stealth and without a doubt the gore. When you die, they leave nothing to the imagination. It's rough to look at but so satisfying. \n\nWorst addition to this game is the multiplayer, it's smacked full of bugs and getting the achievements sucks ass. I had to remove my save file to even have the multiplayer achievements trigger for me. [b]Massive f*cking L[/b].\n\nThis game is over 12 years old and I cannot tell you how much this shows when you play. \nI only really recommend the singleplayer part of this game, everything else is up for you to decide, for me... not worth it.. ugh..", 0.523809552192688], ["Overall great game and gameplay. Graphics are pretty good to play on even in 2025.", 0.523809552192688], ["somehow can't get past the first wolf sequence, the second wolf spawn and attacks out of my reach to shoot it. no matter how i put my graphics. :/", 0.5210744142532349], ["It was an amazing game that stressed me out with the camera shaking, all the intense situations you’re put in, etc., but overall, it was great. There were a few bugs here and there, so I had to reload my last checkpoint about three times throughout the game, but that’s okay—it was still really good.", 0.5185185670852661], ["Really good game for funny price. Definetly play it. I did it on 100% and every hour was worth it. Amazing map, visuals, gameplay and game mechanics. I recommend :)\r\n", 0.5], ["🎮 Gameplay and Mechanics\r\nThe game introduces Lara Croft as a young, inexperienced explorer who is shipwrecked on a mysterious island. Players guide her through a journey of survival, combat, and discovery. The combat system is robust, offering a variety of weapons and stealth mechanics. The climbing and traversal mechanics are fluid, adding to the game's exploration elements.​\r\nIGN\r\n\r\n📊 Critical Reception\r\nMetacritic Score: 86/100 based on critic reviews. ​\r\n\r\nIGN Review: IGN awarded the game a score of 9.1/10, praising its emotional depth and character development. ​\r\n\r\n🧭 Exploration and Tombs\r\nWhile the main story focuses on survival and combat, the game includes optional tombs that pay homage to the series' roots. These tombs feature puzzles and rewards, encouraging players to explore the island further.​\r\nIGN\r\n\r\n🧠 Story and Character Development\r\nThe narrative delves into Lara's transformation from a frightened young woman to a resilient survivor. The voice acting, particularly by Camilla Luddington, adds depth to Lara's character. However, some critics noted that the supporting cast lacked development.​\r\nReview Hub\r\n+1\r\nIGN\r\n+1\r\nIGN\r\n\r\n🕹️ Multiplayer Mode\r\nThe multiplayer component received mixed reviews. While it offered a different experience from the single-player campaign, many felt it didn't live up to the quality of the main game.​\r\n\r\n✅ Final Verdict\r\nTomb Raider (2013) successfully revitalized the franchise with a gripping story, engaging gameplay, and a relatable protagonist. It stands as a testament to the potential of reboots when done thoughtfully.​\r\n\r\n", 0.5], ["incredibly fun. i bought all 3 of the survivor path tomb raiders, and i have to say, this one was by far the best - story, the action, the challenges. 10/10 would recommend.", 0.5], ["its a good game and its fun for like a 11 year old game good graphics to\r\n", 0.5], ["Its the first game I ever played in my PC gaming career. The game has a great amount of content. Exploring the tombs, fighting to survive, saving our friends and all. The side missions are also quite good. The difference between many tombs makes every of them a memorable one. Would recommend anyone out there who haven't tried this game.", 0.5], ["The locations are beautiful, the action is insane, and it has great adventure vibes. Although it lacks the platforming and puzzles that made the previous games so good, it's still very fun", 0.5], ["Good game. At the beginning is a tad boring, but then it picks up and becomes really enjoyable. I bought the trilogy bundle for a real low price, which is what i'd recommend. Also, if you want fairly challenging combat, put it on hard difficulty, the other ones are baby mode. No skimpy costumes for Lara was disappointing, but oh well.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/203160/header.jpg?t=1729010886", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/203160/capsule_231x87.jpg?t=1729010886", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/203160/capsule_184x69.jpg?t=1729010886"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.tombraider.com"}, "developer": "Crystal Dynamics, Eidos-Montréal, Feral Interactive (Mac), Nixxes", "owners": "5,000,000 .. 10,000,000", "tags": ["Adventure", "Action", "Female Protagonist", "Third Person", "Singleplayer", "Story Rich", "Third-Person Shooter", "Multiplayer", "Exploration", "Action-Adventure", "Quick-Time Events", "Atmospheric", "Puzzle", "Shooter", "Stealth", "Cinematic", "Platformer", "RPG", "Reboot", "3D Vision"], "languages": ["English", " German", " French", " Italian", " Korean", " Spanish - Spain", " Traditional Chinese", " Russian", " Polish", " Dutch", " Czech", " Portuguese - Brazil", " Arabic"], "concurrent_plays": 1468, "number_of_achievements": 50, "categories": ["Single-player", "Multi-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "Tomb Raider explores the intense origin story of Lara Croft and her ascent from a young woman to a hardened survivor.", "long_description": null}