{"name": "Castle Crashers®", "app_id": "204360", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "CAD", "original_price": "", "final_price": "CDN$ 16.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 38873, "negative_reviews": 1219, "reviews": [["I played it back on the 360 and to this day remains a staple game for my friends and I to throw on if we can't think of something else to play since we know that no matter what, it's going to be a good time. Trying to go through the game playing different characters or different challenges make the game feel like it can be played over and over again. For the prices that it reaches when it's on sale, its a no brainer to add it to your library.", 0.6624287366867065], ["Yes, the game play is mostly button mashing. Yes, it is made for controller. Yes, it's music was mostly from Newgrounds due to the behemoth working with the creator of Newgrounds. Yes, it is a fun game. Yes, the multiplayer is good. Yes, the singleplayer is good. If I had to sum up this game in one word, it would be \"The dried mango slices of games.\".", 0.5804195404052734], ["guys this game is very good and peak the good starters are blue knight and orange knight tho the final boss sucks but when you win you kiss a clown (twitter user lol) anyway this really fun game you should play it", 0.523809552192688], ["Castle Crashers is the video game equivalent of chugging five energy drinks and trying to joust a raccoon with a stick—pure, chaotic brilliance.\n\nYou start as a colorful little knight on a noble quest to save princesses, but somewhere along the way you're fighting cyclopses, riding on deer that violently evacuate themselves through the forest, and battling a giant corn monster that explodes into popcorn. Nothing makes sense. Everything is perfect.\n\nCombat? Glorious button-mashing madness. Story? Shakespeare wishes. Multiplayer? It's friendship-ruining gold-hoarding betrayal wrapped in a Saturday morning cartoon.\n\nAnd the boss fights? They range from \"mildly concerning\" to \"what in the medieval acid trip did I just witness?\"\n\nThis game is dumb in the most intelligent way possible. 11/10, would swordfight a bear in a wedding chapel again.", 0.523809552192688], ["The game is really fun and addicting because you can replay it on many diffrent charecters to get more charecters and to get even more!\r\nBut you can rage at it every so often but i really do recommend it because its just a really fun game!", 0.523809552192688], ["pretty good game i used to play this on xbox wont disapoint grinding is a chore but once fully max its fun lol", 0.5083159804344177], ["Pretty cool game, especially for its low price. The perfect pick up and put down game. It can be taken really seriously and you can min-max your skill to hell and back, its enjoyable with friends but is also playable alone - I kind of wish the Arena characters weren't locked behind the hard mode. I understand its a skill issue, but I don't want to learn juggle that aggressively, I just wanna be casual.", 0.5], ["If you’re looking for a game that perfectly blends intense action, quirky humor, and a sense of nostalgia, then look no further than Castle Crashers! Developed by The Behemoth, this colorful, chaotic beat-'em-up has been captivating players since its initial release, and for good reason. It’s an absolute blast to play solo or with friends, offering a unique experience that is both frantic and fun.\r\n\r\nGameplay: A Wild Ride from Start to Finish\r\n\r\nAt its core, Castle Crashers is a hack-and-slash beat 'em up where you take on the role of one of several knights, each with their own unique abilities, as you attempt to rescue princesses, defeat insane enemies, and stop an evil sorcerer from causing mayhem. The gameplay is fast-paced, featuring a variety of enemies to crush, special moves to master, and power-ups to keep things fresh.\r\n\r\nThe real charm of Castle Crashers comes from its fluid, combo-based combat. You can string together light and heavy attacks to perform devastating combos, while unlocking new magical powers as you progress. Whether it’s launching enemies into the air with a powerful hammer blow or casting a fireball to clear a room full of enemies, the combat feels satisfying and impactful.\r\n\r\nThe game doesn’t just stop at combat. There are tons of unlockable weapons, characters, and even adorable animal companions to accompany you on your journey. The sense of discovery is contagious, making you want to explore every nook and cranny to collect the next item or uncover a secret.\r\n\r\nVisuals and Art Style: A Feast for the Eyes\r\n\r\nOne of the standout features of Castle Crashers is its art style. The cartoonish, hand-drawn visuals are vibrant, unique, and full of personality. Every character, enemy, and environment is packed with charming details that make the world feel alive. The animations are smooth, and even the most chaotic battles retain a sense of clarity thanks to the clever design choices.\r\n\r\nThe humor is also front and center in the visuals. From the expressions on the knights' faces to the whimsical designs of the enemies and bosses, the entire game exudes personality. There’s a constant lightheartedness that makes every encounter feel more like a hilarious spectacle than a traditional hack-and-slash fight.\r\n\r\nMultiplayer: A Perfect Co-Op Experience\r\n\r\nWhere Castle Crashers truly shines is in its multiplayer experience. The game supports both local and online co-op, and the sheer joy of teaming up with friends to take down enemies, share a laugh, and engage in friendly competition is unmatched. The chaos of battle is taken to a new level when you’re working together to defeat hordes of enemies, while also trying to collect the most loot. It’s always a race to see who can land the final blow or grab the most treasures, and the game’s lighthearted tone makes it all the more enjoyable.\r\n\r\nThe dynamic between players adds a layer of fun, with the possibility for friendly competition as well as moments of complete absurdity. Whether you’re saving each other from being overwhelmed by enemies or laughing over accidental betrayals, Castle Crashers is a perfect example of how multiplayer gaming should feel: fun, frantic, and endlessly entertaining.\r\n\r\nSoundtrack: Epic and Playful\r\n\r\nThe music in Castle Crashers is a perfect match for its overall tone. The soundtrack blends epic, heroic themes with playful, quirky melodies, ensuring that each level feels like an exciting adventure. Whether you’re exploring a forest or facing off against a giant boss, the music ramps up the excitement and helps keep you immersed in the action. It’s not just background noise—it’s part of the game’s personality.\r\n\r\nReplayability: Never a Dull Moment\r\n\r\nEven after you’ve completed the main story, Castle Crashers has plenty of content to keep you coming back. With multiple characters to unlock, challenging post-game content, and achievements to earn, the game offers hours of additional fun beyond the initial playthrough. The desire to level up, complete all the side quests, and discover hidden secrets ensures that Castle Crashers stays fresh long after you finish the main campaign.", 0.5], ["Castle Crashers is a charming, action-packed beat ‘em up that delivers tons of fun with its colorful art style, quirky humor, and fast-paced combat. The game features a classic hack-and-slash formula, where you and your friends can team up to fight through hordes of enemies, level up your characters, and rescue princesses. The co-op gameplay is where the magic happens — teaming up with friends makes every battle even more enjoyable and chaotic.\r\n\r\nThe humor is offbeat and entertaining, with plenty of goofy moments that add to the game’s lighthearted vibe. The diverse cast of knights, each with unique abilities, offers a good amount of variety, and the upgrade system keeps things fresh as you progress through the story. The levels are vibrant and creatively designed, each with its own set of challenges, keeping the gameplay engaging throughout.\r\n\r\nWhether you’re playing solo or with friends, Castle Crashers offers hours of fun with its exciting combat, charming aesthetic, and rewarding progression. It’s a timeless classic in the beat ‘em up genre that never fails to entertain.", 0.5], ["Awesome game to grind with friends! The back off barbarian achievement was STRESSFUL", 0.5], ["Pretty awesome, beat this game on green knight and now that it is done, I gotta do 100% on every character", 0.5], ["truly one of the best games of the generation. from the 360 in the living room to goofing off with friends on steam. this game never fails to make you laugh at its awesome stupidity while having some of the best gameplay you'll ever have (including all of its perks) there is a reason this game is overwhelmingly positive. so many different ways to play the game with how you unlock a new one after almost every game completion. buy buy buy", 0.5], ["was disappointed with how laggy the steam version is in comparison to consul. fun lighthearted game though. i recommend you play with friends as its allot more fun.", 0.5], ["A quintessential piece of my childhood, absolutely love this game.\n\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☑ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n", 0.5], ["Muito pica esse jogo,é ótimo com amigos tanto local ou online,trilha sonora foda d+", 0.5], ["fun and honestly pretty hard on the first few tries, probably better with friends", 0.5], ["I've beaten this game on other storefronts many times over. It's one of the best brawlers out there, and a surefire way to have a blast playing something with friends if you're all up for something with couch co-op.", 0.5], ["I been playing Castle crashers for a long while. Played on the xbox 360 and xobx one. Then after the dlc got announced bought it on steam. Always mained the green knight", 0.5], ["It has the best parts of classic beat-em-ups combined with addictive RPG elements and unlockables for tons of replayability. Can't believe this awesome game has only ever been $15!", 0.5], ["very cool and crashing castles, very cool when crashing castles\r\n", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/204360/header.jpg?t=1739466246", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/204360/capsule_231x87.jpg?t=1739466246", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/204360/capsule_184x69.jpg?t=1739466246"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.thebehemoth.com"}, "developer": "The Behemoth", "owners": "5,000,000 .. 10,000,000", "tags": ["2D", "Online Co-Op", "Co-op", "Beat 'em up", "Hack and Slash", "Funny", "Adventure", "4 Player Local", "Local Co-Op", "Multiplayer", "Local Multiplayer", "Action", "Singleplayer", "Medieval", "Cartoony", "Cute", "Comedy", "RPG", "Arcade", "Casual"], "languages": ["English", " German", " French", " Italian", " Korean", " Spanish - Spain", " Simplified Chinese", " Traditional Chinese", " Japanese", " Portuguese - Portugal", " Russian"], "concurrent_plays": 603, "number_of_achievements": 12, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Shared/Split Screen PvP", "Co-op", "Online Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Steam Leaderboards", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Action", "Adventure", "Casual", "Indie", "RPG"], "short_description": "Hack, slash, and smash your way to victory in this award winning 2D arcade adventure from The Behemoth!", "long_description": null}