{"name": "Call of Juarez: Gunslinger", "app_id": 204450, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "USD", "original_price": "", "final_price": "$14.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 8581, "negative_reviews": 485, "reviews": [["Fast-paced scenes and ground-breaking action, with good story and a great setting that makes putting down the game difficult. Beautiful art style, well-crafted dialogue and hours of underrated gunslinging pow pow to pass the time.\n\nSense of Death is a great game mechanic: added more thrill amidst shrieking bullets and hollering. Duels are well-made, focus-centric and hair-raising. The story format the game was told through kept things quick and fresh, with tons of interesting characters to season the package stew.\n\nJumped onto a ladder and spun to my death one time, but a singular, glitchy, cartoony demise like that can be overlooked in light of all the entertainment this game has to offer.\n\n9/10. A yeehaw game, and a good one.", 0.5652173757553101], ["Hey! So frankly speaking I've played already in this game when I was a child. So we can say that call of juarez this is the game of my childhood. I saw this game in one video on youtube and that many people and gamers advised to play in this game. I was really excited. I enjoyed my first try. I love and fond of western movies and wild west theme. So I find western games also really awesome and cool. This game gives you good vibe of wild west, a lot of different Weapon: shotgun, revolvers and many more. Such an outstanding and superb soundtracks and wild west atmosphere. I find the graphic, gameplay and the style of the game really nice. So the game is really challenging also. Bosses, bandits, camps and secrets, traps and tricky things always waiting for you. Everyone should at least to review and play this game. especially if you a big fun of wild west and western theme!", 0.5352112650871277], ["As a Texan, I can confirm this game accurately depicts an average Tuesday afternoon in Texas.", 0.5132743716239929], ["the amount of choices you can make in this game is wild, the story is fun to play , and the gun play is satisfying\n(btw did i tell you the main character is a aura farmer )\n", 0.5], ["This game had me smiling for the entirety of its four hour campaign. It's a highly stylized version of the old west compared to RDR2 and the gameplay is very linear in contrast. It embraces the tall tales from this era that features many names from this time period. The gameplay is similar to a COD campaign that is filled with quick time events and slow motion action. I appreciated that the secrets told the true stories behind many of these characters. I don't think the duels add much besides some frustration but I guess it breaks up the standard gameplay.", 0.5], ["The story and gameplay is good, and it is not part of the story of the two first games.", 0.5], ["Todo mundo deveria experimentar esse jogo. Extremamente divertido e objetivo.", 0.5], ["Short game, around 4 hours or less, but every second of it is enjoyable. Didn't expect it to have stuff like character levels and skill trees, but is a nice addition to the gameplay that gives you some amount of customization over your playstyle and unlocks cool new guns. The story, as short as it is, is engaging and has a charming style of narration filled with references to real life events and gunslingers", 0.5], ["It was really nice cause of the unique Western Concept that not a lot of games have ( not talking about rdr1/2 ) \r\n\r\nI enjoyed the graphics being cartoonish and kind off hand made. Gameplay was really nice cause of the shooting and stuff. Enjoyed every single bit of it\r\n\r\nStory was rich and really interesting.\r\n\r\nGG", 0.5], ["i can highly recommend this game,its good fun and you play as an ACTUAL masculine man in this game.", 0.5], ["It's the second best game Techland's ever made, right after Dying Light. Incredibly fun shooting, likeable characters and smooth action. If you're craving some Wild West action without having to watch your horse tripping and shitting every 5 minutes, this one's for you.", 0.5], ["There is only one part of this game I do not like. There is a dodge mechanic in this game where if you've built up a certain amount of meter and an enemy catches you offguard, you can press A or D to dodge depending on where the bullet is. This is a cool mechanic. But for some reason after you are successful, you cannot aim for the next like 2 full seconds and I don't get it.\n\nOutside of that, this game is like... the perfect little experience. The story telling, the gun play, the power ups, it's soooooo enjoyable. the 3.00 USD sale price is an absolute friggen steal", 0.5], ["The video game equivalent of a drunk cowboy spinning tall tales at a saloon. Congrats, you’ve bought a rootin’-tootin’ shooting gallery where historical accuracy takes a backseat to ‘let’s make every gunfight feel like a Michael Bay director’s cut.’ Enjoy mowing down outlaws with the subtlety of a fireworks show, all while the narrator backtracks his lies like my ex explaining their Tinder history. The duels? Tense! The bullet time? Cheesy! The skill tree? Proof that even Wild West legends need a participation trophy. Also, thanks for making me question if any of this actually happened—turns out ‘based on a true story’ just means ‘we Googled ‘cowboys’ once.’ Still, 10/10 for letting me fan my revolver like a meth-addled raccoon. Yeehaw, I guess?", 0.5], ["This part of the series brings us back to the classic western feel that was in Call of Juarez: Bound in Blood, the game that started my introduction to the series. Historical figures, revolvers, dynamite. A train robbery, a typical ambush with a broken down wagon, gunfights in banks and saloons - all of this works well to get that nostalgic feeling.\n\nUnfortunately, the game doesn't bring anything new to the genre, but is just a ‘good summer blockbuster’ that can be completed in less than 6 hours. After completing the main storyline, there is no desire to get all the achievements in the game or play its other modes.\n\nI still recommend the game because it's fun and will definitely give you some emotions for your weekend.", 0.5], ["Underrated gem that most people should experience at least one. I do have one problem with the game. It's sometimes very hard to see the enemy in the busy backdrop. I cannot tell if they are backdrops or enemies. Also I hate the duels. They don't work for me. Overall, it's a solid 7.5/10", 0.5], ["For a 12 year old game, it holds up nicely. The gameplay is satisfying enough to keep you engaged but where the game shines is the story. I didn't expect it to have such an intriguing storytelling, always keeping you on your feet, slowly teasing you about why Silas tells the stories at that specific bar.", 0.5], ["Had this in my library for years, finally decided to play it, love it so far!\nBit of an issue running on current hardware, simple fix using the link below:\nhttps://gameplay.tips/guides/call-of-juarez-gunslinger-refusing-to-launch-fix.html", 0.5], ["one of the best game but it crash the most of the time but still worth it", 0.5], ["I could leave my own review, but i'm going to link a that i agree with completely:\nhttps://youtu.be/ZWGGz6-lXxc?si=TUVNmVaJgu9aLmqY", 0.472222238779068], ["Red Dead Re--what? If you can only play one Western-themed Shooter, make it this game.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/204450/header.jpg?t=1728907994", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/204450/capsule_231x87.jpg?t=1728907994", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/204450/capsule_184x69.jpg?t=1728907994"}, "support": {"support_website": null, "support_email": null, "game_website": "https://techland.net"}, "developer": "Techland", "owners": "2,000,000 .. 5,000,000", "tags": ["Western", "FPS", "Action", "Shooter", "Singleplayer", "Story Rich", "Bullet Time", "Comedy", "First-Person", "Narration", "Adventure", "Dynamic Narration", "Funny", "Violent", "Atmospheric", "Arcade", "Gore", "America", "Historical", "Alternate History"], "languages": ["English", " German", " French", " Italian", " Spanish - Spain", " Russian", " Japanese", " Polish", " Portuguese - Brazil"], "concurrent_plays": 89, "number_of_achievements": 26, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Steam Leaderboards", "Family Sharing"], "genres": ["Action"], "short_description": "From the dust of a gold mine to the dirt of a saloon, Call of Juarez® Gunslinger is a real homage to the Wild West tales. Live the epic and violent journey of a ruthless bounty hunter on the trail of the West’s most notorious outlaws.", "long_description": null}