{"name": "PAYDAY 2", "app_id": "218620", "platforms": {"windows": true, "mac": false, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£8.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 149416, "negative_reviews": 20622, "reviews": [["[b]Payday 2 is one of those games that really delivers on the chaotic, high-energy co-op experience, but, unfortunately, it’s just not my cup of tea. I gave it a shot on a friend's recommendation, expecting a thrilling heist experience, but the constant barrage of action, noise, and chaos was overwhelming rather than exciting.\n\nThe premise is solid—you and your crew are robbing banks, pulling off heists, and trying to outsmart the law. The cooperative aspect is key, and there’s definitely a sense of satisfaction when everything goes smoothly... though that's pretty rare. The game thrives on loud, all-out action, and if you’re into frantic firefights with the police, this is your playground. But for me, it’s a bit too much. The constant gunfire, alarms blaring, and non-stop pressure made it hard to enjoy the planning and execution of the heists.\n\nI’m sure there are stealthier options for pulling off heists, but honestly, the chaos and loudness often seemed unavoidable. I get that it’s a big part of the game’s appeal, but it felt like the experience was more about surviving the chaos than actually executing a well-planned job. The game does offer a lot of content, and there’s a lot of depth in terms of customizing your character and planning out your approach, but the constant noise and confusion just didn’t sit right with me.\n\nWhile I can see the appeal for fans of fast-paced, cooperative action, I personally would go for something with less of a sensory overload. It’s fun for some, but for me, Payday 2 felt more like a frantic, loud mess than a strategic heist experience. I don’t think I’d recommend it to people who prefer more structured, less chaotic co-op experiences.[/b]\n\n[h1]Pros:[/h1]\n[list]\n[*]Solid co-op mechanics for players who enjoy chaotic action\n[*]Deep character customization and progression\n[*]Variety of heist options and environments\n[/list]\n[h1]Cons:[/h1]\n[list]\n[*]Too chaotic and loud for my taste\n[*]Hard to enjoy stealthy heists with the constant action\n[*]May not appeal to players looking for a more controlled experience\n[/list]\n[b]If you love fast-paced, chaotic heist action, Payday 2 might be right up your alley. But if you're looking for something more methodical and less noisy, I’d recommend looking elsewhere.[/b]", 0.6088714599609375], ["This game is so good even today, you can't really get board of a game like this I recommend playing this game, there is so many things you can do and different play styles you can do, every heist will be different depending on what skills, equipment, and weapons you bring. 10/10 its worth buying", 0.5459616184234619], ["very good gameplay even this is an old game, but still the community still lives on until now", 0.523809552192688], ["Payday manages to be fun, while also not being fun whatsoever. Horrendous grind, quickly repetitive gameplay, extremely satisfying looting and actions, poor stealth, fun combat. If I had to evaluate Payday with all the time I've put in, and all the moment's I've got back, I realise that it was the people I played with that made the game fun, barely the game itself. \n\nPayday is fun when you have hours to throw away into the grinder of retying stealth missions and endlessly repetitive loud missions; Payday is fun when you finally stealth the big heists like Big Bank and The Golden Grin Casino. Payday is fun when your using the most absurd weapon, while wearing the most absurd clothes, while robbing the most absurd bank. Payday is not fun when you lose a perfect run to a bug; Payday is not fun when the monotony gets the better of you, when the weapons, enemies, and maps, all blend together.\n\nI wish Payday was worth it. I wish it was worth it to learn the good maps and dlc's; worth it to find the good weapons and the most fun builds, but its not. Payday is not worth it. It takes too much time, asks to much of you, and doesn't give back what you deserve. Play a better game, that the fate of Payday; always to come back after a couple of years or months, when you forget the repetitive nature of all its mechanics, when it becomes fresh and new again. Only for a few heists later when that monotony starts to creep back in. \n\nPayday is not worth it. It was fun, and will always be fun; but it will never be worth it.", 0.52173912525177], ["Amazing game 10/10, came from playing it on console. Beautiful. If you ever have 4 hours free, watch the \"Complete Story of Payday\" (pretty sure that's the name) by Kknowly, so much lore. Devs did an amazing job, just wish there was a lot of lore in Payday 3.", 0.5], ["This is still a great game, not in terms of modern graphics, but in terms of pure ability to customise almost anything! You have the freedom to configure your character and complete heists the way you want!", 0.5], ["Great game to play with friends! Lots of tactics you can fuck up all the time", 0.5], ["great fun game, best played with friends.", 0.5], ["This is a great game for laptops that cant run the more graphics heavy payday 3. Deadgame my ass its still lively. Just gotta wait a bit for people to join you.", 0.5], ["This game is by far, a steal for its price. Only complaint is that it's practically a paradox game with how much DLC you need to buy in order for it to feel like a full game.", 0.5], ["10/10 game even after all these years still enjoy it like my first time playing, id  definitely recommend buying.", 0.5], ["When I tell you that this game is peak, I mean it. \r\n\r\nPayday 2 is the best heist sim EVER. I love the DLC (though a lot of stealth and loud loadouts and other things require DLC, yikes), I love the maps, teamwork, and especially the people you'll meet while playing this game. Some people can be douchebags, yes, but I've met super awesome people playing this game that wouldn't mind helping beginners. Better yet, get your friend(s) to play this game with you! Don't be deceived by how old it is, and PAYDAY 3 is kinda doodoo. I have a lot more hours on console, which is more limited, and the PC version has SO much more to offer.\r\n\r\nIMHO, 8/10. -2 for being so DLC heavy, but that's what happens when a game is this successful for so long.", 0.5], ["Payday 2 is just one of those games I will never be able to put down forever. Every couple of months, or years, I get that itch to pull off a heist, or to sneak into the white house. And when I see those 0's direct deposited into my bank account, it feels just as good as my first time (pause). I always end up getting tired of it again eventually, but that's okay cause I can never stay away forever. Payday 2 is a flawed game, and Overkill has done some very questionable things with the pricing of the base game and DLC, but with the strength and resolve of the PD2 community, this game will live on forever. Think of PD2 as the CS:GO of heist games; it's that damn replayable. ONLY get this game when it is on sale, and do not buy every single DLC you see. Go through them, look at the reviews, watch videos. Become educated on this game, and you will not be disappointed.", 0.5], ["im just happy this game still opens the fact there releasing new stuff for this game kinda shows they understand payday3 sucks for most people who cant even play that dogshit of a game but atleast we have the classic right?..... right?\n", 0.5], ["robbing orphanages to unbankrupt indie devs while killing corrupt fbi agents in a attempt to reincarnate criminal god and revive technoblade", 0.5], ["great gamplay been playing for about 8 years super fun lotst of dlcs", 0.5], ["laest realistic game means i can do crazy shit (ie dodge)\r\n\r\nvery cool, but most of the game is in dlc", 0.5], ["Just a certified hood classic. incredible gunplay, great customization options for guns, excellent personalization options for masks, tons of missions, etc.\r\n\r\nOnly 70 hours on steam but about 500 on ps4\r\n\r\n10/10", 0.5], ["pretty fun except it consumes ALL OF MY INTERNET SPEED.", 0.5], ["PAYDAY 2 – Plus réaliste et toujours aussi fun\r\n\r\nPAYDAY 2 améliore tout ce qui avait fait le succès du premier jeu. Le réalisme des braquages est bien plus poussé, avec des missions plus variées et des stratégies plus complexes à mettre en place. Les braquages sont stylés, chaque mission étant une véritable aventure où chaque décision compte. Les graphismes sont également nettement améliorés, offrant une expérience visuelle plus immersive.\r\n\r\nL’aspect coopératif du jeu est toujours aussi génial, et c’est un vrai plaisir de planifier des braquages avec des amis, ou même de s’adapter à l’imprévu si les choses tournent mal. Les différentes classes de personnages et le système d’amélioration permettent de personnaliser ton expérience selon ton style de jeu.\r\n\r\nEn résumé, PAYDAY 2 est un excellent jeu de braquage, encore plus réaliste et fun que son prédécesseur. Si tu aimes les jeux de stratégie et de coopération, c’est un incontournable.\r\n\r\n", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/218620/header.jpg?t=1729586701", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/218620/capsule_231x87.jpg?t=1729586701", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/218620/capsule_184x69.jpg?t=1729586701"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.paydaythegame.com/payday2/"}, "developer": "OVERKILL - a Starbreeze Studio.", "owners": "20,000,000 .. 50,000,000", "tags": ["Co-op", "Action", "FPS", "Heist", "Multiplayer", "Looter Shooter", "Online Co-Op", "Stealth", "Crime", "Shooter", "Team-Based", "First-Person", "Great Soundtrack", "Gun Customization", "Tactical", "PvE", "Strategy", "Singleplayer", "Funny", "Simulation"], "languages": ["English", " German", " French", " Italian", " Spanish - Spain", " Dutch", " Russian", " Japanese", " Simplified Chinese", " Spanish - Latin America", " Korean", " Polish"], "concurrent_plays": 23450, "number_of_achievements": 1328, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Tracked Controller Support", "VR Supported", "Steam Trading Cards", "In-App Purchases", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "RPG"], "short_description": "PAYDAY 2 is an action-packed, four-player co-op shooter that once again lets gamers don the masks of the original PAYDAY crew - Dallas, Hoxton, Wolf and Chains - as they descend on Washington DC for an epic crime spree.", "long_description": null}