{"name": "Grim Dawn", "app_id": "219990", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£20.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 34678, "negative_reviews": 1774, "reviews": [["As a Diablo lover who's too old for Torchlight, too stupid for PoE 2 and too burnt by whatever Diablo 4 is, Grim Dawn was a fun time.", 0.7323322296142578], ["For someone who has played the game for 1000+ hours is a 10/10.\r\nAlthough the game is outdated when it comes to graphics it still looks good.\r\nGame play, controls and mechanics of the game is really good.\r\nThe developer is continuously doing major updates for the game.\r\nThis is more addicting to play versus D2R but it wont win againts POE.\r\nThe skill tree is not as complicated as POE but almost the same as D2R.\r\nThere are a lot of classes to choose from melee, range, summon, magic, DOT, etc..\r\nEach has its own choice of sub build for attack or magic type damage.\r\nJust being a tank with a retaliation build works here, basically standing and let the monsters die when they attack.\r\nThe story of the game is also good, especially the DLC of the game is so good its worth it.", 0.7085869312286377], ["This is the the best single player ARPG out there. If what you are looking for in an ARPG is build variety, replayability, and tons of meaningful loot, this game is for you. Don't bother with the bigger names out there. Crate has actively supported this game for 9 years (it looks great) and still has a major expansion on the horizon. This is not an MMO which means no microtransactions, no wonky action house economy, no shifting meta. You can still play multiplayer with up to three of your friends, though (similar to the old Torchlight II). The best part of the game is all the builds work. You won't have to look up some 500 skill point allocation guide to religiously follow (did I mention respec is dirt cheap :). TLDR: Best implementation of an ARPG I have ever seen.", 0.646907389163971], ["This game is almost a decade old, still gets updates and has less paid DLC BS than games still in Early Access.\n\nWorth", 0.5947860479354858], ["GD is a game I keep coming back to after about 600 hours spent in PoE2 and who-knows-how-many hours spent in PoE1, D3, Dungeon Siege, Chronicon, etc. A lot of the stuff that came about well after D2. Live service model games need to continually make decisions based on what will sell microtransactions - sometimes that means having players do chores to keep them in-game, sometimes it means limited inventory and stash space to sell \"quality of life\" microtransactions, sometimes it means more aggressive advertising. There's none of that here and it's very refreshing. I get the sense that nearly every decision made by the team is purely devoted to making the player experience the best it can possibly be while retaining all of the classic appeal of a good loot and class-based ARPG. The team doesn't compromise because they don't have to. Power fantasies are in full effect, gearing is fun, endgame is great, and if I ever get tired of any of this you can bet I'll start modding the crap out of this game.", 0.5922746658325195], ["One of my favorites. I've actually logged more like 5k hrs but previously I had the game on GOG...\r\n", 0.5548961162567139], ["Wasn't for me, but I think any ARPG fan would love this one! Lots of loot to collect and lots of critters to kill.", 0.523809552192688], ["Its a great game for low end pc users . The graphics arent special but they make up for having less requirements for your pc and the game is really fun.", 0.523809552192688], ["Grim Dawn is my favorite isometric RPG, the atmosphere is GRIM and bleak. The music also compliments the nature of the game, as well as the art style. Gameplay and combat is really addictive especially if you have interactive and visually pleasing skills. very fun to loot and pick up everything and destroy destroyables  \n", 0.523809552192688], ["I know I'm very late to this game, but it is a really good \"Diablo\" style game - isometric, with lots of loot and other similar mechanics. It goes a lot deeper than that too, but for a casual player like me, it's just really soothing and has lot of areas to explore at a decent pace. There's a ton of expnasions too, that I haven't touched yet so we'll see when we get there :)", 0.523809552192688], ["Awesome ARPG! I bought it for around $20 in 2016! this game is one of the best ARPGs around. Better even than Last Epoch and that is saying alot!", 0.523809552192688], ["Grim Dawn - A Masterpiece of ARPG Brilliance!\n\nGrim Dawn is an absolute gem in the ARPG genre—fast-paced, deep, and incredibly rewarding. The combat feels visceral and satisfying, with tons of build diversity thanks to the dual-class system and epic loot. The dark, gritty atmosphere is immersive, and the world design is packed with secrets and lore.\n\nCompared to Path of Exile 2, Grim Dawn is just so much more engaging. POE2 feels sluggish and overly complicated, with slow combat that drains the fun out of grinding. Grim Dawn, on the other hand, keeps the action intense and progression meaningful without unnecessary bloat.\n\nAnd here’s the funny thing—you don’t even realize how good Grim Dawn is until you try POE2. After slogging through POE2’s clunky pacing and tedious mechanics, you suddenly appreciate Grim Dawn’s smooth combat, rewarding loot system, and player-friendly design. It’s like going back to a perfectly cooked steak after eating plain oatmeal.\n\nIf you want an ARPG that respects your time and delivers constant excitement, Grim Dawn is the way to go!", 0.52173912525177], ["If you LOVE or Want to TRY ARPG then this game is best add in your Library\nGame is not \"THAT Easy\" to Understand,\nGive it a Few Hours.\nFollow a Guide,Plenty of them Available on its Official Website.\nTrust the Developers \nAnd you will fall into World Like Never Before.\n", 0.5172414183616638], ["Hear me out—this is the best ARPG on the market, in my opinion. It hooked me right away with its gloomy environment and dark, twisted story. I even bought the DLCs for it! The game keeps me playing with every class combination. You should definitely try Grim Dawn—it's worth it!", 0.5158711671829224], ["It's like Diablo 2.5 or 2.9, kinda around 3. Was way more engaging than Diablo 4. The environments feel worth exploring, the classes and multi-classing are fun. Only grpe is everything is a little middle of the road. I do like Diablo 3's wittch doctor, and none of the classes here are quite as distinct. overall 7.5/10. Fun and scratches the Diablo 3 itch, but overall, could use some more unique flavor. Bland but satisfying. A tortilla chip bag of a game, with plenty of dip.", 0.514893651008606], ["What an amazing little RPG. I had no idea how hooked i was gonna be. I had little expectations and honestly thought it would just sit in my steam library but i was wrong. The amount of ways to build your character is truly limitless. For the price i highly recommend you give it a shot. Sometime your quest log might seem a little outrageous but your free to go about it as you please and you will randomly find something or kill an elite and notice that you just completed one randomly. All in all I'm having a great time and am glad i gave it a chance.", 0.5078740119934082], ["Unfortunately it’s a no. It is a good game to begin with but has the same pointless grind as other games in in genre.\n\nDecent loot is non existent, 99% of loot is trash.\n\nIt has no endgame other than repetitive pointless fights.", 0.5066774487495422], ["[h1]Grim Dawn – Solid Foundation, But Wears Thin Over Time[/h1]\nI'd put this between thumbs up and thumbs-down. Thumbs-up if its on a deep-sale (which is what I bought it on, so ultimately I'm happy).\n\nGrim Dawn held my interest for a little while, but it quickly became repetitive to the point where it started to feel more like a chore than fun. The gameplay loop didn’t evolve much, which made progression feel a bit monotonous as time went on.\n\nThe early game also felt particularly slow, with a sluggish progression curve that made it harder to stay engaged from the outset.\n\nI didn’t enjoy the camera controls or field of vision either—it felt more restrictive compared to other ARPGs I’ve played. Tree canopies and building facades often obscure visibility to the point where I found myself wrestling with the camera more than focusing on the actual gameplay.\n\nVisually, the game’s graphics feel quite dated, and while functional, they don’t do much to elevate the experience.\n\nI’ll likely finish my current playthrough with my first character and might check out the DLC quests, but I don’t see myself rushing to do another run with a different character.", 0.5032258033752441], ["Excellent game that offers potential to make a vast amount of unique and viable builds.", 0.501069188117981], ["The world design is interesting and there are a ton of possible builds, but they all end up taking forever to get into and you end up spamming the same 2-3 abilities. God awful combat. I really tried but the game just doesn't get any better.", 0.500632107257843]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/219990/header.jpg?t=1726250949", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/219990/capsule_231x87.jpg?t=1726250949", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/219990/capsule_184x69.jpg?t=1726250949"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.grimdawn.com/"}, "developer": "Crate Entertainment", "owners": "10,000,000 .. 20,000,000", "tags": ["Action RPG", "Hack and Slash", "Loot", "Isometric", "Dark Fantasy", "RPG", "Dungeon Crawler", "Singleplayer", "Co-op", "Character Customization", "Dark", "Multiplayer", "Adventure", "Fantasy", "Action", "Atmospheric", "Post-apocalyptic", "Crafting", "Moddable", "Choices Matter"], "languages": ["English", " French", " German", " Spanish - Spain", " Czech", " Japanese", " Russian", " Simplified Chinese", " Portuguese - Brazil", " Italian", " Korean", " Vietnamese", " Polish"], "concurrent_plays": 3438, "number_of_achievements": 185, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "LAN Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG"], "short_description": "Enter an apocalyptic fantasy world where humanity is on the brink of extinction, iron is valued above gold and trust is hard earned. This ARPG features complex character development, hundreds of unique items, crafting and quests with choice &amp; consequence.", "long_description": null}