{"name": "Half-Life 2", "app_id": "220", "platforms": {"windows": true, "mac": false, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£8.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 78210, "negative_reviews": 2113, "reviews": [["Half-Life 2 is a game I've heard endless praises for for years and finally decided to give a go. And after finishing the final episode, I am left baffled wondering why the hell I put it off for so long. Half-Life 2 is a MASTERPIECE, plain and simple. Even more impressive of a game whenever all the minor details of it constantly remind you that it was released in 2004 and still plays/manages to be this good.\n\nThe game features a linear story where you're mostly just shooting through enemies with a variety of guns and weapons in order to get to the next section. On paper and in first reaction it seems standard and repetitive, but the level design, enemy types, and atmosphere constantly evolve in such a cinematic way that it never gets tiring and always feels immersive and challenging and ABOVE ALL: UNIQUE. The level design is OFF THE CHARTS here. Each chapter of the game's world so immersive that it feels like a movie unfolding in your hands. You feel the stakes, you feel the action, you feel the emotions, you feel the terror. Every aspect of the game design is an effort of 10/10 craftsmanship.\n\nAND THIS GAME CAME OUT IN 2004?!?! From the start of the game to its end you feel such a sense of progression that really is movie-esque. I keep referring to it as film-like but there really is no better way to describe it; Half-Life 2 is a proper story.  A unique and bizarre one with an atmosphere that is addicting to taste more of. Though the combat isn't crazily impressive, it's paced perfectly to allow the story all the room it needs to shine, which further immerses you the deeper into the Half-Life rabbit hole you get. And don't even get me started on the brilliant pick up/gravity gun system that allows for an absurd amount of creativity in how you chose to traverse a level or - furthermore - to fight (when guns aren't cutting it for you anymore).\n\nHalf-Life 2 is undeniably one of the greatest games of all time. I've heard it said for years and now I can finally say it myself. Definitely worth the purchase and full play through, and if you like it, you'll join the club of people impatiently waiting for a 3rd.\n\n(ps. It's never coming is it?)", 0.7406500577926636], ["This game is a true masterpiece of the gaming industry. I was 7-8 years old when I first tried it, and since then, I’ve still enjoyed the memories. I’ve played the entire campaign more than 20 times, including both Ep.1 and Ep.2. This game will never grow old, just as it will never be forgotten.\n\nPeople who live in post-Soviet countries will definitely feel this depressive, pale, grey vibe—the understanding of inevitable horror, the senselessness of life, and the absence of a future. I was overwhelmed by all these feelings every time I played Half-Life 2.\n\nThis is my childhood. This is my nostalgia. This is my favorite game.", 0.5979461073875427], ["[h1]Pros:[/h1]\r\n✅ [b]This game is an absolute gem.[/b]\r\n✅ [b]Very good story.[/b]\r\n✅ [b]Addictive gameplay.[/b]\r\n✅ [b]Workshop support.[/b]\r\n✅ [b]Achievements.[/b]", 0.5957446694374084], ["This game is epic and I recommend anyone to try out. The graphics still hold up to this day and the gameplay is immersive. Try it out!!!!", 0.54347825050354], ["It was so much fun completing the game and collecting every single Achievement. \n", 0.523809552192688], ["Absolutely the best game almost likle GTAV, I recommend all Valve games but keep this  masterpice alive!", 0.523809552192688], ["I played this game 10 years ago but never finished it. I recently downloaded it again, and to no surprise, it still holds up today. It's tough as shit in some spots, but just as fantastic as I remember.", 0.523809552192688], ["Rolled credits at 13.5 hours and I must say this game is nothing short of a MASTERPIECE. It's exactly what I needed to play after MONTHS of not being able to bring myself to stick to a game and beat it. As someone who now uses games to decompress and escape from the stresses of adult life it was just what I needed. VALVE created something really special here and I'm ecstatic to try the DLC episodes.", 0.523809552192688], ["revolutionary, still looks and plays great, and is overall a fantastic game, deserving of its many accolades.\r\n\r\npersonally however (UH OH ALERT!!!!!) it's a bit of a letdown when compared to the first game. way stripped down enemy and weapon variety and the last few chapters are a slog to get through. vehicle sections, while nice to soak in the atmosphere, get very stale on the 30th playthrough....but that's just it. this is a 20 year old game you WANT to play 30+ times, which i think is a testament to its design.\r\n\r\nalso the problem with not using cutscenes is that you need to sit through so much nothingness on repeat playthroughs. chapter select somewhat alleviates this.", 0.5226386785507202], ["The ultimate and classic modern fps game.", 0.5199999809265137], ["Good story but just one of the last sections get way too hard suddenly.", 0.5048543810844421], ["I don't think it's quite as good as people say it is. I dare say it's sliiiightly overrated. I personally prefer Half Life 1 to Half Life 2, for a variety of reasons (vastly prefer HL1's setting, gunplay, weapon variety, etc.), but this is still good. It's HL2 for crying out loud, of course it's good.", 0.5], ["The game provides enough supplies. There are a few bad parts, like the strider fights. It has good graphics by modern standards. The story is good. There are many memorable levels like Ravenholm and Nova Prospekt. It doesn't use enemies spam. It could have more weapons.The expansions/episodes are good and they are good and could hold up as standalone games. It's a very good game and it doesn't show that is was made 20 years ago. I give it a perfect score of 10/10.", 0.5], ["no gordon freeman double caked up with oil, other than that its pretty heat", 0.5], ["I'm never quite satisfied whenever I play. I'm inclined to just go on and on. The pace and progression is almost Sisyphean, a never ending loop of shooting with the occasional lore drop. I don't like it.", 0.5], ["a true classic. revolutionary physics and great storyline. DLCs are worth playing if into the lore, but are a bit drawn out in my opinion. Can't wait to play Half Life 3 in like 30 years :steamhappy:", 0.5], ["Well, the other game halved my life and now this game took up the other half. \r\nI now have No-Life :(", 0.5], ["It starts with one, one thing, I don't know why\r\nIt doesn't even matter how hard you try\r\nKeep that in mind, I designed this rhyme to explain in due time\r\nAll I know, time is a valuable thing\r\nWatch it fly by as the pendulum swings\r\nWatch it count down to the end of the day, the clock ticks life away\r\nIt's so unreal, didn't look out below\r\nWatch the time go right out the window\r\nTryna hold on, d-didn't even know\r\nI wasted it all just to watch you go\r\nI kept everything inside and even though I tried, it all fell apart\r\nWhat it meant to me will eventually be a memory of a time when\r\nI tried so hard, and got so far\r\nBut in the end, it doesn't even matter\r\nI had to fall to lose it all\r\nBut in the end, it doesn't even matter\r\nOne thing, I don't know why\r\nIt doesn't even matter how hard you try\r\nKeep that in mind, I designed this rhyme\r\nTo remind myself how I tried so hard\r\nIn spite of the way you were mockin' me\r\nActin' like I was part of your property\r\nRememberin' all the times you fought with me\r\nI'm surprised it got so far\r\nThings aren't the way they were before\r\nYou wouldn't even recognize me anymore\r\nNot that you knew me back then, but it all comes back to me in the end\r\nYou kept everything inside and even though I tried, it all fell apart\r\nWhat it meant to me will eventually be a memory of a time when\r\nI tried so hard, and got so far\r\nBut in the end, it doesn't even matter\r\nI had to fall to lose it all\r\nBut in the end, it doesn't even matter\r\nI've put my trust in you\r\nPushed as far as I can go\r\nFor all this, there's only one thing you should know\r\nI've put my trust in you\r\nPushed as far as I can go\r\nFor all this, there's only one thing you should know\r\nI tried so hard, and got so far\r\nBut in the end, it doesn't even matter\r\nI had to fall to lose it all\r\nBut in the end, it doesn't even matter", 0.5], ["Freaking love this game, super fun and entertaining, especially with mods very cursed", 0.5], ["Worth buying.\nAmazing storytelling.\nGraphics ahead of the time it came out.\nIncludes every expansion: The Episodes and Lost Coast.\nAmazing Combat Selection.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/220/header.jpg?t=1745368545", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/220/951c6aca52bf32d7c95e9f8b3c04fa95e9a735ea/capsule_231x87.jpg?t=1745368545", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/220/951c6aca52bf32d7c95e9f8b3c04fa95e9a735ea/capsule_184x69.jpg?t=1745368545"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.half-life.com/halflife2"}, "developer": "Valve", "owners": "10,000,000 .. 20,000,000", "tags": ["FPS", "Action", "Sci-fi", "Classic", "Singleplayer", "Story Rich", "Shooter", "First-Person", "Adventure", "Dystopian ", "Atmospheric", "Zombies", "Silent Protagonist", "Physics", "Aliens", "Great Soundtrack", "Horror", "Multiplayer", "Puzzle", "Moddable"], "languages": ["English", " French", " German", " Italian", " Korean", " Spanish - Spain", " Russian", " Simplified Chinese", " Traditional Chinese", " Dutch", " Danish", " Finnish", " Japanese", " Norwegian", " Polish", " Portuguese - Portugal", " Swedish", " Thai", " Bulgarian", " Czech", " Greek", " Hungarian", " Portuguese - Brazil", " Romanian", " Spanish - Latin America", " Turkish", " Ukrainian"], "concurrent_plays": 2267, "number_of_achievements": 69, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Captions available", "Steam Workshop", "Steam Cloud", "Includes Source SDK", "Commentary available", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play Together", "Family Sharing", "Steam Timeline"], "genres": ["Action"], "short_description": "Reawakened from stasis in the occupied metropolis of City 17, Gordon Freeman is joined by Alyx Vance as he leads a desperate human resistance. Experience the landmark first-person shooter packed with immersive world-building, boundary-pushing physics, and exhilarating combat.", "long_description": null}