{"name": "DayZ", "app_id": "221100", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£39.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 121099, "negative_reviews": 44417, "reviews": [["10 - 11 years ago I had a friend tell me about this mod that people were playing set in a zombie apocalypse (I know... they're infected..) he thought I should check it out. I gave the game a watch on yt, then played the mod, then standalone a bit and so on. I took a massive break from the game, mostly because, life, career, kids, etc. I don't remember what update it was when I came back to the game, but I believe it was around 1.23. \n\nThere is no real reason why it shouldn't be an abject failure. There is no real story or purpose, It is unfair, it doesn't respect your time, it will not tell you anything. You will die over and over and when you finally get past zombies, starvation, dehydration, sickness, you will be shot in the back, at a well, as a freshie, for literally no reason. But there is nothing else like it.  \n\nI've had more adventures and experienced more unforgettable stories than any other game I have played. It has made me literally sweat, shake, yell and randomly… made me much better at navigation on irl hikes.\n\nIts a lot like hunting, you mostly do nothing, looking at nature for hours and hours and hours, stopping because you thought you heard a sound… then, out of nowhere, for 5 - 10 minutes you experience all emotions, all at once, in rapid succession and you're hooked. \n\nMoral of the story, Its good, Sakhal is good, 1.26 and 1.27 have been phenomenal updates, cheating on official isn't as bad as some people like to make it out to be. The community by and large is very good, the community servers are as well. There are tons of streamers/yt’s making enjoyable content, if you like to watch what you play. And the modding community/map designers are incredible and we are lucky to have them in addition to the Dev team at BI. \n\nget it and get a mic\n", 0.8621371388435364], ["rage cheaters galore , literally makes game unplayable. you cant even bury your stash with out someone using esp to dig it up. my favorite is when people tp your base in the air or put my cars on roofs. youll be minding your business inside a secured building and boom dead. these people love magic bullet", 0.752021849155426], ["Here is the thing... this game is amazing, can't believe it took me this many years to find it. However, their servers are horrible. If want to enjoy an amazing game and then aggravate the crap out of yourself. Try playing this during peak times when the servers will toss you constantly for an unstable connection. Interestingly, they say its your connection even though every single other game that you play, never punts your or blames your connection.", 0.7366015911102295], ["Spawned and beaten to death by bear, then zombies, then another player, then another player. Survived for a while, drank water and caught a disease, died. Spawned, found clean water, found clean food, didnt wash hands, got a disease, dies again. Spawn, found food, water, cave to live in, killed animals, washed hands, handcuffed in my sleep, slowly bled out by cannibal players \"So i'd taste better\", eaten. Love this game 10\\10 would recommend.", 0.6697653532028198], ["good game \n\n-you walk alot\n-you starve alot\n-you find a person who then turns you into a steak\n\nI prob got about 5k hours on console so yeah this game is good", 0.6401732563972473], ["dont know what you were thinking with this battleye thing but boy it works that good it dont let you in the game to evern think about cheating. four times ive downloaded this game reset my pc and updated and deleted everything to get it to work but nope, dont wont to do it, best i got was around 4mins playing time. keeps kicking me. not worth the stress nor the cost. and to top it off it counnts being kicked loading and just in the lobby as game playing time, good job i took screen shots and recordings, im to trading standards,  good luck guys", 0.5625], ["Dayz has been around since 2012 as an Arma 2 mod, and yet it still feels like an unfinished garbage product. \r\n\r\nBad controls, over complicated UI, mediocre graphics, and subpar gameplay. Not worth full price.", 0.5540745258331299], ["Don't even try to play on official servers — only community ones. Officials are flooded with cheaters, and the devs don't care about the anti-cheat system", 0.523809552192688], ["This game is a mess. Searching for a server is horrible. I can't even click on one because it's loading thousands of servers at once so it's always scrolling. I can't sort by type I can only search words. When I search a keyword it will SOMETIMES give a result, but sometimes I have to search several times before the server my friend saw shows up for me. Then when I try to join it the game tells me I don't have the required mods. I started the game with the option for no mods, so the game knows I have no mods, why am I seeing thousands of servers that I can't join? When I finally found a server I can join the game crashed. What a joke. Deleted the game and I'm never supporting these lazy devs on any of their future projects.", 0.523809552192688], ["I came from Arma mods, years ago. It's very similar, but I would always suggest community servers for better gameplay. Running simulator can be way more fun with mods.", 0.523809552192688], ["Brilliant game. Certainly not without its flaws, but ultimately with how big the maps are and how detailed the game is its extremely impressive. The game has fantastic mechanics, the graphics aren't the best but with these types of games you are paying for game play over pretty visuals. I would say to any new player, give it time... You will suck, you will die and you will get lost, however embrace it. It will eventually start to click.", 0.523809552192688], ["Joined PVE server to get grips on the mechanics of the game first.\nFirst 10 minutes I am shot by a another player.\nJoins PVP server, gets chased by zombies all the way to the top of an apartment like building to only get stuck at the top when I closed the door. Only way is to jump off.\nI jump off thinking I will die.\nI fall and break my legs only to pass out moments later.\nI wake up thinking zombie will eat me,\n I try walking to it to put me out of my misery and give em a lunch.\nI pass out from the pain of the broken legs before I can get to him.\nI decide to crawl to the zombie and the zombie beats me up and knocks me out twice before dying.\nI believe he tenderized me before eating.\nThe fact I remember this much from my experience I can tell this game is something special.\nI am glad I finally tried it.", 0.52173912525177], ["great game. needs more vanilla faction servers. too many players play these ultra modded pvp servers with traders and weird mods. But an amazing game", 0.52173912525177], ["Do not buy this game, the players will make you do sus stuff unconsencually. Ive playing video games for 15 years this is the first time i genuinely felt uncomfortable playing a video game. DO NOT BUY THIS GAME", 0.52173912525177], ["You are walking down a street with a plum. You've got a glow stick for some reason. Your world goes black. You wait. \r\nYou wait. \r\n\r\n\r\n\r\n\r\nYou wait. \r\nYou realise its YOU who has to hit ESC and respawn. \r\nYou click respawn. \r\n\r\nYour in a field with an apple. \r\n\r\n10/10\r\n \r\nWould play again. \r\n\r\n", 0.52173912525177], ["Great, game; if you don't think, react, anticipate, plan, adapt, you die!", 0.5205047130584717], ["You can loot for literal hours just to die in less than a second. And that is what makes the game so damn good. \nThe fear of loosing all your progress creates an adrenaline rush like no other game.", 0.5205047130584717], ["fun apocalyptic looter survival game. this game is so good because of how much freedom you have. you can almost do anything in this game. you can make make factions with other people, build bases on houses, team up with people to fight off a bigger problem, meet new people, and just generally have a good time in dayz. though you always have to watch your back for many factors such as sickness, infected, wildlife, and most importantly, players. players are the most dangerous thing in this game as you both have the will to survive. if youre lucky enough you might even be able to befriend them. but never trust anyone unless you are playing with a friend outside of dayz. players can still betray you in this game, causing you to lose everything because that one dude was being friendly to you for an extra pair of hands and eyes to look for loot. overall 10/10 game if you are looking for a survival game that lets you choose how you want to play.", 0.519572913646698], ["If you want to suffer, play DayZ. Best suffering simulator ever made, 10/10 would suffer again <3", 0.519572913646698], ["Perhaps, a game for those who wish to... virtually experience the chaos and \"prepare\", mentally, for a full scale SHTF collapse of our social systems and governing bodies of power. While the zombies seem to be the catalyst for the fall of humanity I do not feel like they are what one should be worried about. They are  hungry and they will eat you. However, it is in multiplayer online that the real enemy is found. It is your neighbor, your friend, your, your mom your woman your children  Family and friends can still leave a man hungry and wanting. So yeah it is a survival zombie game but the other humans you are playing with are more likely to kill you and take your stuff. So say what you want about Zombies; at least they just eat you; no looting or malice beyond their need for sustenance. Good old fashioned A$$ jerky. Love it Great Game!", 0.519572913646698]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/221100/header.jpg?t=1741874734", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/221100/capsule_231x87.jpg?t=1741874734", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/221100/capsule_184x69.jpg?t=1741874734"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.dayz.com"}, "developer": "Bohemia Interactive", "owners": "5,000,000 .. 10,000,000", "tags": ["Survival", "Open World", "Online Co-Op", "Zombies", "Multiplayer", "Post-apocalyptic", "Shooter", "PvP", "Massively Multiplayer", "Action", "FPS", "Horror", "Sandbox", "Co-op", "Adventure", "Survival Horror", "First-Person", "Simulation", "Atmospheric", "Choose Your Own Adventure"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Czech", " Russian", " Simplified Chinese", " Traditional Chinese", " Japanese", " Polish", " Portuguese - Brazil"], "concurrent_plays": 48818, "number_of_achievements": 13, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Steam Workshop", "Steam Cloud", "Valve Anti-Cheat enabled"], "genres": ["Action", "Adventure", "Massively Multiplayer"], "short_description": "How long can you survive a post-apocalyptic world? A land overrun with an infected &quot;zombie&quot; population, where you compete with other survivors for limited resources. Will you team up with strangers and stay strong together? Or play as a lone wolf to avoid betrayal? This is DayZ – this is your story.", "long_description": null}