{"name": "Cry of Fear", "app_id": 223710, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 95, "negative_reviews": 35, "reviews": [["It is good game but u really need to think \nwhat to do in-game \nfor me is perfect i like that low graphic like half-life\nand good is becouse anybody can run it on low-end PCs ;)\ndont need that good pc for that game so yeah for me is GOOd!!", 0.5394737124443054], ["Very good game you can play with your friends and its very simple and scary, my only problem is that when i played with my brother every time we went to the next stage it kicked me because of chat and i didnt use the chat and then i lost my things when i rejoined.\n\nAnyways very good game very good story.", 0.523809552192688], ["This game fucks with your head. An immersive story, never-ending suspense, Cry of Fear has earned its name. As someone that suffers from depression and anxiety, this hit a little close to those nerves, but surprisingly, was very therapuedic. Simon Henrikkson is no hero, no carrier of hope like mainstream or average titles. He's a very flawed human. No magic, no powers, just him. When you play, you aren't just controlling Simon, you ARE Simon. Every action you do (i.e. story choices or certain boss fights) is what you would do in that situation. \n\nWill you run from your guilt? Or will you fight back? The choice is yours.", 0.52173912525177], ["In theme this is a great game and is able to give off a great atmosphere. Clearly inspred from silent hill, which is always good, in fact going deeper into it It, it gets better, but the start of the game isn't great, the sp00ky jumpscare at the start can give a bad impression. The combat? Its really not that good either, its melee combat is preety terrible and its placement of enemies really makes it look confused, it wanting to be a SH esc game, or a dead space game, though for the atmosphere its amazing and I'd suggest trying it out for that.", 0.5660345554351807], ["I think I would play this one again for sure. It's a creepy free Horror Game. But be careful if you are weak against horror. I have to say, it's an awesome Game and it's for free. So I can't make bad Review to that. It's not brilliant, but it's good against other free horror Games on Steam. \nAwesome job. \nCan't wait to wet my trousers very soon. XD", 0.5075627565383911], ["I enjoy this game. Although  do wish it was easier to find the resolution that best plays on one's computer or if it was one resolution works with all computers like with most of the games I have.", 0.5], ["Finished the coop in a run, fun as hell, people may say it is a mediocre story but I was amazed by the fact that it was somewhat immersive for a mod made in golden source engine.\nLooking forward towards the single-player campaign now.", 0.5], ["1. Download Cry of Fear for Fear\n2. Get a couple of friends to play Cry of Fear for fear\n3. End up dying of laughter cause your model jerks off a branch\n10/10 not for spooks, but for hehes", 0.5], ["It was a very unique FPS game I've ever played. Because;\n\n- It doesn't let you carry things more than six or three\n- There are no cheats\n- It gives 5 save slots\n- There is no auto respawning. If you die, game ends. And you may load any saved games manually then\n- Terrifying atmosphere, very creative monsters, limited resources. Horror part comes from jumpscares. But besides that, the environment doesn't make you feel good, maybe the last part. Sunshines, bird singings etc. Worths to give a shot, actually for a free game, it is better than most of the paid games.", 0.5], ["Very unique and very interesting. brings a little something new to the table of horror. definately has its hard work put into it. very detailed. challenging enemy's. Major props to the creating team. This was the first game i played on steam. I highly recomend this to anyone who likes horror games, creatures, or a unique story/game.", 0.4994265139102936], ["An incredibly unique game with tons of fun especially with friends, fortunately its free so why not have a play at it. But be warned you will rage quite often still fun though. I beat it so there's proof that its not impossible :D", 0.5439306497573853], ["This game should be a series. It has the potential of being a \"Triple A\" title. Heart pounding gameplay, Scary monsters at every turn and most of all it seriously messes with your head. This is Silent Hill's indie brother in-law.", 0.5392721891403198], ["This game is amazing. After playing this game i have reached a state of Nivarna. If there is a god, he made this game.this in my opinion is a 6/5 star game. I feel like i have been ridden of a horrible demon. Its up there with the clasics like left for dead and life of black tiger.", 0.4867675006389618], ["i can start up this game now and oh my god is it good it has good weapons easter eggs boss fights and a good story the only down side is there isn't a workshop for reskins and maps anyways i think you should get this game", 0.523809552192688], ["This game is simply amazing. Lots of hours of single-player content, its free, and awesome multiplayer maps. Not to mention the countless single player custom maps and game that comes with it. I cannot recommed this game enough, definitely give it a try. Won't cost you a cent.", 0.5231707692146301], ["So this game said it would give me depression. I mean to be fair after seeing all the shit that was broken in this game and the \"scary atmosphere\" I think I did develop a little bit of depression, depression from the fact that I played this potato of a game.", 0.5208103060722351], ["It is such a good horror game itself, and best of all it's free! I do wish the Source version itself wasn't discontinued, and I would gladly purchase it if it was ever released", 0.5185185670852661], ["\"HELP ME\", \"GET OVER HERE\" \"I FOUND SOMETHING\"\n\nGame is one of the best horror games i have ever played. I used to be afraid of flying beds, perhaps that's why this game made me scared. By the way, dubbing is actually almost better than in Gothic, i had fun xD", 0.5024875402450562], ["so scary! this is the best psychological horror game ive ever played in my life! i havent passed the menu screen yet, (scary menu) but i like it so much!", 0.5], ["awesome game, great with friends if you can get it to work. we used hamachi to do the job for us. 10/10 would shit my pants again", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/223710/header.jpg?t=1643567513", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/223710/capsule_231x87.jpg?t=1643567513", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/223710/capsule_184x69.jpg?t=1643567513"}, "support": {"support_website": null, "support_email": null, "game_website": "https://linktr.ee/andreas.ronnberg"}, "developer": "Team Psykskallar", "owners": "2,000,000 .. 5,000,000", "tags": ["Horror", "Free to Play", "Multiplayer", "Psychological Horror", "Survival Horror", "Co-op", "Atmospheric", "Action", "First-Person", "Psychological", "Indie", "Online Co-Op", "Singleplayer", "FPS", "Adventure", "Zombies", "Shooter", "Survival", "Mod", "Massively Multiplayer"], "languages": ["English", " German", " French", " Spanish - Spain", " Dutch", " Norwegian", " Swedish"], "concurrent_plays": 448, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "Co-op", "Steam Cloud", "Valve Anti-Cheat enabled"], "genres": ["Action", "Adventure", "Indie"], "short_description": "Cry of Fear is a psychological single-player and co-op horror game set in a deserted town filled with horrific creatures and nightmarish delusions. You play as a young man desperately searching for answers in the cold Scandinavian night, finding his way through the city as he slowly descends into madness.", "long_description": null}