{"name": "Euro Truck Simulator 2", "app_id": "227300", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£16.89", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 122310, "negative_reviews": 3037, "reviews": [["I was a trucker from 1960 until 2002, when I had to retire because of my eyesight. I am 84 years old.\nWhen I retired, my only daughter bought me a computer with a copy of the game Mid-town Madness, to keep my occupied during my retirement, and I had played it for 20 years until the computer stopped turning on.\nMy daughter passed away during the Pandemic, but last week my grandson Jason showed me Europe Truck Simulator and gave me his old computer to play it on. Thank you Jason. This game has reminded me not only of the enjoyment I got from Mid-town madness but of times gone by, when I was a trucker. Even though I proudly voted for Brexit, a decision I will never regret, I enjoyed a life driving all over Europe during my golden years. This game has brought back those lovely memories.\nI play this game on my grandsons old computer, his steam account he calls his \"troll alt\", and a steering wheel that I have plugged into my computer. The screen is my telly.", 0.8516287803649902], ["The game is over a decade old. Age aside, it's still been updated by dedicated developers who listen to the community and provide quality updates. For me, I would highly recommend this game if you're out for a casual adventure. Every corner you drive around carries different scenery.", 0.7305805683135986], ["best game ever. at first i thought this was gonna be super boring but no. Idk why but driving and following the rules of the roads just gives me vibes. with radio on and headlights, my 18 year old pc can still handle this game pretty good. i would reccomended this. For me its a 9/10. i just suck at driving trucks lol", 0.598540186882019], ["[h3]---{ Gameplay }---[/h3] \n[i]\t☐ Installed in my heart \t[/i]\n[b]\t☑ Very good\t\t\t[/b]\n[i]\t☐ Good\t\t\t\t[/i]\n[i] \t☐ BoOoOoring\t[/i]\n[i] \t☐ Just don't \t\t\t[/i]\n\n\n[h3]---{ Graphics }---[/h3]\n[i]\t☐ You forget what reality is\t[/i]\n[i]\t☐ Beautiful\t\t\t[/i]\n[i]\t☐ Good\t\t\t\t[/i]\n[b]\t☑ Not bad\t\t\t[/b]\n[i]\t☐ Bad\t\t\t\t[/i]\n[i]\t☐ Don‘t look too long at it\t[/i]\n\n\n[h3]---{ Audio }---[/h3]\n[i]\t☐ Eargasm \t\t\t[/i]\n[b]\t☑ Very good\t- you can turn on the radio from the network\t\t[/b]\n[i]\t☐ Good\t\t\t\t[/i]\n[i]\t☐ Not too bad\t\t\t[/i]\n[i] \t☐ I muted the music\t\t[/i]\n[i]\t☐ I'm now deaf\t\t\t[/i]\n\n\n[h3]---{ Price }---[/h3]\n[i]\t☐ It's free!\t\t\t[/i]\n[i]\t☐ Worth the price\t\t[/i]\n[b]\t☑ If it's on sale\t\t[/b]\n[i]\t☐ You could also just burn your money\t[/i]\n\n\n[h3]---{ Difficulty }---[/h3]\n[i]\t☐ Dark Souls\t\t\t[/i]\n[i]\t☐ Difficult\t\t\t[/i]\n[i]\t☐ Significant brain usage\t[/i]\t\n[b]\t☑ Easy\t\t\t\t[/b]\n\n\n[h3]---{ Game Time }---[/h3]\n[b]\t☑ To infinity and beyond\t[/b]\n[i]\t☐ Long\t\t\t\t[/i]\n[i]\t☐ Average\t\t\t[/i]\n[i]\t☐ Short\t\t\t\t[/i]\n[i]\t☐ End credits? Just started \t[/i]\n\n\n[h3] ---{ Achievements }---[/h3]\n[b]\t☑ Achievements extend the game several times\t- unfortunately dependent on purchased DLC\n[/b]\n[i]\t☐ There's a lot to have fun\t[/i]\n[i]\t☐ There are a few\t\t[/i]\n[i]\t☐ XXX NONE XXX \t\t\t[/i] \n\n\n[h3]---{ ? / 10 }---[/h3]\n[i]\t☐ 1\t\t\t\t[/i]\n[i]\t☐ 2\t\t\t\t[/i]\n[i]\t☐ 3\t\t\t\t[/i]\n[i]\t☐ 4\t\t\t\t[/i]\n[i]\t☐ 5\t\t\t\t[/i]\n[i]\t☐ 6\t\t\t\t[/i]\n[b]\t☑ 7\t\t\t\t[/b]\n[i]\t☐ 8\t\t\t\t[/i]\n[i]\t☐ 9\t\t\t\t[/i]\n[i]\t☐ 10\t\t\t\t[/i]", 0.5833333134651184], ["I recommend this game to everyone. Cities and states are very coolly made, there are a huge number of different trucks and cargoes of varying complexity in the game. The game also has a multiplayer option, which means that you can diversify long trips with fun with your friends.", 0.5652173757553101], ["Great game. Played a few other similar games but this one is the best.\nThe only thing that is a bit annoying are the RTAs as sometimes you can't get by as the police have blocked up the whole road but I guess that just adds to the realism of the game. 4.5 stars recommended 👍", 0.5454545617103577], ["Love this game. Only been playing for about 24 hours but it is so relaxing. Graphics are great and with mods it makes the game even better.", 0.5454545617103577], ["W graphics, controls and gameplay. It was worth the purchase.", 0.523809552192688], ["Really good simulation, trucks feel weighty and is the best feeling driving in a game and given that's the point, it's great. The game is relaxing and now you can play it with friends where it is way way wayyyy less relaxing", 0.523809552192688], ["I feel like i convinced myself i liked this game cause my homies use to say it was wicked. You pay to do the entire job that you could just go get paid for in real life, in a game! Sick if you like that but damn was a bored when i got past the first few cities", 0.5216332077980042], ["mac users be aware! \n\nupdate 1.54 made the game very bad performing for me because of low frames and stuttering\n\ntill the update i played on a mac mini M2, 8GB  with good performance on medium settings. \n\nnow its not playable anymore no matter what graphic settings i choose. \neven on lowest it does not perform on a playable level.\n\ncan not recommend anymore for mac.", 0.507051408290863], ["Pay to play - I don't want to pay just to unlock a part of a map, If you don't want to spend so much money on this game, just don't even play it\r\nThose DLCs that contain only a part of a map should be integrated into the game for free", 0.5045515298843384], ["Enjoyable to play, but updates keep breaking mods and thus save files.", 0.5007342100143433], ["Good game but it's not for everyone. This is my first time playing a simulator game and for what its worth its good for the price so I didn't refund it (I got ets2 & ats for only 100 Philippine pesos). Don't have much issues in the game aside from steering issues with my controller so i couldn't really play the game properly even after changing the settings. The truck just steers to much or too little with my controller.", 0.5007342100143433], ["I spent the last 15 years playing ETS, and I hate this game and it's developers every year more and more.\nThis game has huge problems that are not adressed for years. This is one of the most popular games in the world with SO MUCH potential and it is still popular not becuase of the developers, but despite them. The state of the game in 2025 clearly shows how the developers just don't care about the game and just barely make small changes to make the illusion that it is still beign developed somehow.\n\n-the game is unplayable without mods and with them it is only barely acceptable. \n-the developers should have switched to different engine years ago. The technological limitations of the engine for this type of game is unbearable in modern gaming, I mean look on the wet road when it rains. Even some games from 2007 did it better.\n-Where other companies in other genres like microsoft flight simulator already have procedurally generated environment, SCS still only make new maps extremely slowly manually with original tools in extremly compressed scale and there is no hope that this will change any time in far or near future.\n-The most tragic thing on this game is the AI. Even some games that are developed by a single developer can do 100x better. Just try City Car Driving from 2016. That game had literally no budget and the traffic feels alive, it reacts to you and the roads and traffic rules feel real. When I played that game I realised that SCS are just incompetent when they can't even make the easiest highway driving with traffic feel real after so many years.\n-Crashing physics feels like need for speed II from 1997 even that was more realistic. \n-The sound design from SCS is so terrible in EVERY aspect of the game that when I played for 10 minutes without ZEE mods I had to check if my sound system is not broken. I don't understand why companies that provide licenses for their trucks in the game have no problem with that awful sound of the engines but on the other hand don't want their trucks being physically destructed in the game itself. I think that former is a bigger problem if you want to promote your product through a game. (I love ZEE mods by the way, the most competent sound designer for trucks/cars in the world in my opinion)\n-VR optimazation. The company just does not give a f*ck about VR players. It feels horrible and stutters imensly even on more powerfull GPU's. I heard that VR version of the game would not even exist if one of the devolopers did not have it as side project, dont know if that is true but if yes hats off at least to this guy.\n-Another thing is the lack of multiplayer. I mean i dont really care that much about that but not having real multiplayer in a game like this is just mind blowing in 2025. I tried the moded multiplayer and it was horrible, too few players for such a big map and no AI cars (they are switched off so it would be at least a bit playable but that is not the solution) so it feels completely desolated.\n-SCS dont give a f*ck about modders, I mean PROmods is a must have for anybody these days and lack of cooperation with this comunity or other ones that creates free content for their own game is just stunning. Why the hell do you create new locations in the map where it is already done by someone else on even higher standard then your own ? I will never understand that.\n-Even with so many critical issues unresolved the game developer develops DRIVING SCHOOL module into the game. I thought I would cry when I saw that. I mean the cars in the game don't even know when not to give way, or you can't even set the width of the roads to a realistic setting but you create a driving school module... WTF!\n\nI feel like someone needs to develop a truck game from scratch because SCS software is just hopeless after all those years. The open world driving genre in general is extremely relaxing, profitable and has unlimited potential, but the lack of competition is really frustrating and I beg SCS to up their game (pun intended) or at least put it in hands of someone who cares !", 0.5005673766136169], ["superb game!! every time when i play it, it makes me peaceful, the nature while delivering cargo are amazing!!", 0.5], ["Playing this with a Logitech wheel and pedals feels pretty much like real world experience, I learned turning and so on playing this.", 0.5], ["Great only if you're way too bored and have to do nothing with your worthless life. If planning to buy, just wait a few days for a sale, you'll end getting it for a chocolate.", 0.5], ["This is easily the best trucking sim ever made. It's perfect for those days when you just want to sit back and relax; it's pretty much the perfect podcast game. It should work well with pretty much any modern(ish) PC. Works great with a controller as well, although it's certainly more fun with a wheel. The amount of support it's received over the years from SCS Software is also fantastic. Highly recommend this game to anyone and everyone.", 0.5], ["since the last update the game is very laggy, no matter what setting I use (M1 Macbook air)", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/227300/header.jpg?t=1739871676", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/227300/capsule_231x87.jpg?t=1739871676", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/227300/capsule_184x69.jpg?t=1739871676"}, "support": {"support_website": null, "support_email": null, "game_website": "https://eurotrucksimulator2.com/"}, "developer": "SCS Software", "owners": "10,000,000 .. 20,000,000", "tags": ["Driving", "Transportation", "Simulation", "Open World", "Automobile Sim", "Realistic", "Moddable", "Relaxing", "Exploration", "Economy", "Immersive Sim", "Management", "Atmospheric", "Multiplayer", "Controller", "Family Friendly", "Third Person", "Adventure", "Casual", "Indie"], "languages": ["English", " German", " French", " Italian", " Korean", " Spanish - Spain", " Simplified Chinese", " Russian", " Japanese", " Portuguese - Portugal", " Polish", " Danish", " Dutch", " Finnish", " Norwegian", " Swedish", " Hungarian", " Czech", " Romanian", " Turkish", " Portuguese - Brazil", " Bulgarian", " Greek", " Ukrainian", " Traditional Chinese", " Catalan", " Lithuanian", " Serbian", " Slovak", " Slovenian"], "concurrent_plays": 38977, "number_of_achievements": 98, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "Partial Controller Support", "Steam Cloud", "Includes level editor", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play Together", "Family Sharing"], "genres": ["Indie", "Simulation"], "short_description": "Travel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore, your endurance, skill and speed will all be pushed to their limits.", "long_description": null}