{"name": "Heroes & Generals", "app_id": "227940", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 531, "negative_reviews": 428, "reviews": [["I'm afraid I cannot recommend this game. I tried, I played it for a while and I might continue to play it (in a more limited way), but honestly I think I'm done.\n\nThere are a few technical problems with the game:\nPerformance of the game varies highly between updates. I got anything from sustained 60 fps (with vsync on) at high quality setting to 20-25 on the lowest quality.\nWeird lag issues. Game freezes momentarily on certain occasions, sometimes at crucial events, eg. just before being killed. This is not related to CPU or memory nor GFX card. I doubt it's network related. If it is, it's server side.\n\nThe game also feels a bit unbalanced. If enemy has air superiority, you're doomed. As ground unit there's not a lot you can do. This brings me to the next frustrating fact: you have several characters each has several weapons. You cannot swap [strike]characters or[/strike] weapons during a match. You have to leave the match, leave the squad and then you can swap weapons.\n\n[i]EDIT: apparently you can swap characters if you have more than one of the same class. Thanks to RooZ for bringing this up. I haven't tested it, though. Swapping for a different class is possible if the squad has proper slots[/i]\n\nThere's a lot of griding as many have said. Personally I don't mind griding per se. What  I do mind is having to play for extended amount of time at a severe disadvantage. So either you pay money to upgrade fast or you are basically working for Reto as unpaid cannon fodder for their paying customers. In some games if you're good you may get a fighting chance. But not here. As infantry - yes. As tank crewman, not really. You will be put against superior tanks that you cannot harm with your puny cannon. And when you die you'll have to wait before spawning again and then walk or drive for a while to get to the action. There's a lot of waiting and walking in this game. I guess that makes it a more realistic military simulation. ;)\n\nThe grind is the price of a free game you say. Fair enough. However this game also suffers from the same problems as any other FPS, free or not. The lack of teamplay. When I first started playing H&G I saw how team actions (capturing) actually gives you significantly more score points compared to just killing an enemy. I said \"wonderful, they found a way to make people actually do objectives\". Sadly I was mistaken. Points schmoints. There are still very few people who will actively engage in coordinated cooperative gameplay. You'll get a circle of campers just outside capture zone. People will use resources without considering they're limited and waste them. Tank drivers will not rotate tanks so that support gunners may engage targets. Vehicles with MGs are never parked with their guns facing enemy positions. A fair amount will not follow common sense regarding objective selection and some will even roam aimlessly around the map.\n\nI'd gladly pay money for a game with a nice teamplay-oriented community but this one isn't it.\n\nSo, should you play this free game? After all I said I might continue. If you do, stick to infantry, most vestatile, easiest to survive. Get a car or a motorbike to get from spawn area to the action. If you go for any other class, expect a lot more grinding and consider that your leveling strategy and point investment may be subverted by game designers at any point.", 0.7719026207923889], ["Playing the game leaves some sort of frustration, especially since the updates often downgrade the game. Changes in gameplay cause the game to not be fun anymore. I'm fine with the pay to play system where people who want to spend money can progress quicker. I don't want to spend money on a game that's not finished. However the new system limits the player to do anything. In the past you could grind yourself into different classes. This way you could train your character for the class it will become. With the new system you would need more than 500k credits just to buy a rank 0 recon... It's impossible for the casual player to purchase such character.\n\nFurthermore the game is full of spray and pray type of gameplay, not to forget the constant grenade spamming. Also the amount of hackers is high. 40% of the games you play you will encounter ppl using aimbots, wall hacks and what not. It's a shame, this makes the game quite annoying.\n\nAs for the gameplay, it's nice. It works rather well with resources etc. Once you start to get the hang of it, it's a nice game to play. It's a shame that the devs ruin it with their updates, and won't listen to the people playing this game. Probably explains the reviews.\n\nAs for new players: It's free, so try it out. Don't expect to much from it and don't get used to the current system of things, it can change anytime.", 0.7653562426567078], ["So, I could rant for 30 hours straight on what I think this game could have been, has been, and could become, but it's pointless. I've played many games, especially world war two games, and this used to hold a special place in my heart. I loved to play tactically with my friends, it was some of the best time I ever had. Combining the aspects of planes, tanks, infantry, and actual strategy was perfect. But early on it always had parts missing, things I felt were necessary. I gave it time, hoping it would come around, and then the updates came.\nWhere to start. Bias? Bias. Enough said. Oh, but the squad update was cool! Then came... The rest. They made it harder for new players, then easier, then harder, then easier. But it still treated the new players terribly. Now they've added new planes, and they aren't anything to be desired. They're just another aspect to a still dying game. The game is losing it's aspect of being unique. There is not enough base infantry playing anymore to mean anything, so most of the games play out like some sort of murder spree between planes, tanks, and snipers.\nRecently I came back. I left after one game. It's pure murder, sometimes worse than what I've heard out of Call of Duty. I can't say much more. I just don't recommend it.", 0.7591308951377869], ["UPDATE: Continued play of the game has changed my impressions.  Reto has continued to ignore cries for proper resolutions to bugs, completely broken the audio system for the game, and is now actively encouraging hackers so long as they are willing to pay for gold within the game.  Give the game a pass and go to something from a AAA developer.  At this point, they care more than Reto does.\n\nTL;DR: While there's a lot of bad to the game, it's still an entertaining experience and worth checking out.\n\nI've been playing Heroes & Generals since the Quesada update (circa July 2014).  I have over 2000 Steam hours on the game, and plenty more using the browser version.  I've also streamed this game for well over a year.  After all that time, I can honestly say, this is the game that you will love to hate.  It is not a bad game, but there's so many things that have changed over the years that have brought down the quality while increasing the cash-grab aspect that I feel people need to take a good, hard look at whether they want to invest the time (and money) into this game or not.\n\nThere are so many things mismanaged with this game, and far too many issues with modeling.  Reto Moto utilizes its own engine, rather than an off-the-shelf engine with more capabilities.  Consequently, you will see a noticeable drop in FPS compared to other games with similar requirements.  The engine has not receiving an update in over 2 years.  We only recently received significant updates to the maps, and those updates consisted of questionable spawn locations, more rehashes of the same tired old buildings, and some color differences.  Destructible terrain is non-existent, and you'll find that glass is bullet-proof for the first shot in addition to improper edge modeling of buildings and objects.\n\nEverything in this game can be ground out, but the cost of doing such has steadily increased over the years.  Most recently, the latest patch decreased the credits earned per hour while slightly increasing the cost of some highly-purchased items.  This, along with a slight increase in the cost of gold, has pushed the game to more real-money purchase of gold.  There is no doubt that Reto Moto is doing this to reinforce its dwindling coffers.  Make no mistake, Reto Moto is an indie studio with a small budget trying to pull off a AAA gaming experience.  Therefore, the cash shop is their sole source of income to keep their doors open.  The more use there is, the better for them.\n\nMy last bit of bad review is centered on the development team, and especially the game director (RedBjarne). Priorities for this team are sorely mismanaged.  I say this as a developer myself, and shudder every time I see a decision to go after cash-grab opportunities (such as adding new tanks/guns) instead of fixing long-standing bugs (double-shot glitch has existed for 2 years with no resolution).  I personally feel that RedBjarne is harming the development of the game rather than helping, and is known for his egotistical attitude towards others.\n\nDespite all of the bad, I still recommend this game.  Why?  Frankly, there's only 2 WWII infantry-based MMOs still in existence, and this one has the larger community.  I've met some tremendous people through this game, and the Twitch-streaming community is the most tight-knit group I've seen.  We all support each other, and you'll never lack for an entertaining long-time player within that community.  If you have several years (or deep pockets), the higher-end weapons and tanks are awesome, and you'll definitely have a lot of fun.  Cheating, despite what most people think, is still relatively minor compared to the AAA titles out there (it does exist, though).  If you find a good group to work with, you'll be amazed by how different the game is versus just running solo.\n\nI'd highly recommend that you check the game out and hop in a few streams.  You'll find plenty of us (myself included) that are willing to show new players the ropes.  If you stick around, maybe you'll be in this place 2 years from now talking about the game you love to hate.", 0.6273880004882812], ["It's an alright game at times, but it's beyond grindy. The disscussion forums are a rather toxic place to be, too.\n\nMaybe if those things change I'll recommend it but for now I'd say wait for It to either get better or ignore it.", 0.6503379940986633], ["This might be the only game, where the people with the lowest skill and the highest pings get all the cool stuff and win all the battles. You can literally see 12 of your bullets hit the enemy, while 2 are registered. This is how great the netcode is.", 0.6412790417671204], ["Heroes & Generals would be a nice game if only the devs were thinking while developing new updates. \n\nAfter all this years there are still the same 5 (FIVE) maps for the assault mode (main mode), and two of them are the same airport. They're pushing out new vehicles when there are no variety of battlegrounds. I mean, with THAT engine (old) and THAT level of detail (low) it's pretty easy to add 2-3 more maps instead of a useless boat-tank when there isn't even enough water to make it useful. I swear, you can even rycicle them or use fractions of the 5 maps to add Smirmish smaller maps (like a Church based map). Just do something.\n\nThere is a huge conquerable map with all the cities from Europe and yeah, on every city spot there are those 5 damn maps. \n\nGoing back to play World War II Online: Battlegrounds would be a wiser choice.", 0.607585072517395], ["This game has so much going for it.  The gameplay is fairly good with decent integration of infantry air and vehicular combat.  The premise is great and it's well executed. \n\nThe problem is the grind model.  It's one of the worst offending p2w games i know.  Some might say it's pay to get there faster, but that's a known model from several other games and this just doesn't measure up to that.  The grinds are exceptionally long, and weapon customization can take a lot of experience to upgrade all the parts and literally become better than the next guy.  You can spend weeks or months doing that, or you can just buy better weaponry than everyone else has.   And people do.  It makes it so that f2p people cannot compete.  You can run around and die a lot.  If you're good you might be able to make a difference, but on a bell curve most people are intermediates at best.  Beginners and general intermediate players suffer when other players can just have better stuff altogether.  F2P gamers shouldn't necessarily be catered, but if you want to keep them around - and any F2P game does - then you'd better make it worth their while to stay.  Sadly, heroes and generals does not.\n\nI loved playing this game, and got far enough in a couple of nations to have a few toys to play with.  But getting up into higher echelons of gear and abilites takes forever, and getting there means encountering people who just  steamroll you with significantly better equipment.  It's not fun.  I uninstalled, and while i miss the game - it's fun when it's balanced - i won't be coming back.", 0.6056811213493347], ["Rewriting the old review, just so it makes more sense. \nThis game is bad, for a number of reasons, firstly the gameplay is wanky, you don't feel human playing it you feel like a space robot, thats the best way I can describe it, the grind is far too terrible for what it offers, and its pay to win, I'll elaborate.\n\nTo start, the wanky gameplay, best way I can describe it is, you will feel like a robot in outer space in some World War 2 setting. In general movement is sluggish, jumping causes you to do a moon jump, which during this you cannot fire, which leads on to the next point, the guns follow a power creep, if you have a Grease gun and a Thompson, well using the Grease gun is a mistake, which the Grease gun you get around the start of your playthrough, the Thompson you obtain later on.\n\nThen, grinding isn't the best but it ain't the worse, and can lead to a very successful feeling of accomplishment, this game turns that around on its ass. Whenever you grind and buy something you feel like you wasted your time, because you only have the gun partially, no gun in the game can do anything or add up to any other, without the weapon mods, which is also way more expensive than it should be, and you can just buy everything instantaneously with real money so people who don't mind dumping dough on the game are well going to encountered and it is annoying to be killed by one of the stronger guns in the game when you still have a half modified Grease gun. Ontop of all that the German faction is overpowered compared to the others so everything you have will be outscaled, the US has better LMG's, light planes, and tank destroyers, the Russians, have better smg's and tank cannons, aswell as their aircraft being more maneuravable, the Germans faction literally has everything else, everything they have is actually good and still comparable to these, meaning that even if you're decent, a half decent player will kill you anyways because his faction gives him better items that he dumps dough on.\n\nI've already basically went over how its pay to win, you don't technically have to pay for the items but if you don't you can go weeks saving and staying downgraded, making the game such a chore, because you rise through the game as you play, and as you progress you get matched with people way better than you, because its matchmaking is shit.\n\nThe whole game is just an addicitive chore that eventually you just stop playing because you've had enough of its crap.", 0.6034157276153564], ["I ve been playing this game for about 2 years and i have mixed feelings about it. It’s free, the FPS-RTS combination makes it very interesting and addictive because each battle is meaningful and has an impact on the war, it is fun to play with friends but at the same time it has some issues that haven’t been fixed yet that are really annoying.\n\nFor the new players this game is just brutal. You choose 1 soldier for 1 of the 3 factions and you get thrown into an encounter battle. ‘Capture and hold the objective’ glhf. No tutorial, no training session to give you the basic idea of the game mechanics and gunplay. There used to be a quick training mission, where you could at least shoot some of the guns, bazooka, scoped rifle and Anti-Air but it’s now removed. Anyways, after a few encounters, 2 skirmishes, 1 town, 1 factory and 1 airfield battle (matchmaker keeps throwing you back to the encounter map for some reason) you get player rank VII which means you will be matched against any player from now on, either it’s another newbie or a veteran (experienced player). So for a while (since the grind is quite a lot) you ll probably find yourself in a disadvantage having to fight against better geared players, tanks and planes. A few encounter battles later you can join the war, extra xp/ribbon boost + underdog bonus, ‘yes please!’. Except now you go against hardcore players/clans and uneven resources. And that’s when most new players give up and go spam forums with ‘everyone is cheating-op guns/tanks/planes’ threads. My point is, I think the new players are not given enough time to learn the game before they reach the endgame (war battles) and they end up leaving when they get stomped by vets over and over again.\nOf course you can pay real money to unlock stuff and support the developers, like any other free to play game. Does this make it pay to win? No, you can get everything with in game credits. Buying veteran membership (recommended, if you decide to spend money on the game) or straight up buying unlocks just speeds up the grind.\n\nNow for the veteran players I don’t really know what to say. We ve all seen how the game is going downhill one update after the other :/  \nSquad system massively limited the usage of special classes, so if you don’t have auxiliary seat in your squad you can’t use any of them, or you end up in some low rank dude’s squad who can’t even give orders\nThere is no balance in the matchmaking system. More often than not you get in some battles with too many tanks and planes and recons vs infantry and paratroopers, how is this even fun?...\nGunplay got messed up all together in one of the updates with the cone fire changes. Now gun balancing is done by nerfing to the ground whichever gun is performing well at the time\nThe sound bug of the semi-auto and bolt-action rifles still exists and sometimes happens to full auto guns as well lately which for me it is the most annoying bug because I mainly use sound to spot enemies\nThe RTS part is completely broken and ignored. The usual suspects start battles with alt accounts or autoresolve their way to victory although they have favorable attack-defense lines in most battles\nThe community is asking for new maps, instead we get some rework on the old maps, which some were good (mountain town, factory, airfield) and some were just performance killers (town and skirmishes, too much jungle -.- ). Also the cap points went from being tiny and 1 grenade could clear the point to being extremely big and really hard to defend (those roof cap zones are ridiculous…). \n\nMeanwhile in reto-moto HQ everything is working as intended!\nDon’t get me wrong, the devs are doing work, and they bring regular updates to the game, be that guns, cars, tanks, planes etc, which are nice but they are not good enough for me personally to keep playing the game and having fun while those core issues I mentioned above exist.\nI m looking forward to the new renderer update, hope it comes with a few improvements, but at the current state of the game i wouldn't recommend it.\n\nTL;DR: if you are new to the game don’t go in with high expectations, there is a lot of grind and it will be tough until you start getting better equipment. And let’s hope reto will start fixing some stuff and make HnG great again.", 0.5904660224914551], ["This game use to be a fun game to play but other factions other than the US are under the mercy of nerf, nerf, nerf... Back in Beta it use to be US vs Germany with Germany wining most of the wars. Shortly after players starting to cry to the game Dev's Reto on the fourms that US is so hard to play... Which slowly caused Reto to nerf the german weapons with nerf after nerf with a few ninja nerfs here and there. While still in Beta the Devs released another faction to play with the hope to bring some life back in H&G with a few new weapons and tanks which was healthy for H&G. They gave the US a Johnson LMG and then gave the Germans a STG44 which brought the germans to fair fighting grounds with the US yet again  but after more US faction cry babies on Reto forum, Germany's weapons yet get another nerf, the brand new STG44 received a nerf along with more nerfs for its other weapons. Germany at this point is almost not playable and veteran players are saying hell with this game as it seems that Reto is completly biased toward the US that is why I do not recommend this game to my fellow gamers here on Steam here is the evidence as where Reto favors the US faction and basically nerfs the Germans until we stop playing... Take a look at this Damage/ Equipment Slots compared to what the Germans have to work with every single US faction weapon over powers German's and Soviet's. I just recently found out the Devs play their own game which is common but to be biased to their own faction is kind of low in my own opinion. But take a look at this link : http://heroesandgenerals.gamepedia.com/Weapons\n\nExamples:\nUS Starter weapon:          \"M1 Garand\" 49 Dmg/ 240 RoF / 8 round clip  *** High rate of fire and good dmg ***\nGerman Starter weapon: \"Gewehr 43\" 47 Dmg/ 225 RoF / 10 round clip *** Lower rate of fire and low dmg ***\nSoviet Started weapon:   \"SVT-40\"      47 Dmg / 257 RoF / 10 round clip *** High rate of fire and low dmg ***\n\nYou may be like wow 2 pts of dmg really? But in this game every point of  dmg really counts!", 0.5652173757553101], ["I wouldn't recommed this game to anyone. Grinded for a day and a half for the xp and money to be able to buy the recon class and sniper scope to be told that I can not play with a friend who hasn't got the recon class or any other class apart from the infantry soldier. The fact that the game is still grainy while playing in 1080p with maxed settings without bloom effects and because of that unable too see a guy who is 50m away from me moving in a bush is completely stupid. I wouldn't suggest this game to anyone. This was the worst experience from a game that I have ever had and I've played some pretty bad games.", 0.5507147908210754], ["Having enough fun with the game that I'd recommend.  Provided that you have good internet service/connection and seems to require faster processor or video card than expected for a game with such relatively simple graphics.  In that regard, it's a bit disappointing.  This happens after you start playing more involved battles with more \"live\" players.  So, in the beginning the game runs fine with low numbers of players but more AIs.  Game has nice reward features as you progress your soldiers.", 0.5], ["It is fun.. only with friends. The gameplay is taking a horrible direction, every advertisement/promotional video has goofy **** going on and it's nowhere near the 'Ultimate WW2 Shooter' as they call it. Walking and running is stuttering 24/7 as if it's in alpha, people cannot shoulder their rifles without arthritis, and there are only 2 or 3 people communicating per team out of a full game.\n\nThe developers aren't taking this serious at all, and the gameplay is complete dog****. Flying tanks, flying jeeps, planes that crash into the ground and take off again are all good for promotions to them. I can't believe I spent almost 350 hours in this game, literally a waste of my time.\n\nI thought it would be a fun game, but no, grind grind grind grind grind grind grind grind grind grind.\n\nI wouldn't even dare to try it if I were you, not worth it at all.", 0.548872172832489], ["Went from amazing to playable to... well there's no words to describe how BAD this game is. Optimization doesn't exist, laggy as hell and low fps. Physics are broken. Game hud ugly, both in menu and game. So to sum it up:\nGameplay - BAD\nOptimization - BAD\nGraphics - BAD\nPhysics - BAD\nAnimations - BAD\nSmoothness and clearness - BAD\n-1000/10 would never play it again.", 0.545945942401886], ["I’ve been playing shooters since 1995 and own all major titles – BF series, Planetside 2, Titanfall etc., but none of them held me for so long. I’m with H&G almost since beta release and still very excited about it.\nH&G is a hardcore and intelligent shooter with deep customization options and realistic weapon balance – aiming and killing is much more difficult comparing to BF for example. Since you cannot “shoot everyone in the head while running” or “camp with a sniper rifle” (recon class is not OP for many reasons) the gameplay requires a cooperation and strategic approach.\nThe game has its unique style and atmosphere; you feel like watching old WWII movies. You can spend hundreds of hours in game and it will be still SO much to learn, so many builds and loadouts to experiment with. You can become a deadly CQC infantry or a machinegun defense specialist, fighter pilot or a tank driver.\nAs for the negative aspects, there are certainly here. H&G has NO FACTION BALANCE. The most skillful German faction is being continuously nerfed, their weapon is seriously underpowered now, I won’t wonder if once the developers decide to put off one wheel from their cars to make Germans win even harder.\nSome maps (Mountain town, for example) have design flaws which leads to spawn raping, and the worst thing that devs (Reto-moto) ignore most of the reasoned suggestions on their forums.\nUnfair weapon nerfes, increased repair and weapon prices, bad map redesign and poor faction balance are turning off veteran players. New ones could be overwhelmed by game’s deepness and difficulty but nevertheless I would strongly recommend it to every wargame lover.", 0.544513463973999], ["personally i quite enjoy this game. It is a free game, so naturally everything is extra expensive....but i think if you can understand that (with a little patience thrown in) you can appreciate the fact that Reto made this game avaliable, free of charge. I think there are better shooters in this world, but i am impressed with what Reto has been able to do with what they have....\n\nIt can become addicting and you dont even know why you like it....(kinda like minecraft lol).\n\ni would recommend it to anyone who enjoys WWII history, and doesnt mind grind.....however if you're not that patient then i would recommed you find something else.", 0.54356849193573], ["It was a nice game back in a day. Now with last patch(es) they totally ruined many things,specially UI.\n\nBefore: You could see list of active war battles\nNow: You can't, You need to roam around generals' map to manually check every single battle if there are people\n\nBefore:100 players per faction at peak times,everyone active on chat willing to help etc.\nNow: over 1000 players per faction,not at peak times, noone helps out on chat\n\nBefore: Everything about assault teams was very clear and straight forward\nNow: Game shows I got 0/1 active assault teams, but doesn't let me activate my assault teams on 2 characters,while on third character I easily ticket assault team and got it to 1/1 O.o\n\nBefore: You could see where you can spawn on map ingame\nNow: You can't, You have to click every spot to double check can You actually spawn there or not...\n\nBefore: You could change your squad/character in combat\nNow: You can't", 0.5419847369194031], ["I used to love this game, back in the day... back when you could kill a man at 600m with a single shot of your bolt action mauser. now-a-days a guys gotta empty his entire magazine into a man to take him down. \n\nBack in the day, when we would charge into the enemy without a thought of dying\n\nNow I'm sitting in a dark corner, cradling myself, fearing death", 0.5397036075592041], ["This game had so much potential. I used to love this game back when it was optimized decently well and there were little to no problems. Unfortunatly the devs decided it best to kill this game and making it harder and harder to deal with. I spent hours trying to fix problems just to make it playable.\nI spent hours fixing it's black screen glitch then after that i spent another few hours fixing it's resolution bar missing glitch then after that I spent hours fixing the login glitch. \nProblem after problem with this game and it's completely not worth the effort and I have an awesome computer which can handle basically all games, except for this shitty free to play game apparently. \nI DO NOT RECOMMEND THIS GAME, it's population is full of assholes and are useless and the devs don't give a shit about fixing bugs.", 0.5396308302879333]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/227940/header.jpg?t=1685049235", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/227940/capsule_231x87.jpg?t=1685049235", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/227940/capsule_184x69.jpg?t=1685049235"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.heroesandgenerals.com/"}, "developer": "TLM Partners", "owners": "10,000,000 .. 20,000,000", "tags": ["Free to Play", "World War II", "FPS", "Multiplayer", "War", "Shooter", "Action", "First-Person", "Massively Multiplayer", "Strategy", "Tactical", "Co-op", "Historical", "Open World", "Simulation", "Atmospheric", "Adventure", "Indie", "Early Access", "RTS"], "languages": ["English", " French", " German", " Spanish - Spain", " Czech", " Polish", " Russian", " Turkish", " Portuguese - Brazil", " Simplified Chinese", " Korean", " Japanese"], "concurrent_plays": 1, "number_of_achievements": null, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "In-App Purchases", "Stats", "Family Sharing"], "genres": ["Action", "Free To Play", "Indie", "Massively Multiplayer", "Strategy"], "short_description": "Shoot, blow sh!t up, fly or bark orders in the ultimate Free-to-Play, large scale, multiplayer, shooter experience. Thousands of players in multiple battles fighting one massive war of nations. The first to capture 15 cities takes the glory.", "long_description": null}