{"name": "Black Myth: Wukong", "app_id": "2358720", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 57591, "negative_reviews": 3551, "reviews": [["What a fun game!  I'm not really a gamer that should have tried this game.  My first game ever played was Hogwarts Legacy which was not only fun but was challenging to a new gamer.  But, Black Myth Wukong was a major step up and not a game for the casual player.  It will challenge you at every stage,  There are no easy levels and you will be required to conquer each level to move forward. But, oh! what a sense of  accomplishment when you beat the boss after 20 attempts.    You will find this game frustrating and fun at the same time with solid replay value.  I can't recommend this game any higher.", 0.7542126774787903], ["If you like Dark Souls/Elden Ring, you'll like this game - no doubt.\n\nI'd say it's Dark Souls' Chinese cousin, maybe even half-brother.", 0.7121127247810364], ["I am not the guy who wants to replay any game in New Game Plus mode. But this game changed my mind. A challenging journey it was, a tough one. The battles I fought were not the clean ones and I struggled in the first journey. But after completing the game, I am feeling like firing this game up on my handheld again and beating the crap out of the hard bosses who destroyed me. Let the challenge begin, AGAIN!\n\nP.S. Really loved the crap out of the GAME :)", 0.630948543548584], ["I have played every 'hit' game in the last 10 years. This one is easily top 3 for me, if not the best. There is nothing wrong about this game. This is truly the perfect game. Progression, gameplay, art direction, music, gearing, skills, story are all 10/10. Worth every penny, a must-play game. There is one small 'problem' that I need to say though. You can't turn off vignette, SSR and bloom. I like to play games with a plain look and the game can feel a bit oversharpened at the start. But the game is a literal art piece and looks beautiful so the lacking of those options aren't a big deal but still I wish I had the freedom to turn them off. Also I have played all FromSoft titles and this game is not as hard as those but not an easy game. The difficulty was perfect for a game like this. I can keep prasing this game forever but I will stop now.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3460182991", 0.5833333134651184], ["Graphics and Sound\nThe game looks absolutely beautiful. The visuals are top-notch, and the music and sound effects are just as impressive. Everything feels polished and high-quality in that department.\n\nContent\nThere’s a lot to do here. The game offers 6 fairly long chapters, each packed with secrets and unique bosses. It definitely gives you a good amount of content for the price.\n\nExploration\nExploration is where things start to fall short. The world feels very limited—there are invisible walls everywhere, which makes it feel like you're being pushed down a single path instead of really discovering anything. There's not much rewarding to find either, except for some low-quality herbs and places to meditate.\nThat said, each chapter does hide a big secret area, which is a nice surprise. But finding these areas isn’t always intuitive—you might miss them completely if playing blind without searching the internet.\n\nCombat\nCombat is the weakest part of the game. There’s no button queuing, so if you press an attack button before your current animation finishes, the input gets ignored. This makes fights feel clunky and unresponsive.\n\nEnemy attacks often have strong tracking, while your own attacks don’t. That means enemies can easily hit you, but if they move while you’re swinging, your attacks often miss. It makes combat feel more about luck than skill sometimes.\n\nFighting normal enemies isn’t very exciting either—just charging a heavy attack before a fight is usually enough to take them out before they even get a hit in.\n\nBosses\nBoss design is hit-or-miss. While they’re visually unique and creative, a lot of them are frustrating for the wrong reasons. Many main bosses have mechanics that feel cheap, like draining your stamina, messing with the camera, or blocking your vision. Instead of feeling like a fun challenge, these moments just come off as annoying.\n\nOverall Thoughts\nThe game isn’t bad, but it’s definitely overrated and overhyped. With better combat and exploration, it could’ve been something really special. I just expected more. 7/10", 0.564152181148529], ["One very important thing about this game that I think you don't see when you watch videos on it is that the combat is very scripted and doesn't flow like other souls-like games. In other games of this genre, the combat has a very distinct flow that I personally just didn't get with this game. It felt like the only thing going for it in terms of combat was flashiness. Another thing I didn't enjoy was the movement. God, the movement in this game felt so restrictive, which is very prominent in most souls-like games, but the marketing for this game made it seem more like Sekiro: Shadows Die Twice when in reality you have much less freedom. One thing this game does have going for it is it's graphics. God this game is beautiful. While the combat isn't too good, the look of this game is amazing. The opening fight in this game felt so climactic and made me think this game was something special. Overall, if you've read this and seen all the trailers and still felt like this game is right for you, go buy it. It's obviously had so much work put into it by so many talented people, but I just felt like there were some things they weren't telling you", 0.5416666865348816], ["Black Myth: Wukong is an extraordinary achievement of China's video game industry, blending the legendary tale of one of the great Chinese novels and arguably the most popular literary work in East Asia, Journey to the West, with breathtaking gameplay. While it offers a challenging experience, it remains accessible, striking a perfect balance between difficulty and enjoyment.\r\n\r\nHowever, what truly sets it apart is its storytelling—an exceptionally well-crafted narrative that rivals even the depth of a novel. Few games today reach such literary heights, making Black Myth: Wukong not just a great game, but a landmark in video game storytelling.\r\n\r\nTo fully appreciate the depth of its story, I highly recommend exploring Journey to the West, the classic masterpiece that serves as its foundation. Understanding the novel and rich cultural heritage of China that shaped it enriches the experience, unveiling the true brilliance behind Black Myth: Wukong’s narrative.", 0.5389221906661987], ["Wukong is an absolute masterpiece in the making. From the breathtaking visuals and immersive sound design to the challenging yet rewarding gameplay, every aspect of this game shines. The developers have clearly poured their hearts and souls into crafting a truly unique and unforgettable experience.", 0.53548663854599], ["It captures the essence of a souls-like while being a refresh with story line and great graphics. 10/10 game of the year material. Insta buy if you have the money", 0.5319148898124695], ["I came into this game with low expectations as I previously played Dark Souls didn't enjoy it all. I was hesitant to try a souls-like game again but I decided to give it a try.\n\nI was glad this game blew away my expectations, as it wasn't as impossible as it was made out to be. The game was still a challenge but it was rewarding to overcome it. \n\nGame Science great job but please fix the issue with the PC port, I had constant issues with audio lag and desyncing in cutscenes and certain parts of the game(looks like others have had this issue but looks like there is no resolution for it).", 0.523809552192688], ["Marvelous game. The story is interesting to follow, all the cut scenes are beautifully animated, the soundtrack is incredible and authentic. The graphic is great as well, and the worlds are rich and saturated. \nSouls-like combat system, with variable skills and combinations, is perfect. Challenging but doable. The number of bosses is quite impressive. You face them regularly and most of them are unique. The final boss is especially good, I spent several hours to beat it, and the victory felt amazing.\nOverall, 9.5/10, highly recommended. Optimization is good enough, but could be slightly better.", 0.523809552192688], ["What can i say that has not already been said. This is the single best overall game i have ever played. The storyline, the consistency, the fighting mechanics, the beautiful scenery.. The levels of mastery.. the types of fighting styles sometimes switched mid fight for advantages.. i have never beat a game more than twice and not be bored.. this is the bar for rpg fighting/story simulations. Amazing.", 0.523809552192688], ["Amazing game, I think... I will recommend it because of how badly I want to play it... But when I originally bought it I had a 10 year old PC and I couldn't run it on that old holding on by a thread PC. So I built the most Budget PC I could... After returning the game, because I needed every dollar I could get to get my new PC. I ended up building this new PC about a month ago, and still can't afford this game again... I can't wait until I Can Play It Finally though... I AM READY... Just not able yet. But hey devs, hook me up, I gave a thumbs up, lol.", 0.523809552192688], ["It’s tough, but fair. If you’ve got that Soulsborne itch, this will scratch it hard. Bosses are brutal, mobs don’t pull punches, and yes—you will die. A lot. But every victory feels earned, not handed to you.", 0.523809552192688], ["After 72 hours i can say it was easily one of the harder games i have played.  The frustration and anger turned into genuine learning with each victory.  \"get good\" is seriously the only advice i can give when fighting these bosses as the guides online vary with different styles of gaming.  Pick one that is most comfortable to you and perfect it.  There are bosses that will want you to hit your head against a wall (ESPECIALLY THE ENDING) but that sigh of relief after each grueling triumph was always worth it.  Overall, the game is a beautiful rendition of Journey to the West with breathtaking artwork and character designs.  The story is easy enough to get a basic understanding of what is happening (anything deeper, i recommend youtubing a lore video) and forces you to learn patience quickly.  There are a few game mechanics that are quite frustrating like 15 hit combos by the enemy and endless dodging making a fight longer than it should be.  Or some maps require excessive walking with no interaction but to see the sights while others are jam packed and sometimes overwhelming/confusing navigating the landscape.  This is of course subjective with my sense of direction haha.  At the end of the game, you are encouraged to play through again so replayability is high and rewarding as you work for the best gear in the game.  I would recommend this to any Dark Souls enthusiasts/players along with those experienced in intense gameplay.  This gem of a game is worth it!", 0.523809552192688], ["这个确实不是游戏，是每个从小对西游记耳濡目染的中国人心里那个遥远又切近的浪漫长梦。 \n悟空是中国千年以来封建伦理，集体主义和阶级划分制度下人性本身孕育的对自由的向往和反抗的化身。\n\n这个游戏就像大话西游，玩的不是故事，而是我们想要的，经历的，开心的，痛苦的，追求的，不得的，等等的化身。一千个人的黑神话，可能包含的是一千个不同的人生里，亿万个不同的化身。好的故事就像抛砖，引出来的，是每个读者自己的一块块内心的玉。\n\n起于文化渊源，承于形式发展，转于剧情跌宕，合于真情流转，如果这不是第九艺术，那还有什么算是呢？", 0.523809552192688], ["The perfect game in the world but some bosses are mad it made me crazy.Buy this game trust me you will not disappoint.", 0.523809552192688], ["This game is very nice, I just bought the game and enjoying it. very challenging but enjoyable to play, i hope there will be a sequel to this game..", 0.523809552192688], ["Honestly. this is one of the best games ever, without exaggeration! Altough my PC sounded at some points like it would lift up in the air and fly away, this game sits on the throne alongside the all-time greats of the genre, like Elden Ring, Dark Souls 1–3, Bloodborne and Lies of P. What a ride!", 0.5233333110809326], ["Maybe it's because I've watched a ton of anime and movies featuring/referencing Sun Wukong, or because Monkey King has always been my favorite character in Dota 2, but there's something about the Monkey King's story that has always drawn me in—even if I didn't know all the details. Black Myth: Wukong felt like the perfect way to dive deeper into that lore.\r\n\r\nThe combat? Incredibly smooth and satisfying. Every swing of the staff, every dodge, every combo—it all just clicks. I especially loved the Thrust Stance. Its reach and precision made it feel like I was dancing around enemies, striking with calculated jabs. The Tactical Retreat into Forceful Thrust combo became my go-to move, allowing me to evade and counterattack seamlessly. Summoning clones to distract foes or vanishing into mist to reposition was just pure fun and kept the gameplay fresh and dynamic.\r\n\r\nEven after thoroughly exploring the game and squeezing out every bit of excitement from my playthrough, I found myself seriously considering NG+—which is a very rare occurrence for me—just to experience the combat all over again. This time, I'm eager to experiment with other stances and spells to discover new strategies.\r\n\r\nThe music and sound effects are top-notch, enhancing every moment. And the visuals? Absolutely stunning. The animations and the seamless combat is on par with the best Soulslike games out there. For a debut game, Game Science has truly knocked it out of the park.\r\n\r\nI'm genuinely excited to see what they come up with next.", 0.5222930312156677]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2358720/header.jpg?t=1744876595", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2358720/b7f722ddd5e23503f598586aa3700dd4d827bb2d/capsule_231x87.jpg?t=1744876595", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2358720/b7f722ddd5e23503f598586aa3700dd4d827bb2d/capsule_184x69.jpg?t=1744876595"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.heishenhua.com/"}, "developer": "Game Science", "owners": "50,000,000 .. 100,000,000", "tags": ["Mythology", "Action RPG", "Action", "Souls-like", "RPG", "Combat", "Story Rich", "Singleplayer", "Action-Adventure", "Drama", "Dark Fantasy", "Atmospheric", "Adventure", "3D", "Fantasy", "Hack and Slash", "Third Person", "Difficult", "Music", "Violent"], "languages": ["English", " French", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese", " Italian", " Turkish", " Thai"], "concurrent_plays": 29472, "number_of_achievements": 81, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Adventure", "RPG"], "short_description": "Black Myth: Wukong is an action RPG rooted in Chinese mythology. You shall set out as the Destined One to venture into the challenges and marvels ahead, to uncover the obscured truth beneath the veil of a glorious legend from the past.", "long_description": null}