{"name": "Path of Exile", "app_id": "238960", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 503, "negative_reviews": 45, "reviews": [["21.02.2017\nPoE patch 3.0 gets 6 new acts for free, Diablo3 patch 2.5 gets more \"Class balance meta changes\".\n\nWake up people! This is a good game and it's free.\nThis is free content for the lovers of true ARPG games.\nProbably the only free game where the microtransactions are purely for vanity items.\n\nTry it and support it if you will enjoy it.\n\nP.S. Don't get scared by the skill tree. Can be overwhelming but it makes sense!", 0.7976157665252686], ["Very good game.  Its free to play so how cann you go wrong.  Can get somewhat repetitive working your way through the acts multiple times.  \n\nSMALL TIP FOR NEW PLAYERS:  Pay attention to your skill tree.  This is very important.  If your skill tree is not optimized properly towards what types of spells and attacks you plan on doing then you will not be able to defeat the higher tier enemys and end up grinding HARD.  Look up some good Path of Exile builds online or on youtube and follow those.\n\nYou will not just have one character.  And you will not play through the game just once.  Everytime becomes more of a challenge to better your character.\n\n10/10 would wash up on a beach again.", 0.7594398260116577], ["POSITIVE:\n\nbest diablo/hellgate mix that i have ever found! skilling is funny, you can almost do everything you want and even as free player you can reach good power level but well optic effects cost as usual. even high powered you will look like all the rest. everything special you got to buy with real money. but isnt that always the case?\n\nNEGATIVE:\n\nthe quests become boring very fast, if you finished the first act you will fly over the others faster and faster until you encounter the point where you could NEED some other player to go with you. well...if nobody of your real life friends play this game you can forget it. in the community you wont find SOCIAL or FRIENDLY people. only egoistic and rude ones. \n\n\nits fun to play it solo still..you just need twenty hours more patience ;)\n\ngive it a try and find out by yourself. \n\n", 0.6875], ["~ Free To Play \n~ Good Storyline\n~ Game Runs Well With Minimal Specs\n~ Good Sized Player Base\n~ Fast Servers\n~ Nice Graphics\nOverall,this Game is a lot of fun and is a great Diablo 3 alternative.I give a lot of credit to the Developer for this Game,considering how great it is and it's free to play.There are Microtransactions in the Game,but you can still have an enjoyable experience without using them.", 0.7354536652565002], ["Path of Exile is an online Action RPG set in the dark fantasy world of Wraeclast. It is designed around a strong online item economy, deep character customisation, competitive PvP and ladder races. The game is completely free and will never be \"pay to win\". This is the best Free to Play game on Steam!\n\n+Game Features+\n\n-Completely free to download and play\n-A persistent online world capable of supporting hundreds of thousands of players\n-A dark and gritty game world rendered from a fixed 3D perspective\n-Battle dozens of foes across a variety of unique areas\n-Randomly generated levels and items for extreme replayability\n-Online ranking and ladders for every game mode\n-Visceral combat with dozens of combinable skills\n-Battle in PVP tournaments for worldwide recognition", 0.7159397006034851], ["Great end game with challenging bosses providing satisfying season goals;\n\nVivid economy based on crafting currency;\n\nImmense build variety;\n\nDark and desolate theme with amazing art;\n\nHelpful, passionate and well humored community of players; \n\nDevelopers pumping content like crazy; \n\nThrough constant consistent updates this game has definitely become a keeper.\n\n\n", 0.7049509286880493], ["all you wanted from d3 and so much more.\n-challenging\n-addicting\n-incredible amount of content\n-awesome crafting and trading\n-huge learning curve\nabsolute recommend", 0.7528995871543884], ["I was skeptical at first, since I'm not a huge fan of dungeon crawlers. Fell in love with the depth of this game though, and 45 hours in I've gotten three of my friends addicted to it as well. Awesome game, and even better it's free.", 0.7381580471992493], ["[b]TL;DR[/b]\nThis is a great game. Try it out, its free anyway.\n\n[h1]Review:[/h1]\nPath of Exile is a ftp-Action_RPG game, released 2013 and being under continued development since then, having had multiple free expansions, leagues and content updates. It can be played solo or in a party with up to 5 other people on either soft- or hardcore.\n\n[b]Pros:[/b]\n-Free to Play, only cosmetical purchases\n-dark & gritty style fitting the story and lore\n-insanely deep and varied skill system\n-smooth leveling experience\n-expansive and challenging endgame\n-interesting and unique currency and crafting system\n-free trading economy\n-seasonal leagues with their own twists and challenges to keep the game fresh\n-regular free content patches\n-big and friendly community\n-around 5h of soundtrack\n-nice looking cosmetical microtransactions\n\n[b]Cons:[/b]\n-this will eat your time\n-start of play can be unimpressive\n-since this is a always online game, connection issues can be a problem\n-daunting skill tree\n-through the leveling process you have to play the same story 3 times in increasing difficulty (changed in the future*)\n\n*as of now, the new expansion \"Fall of Oriath\" has been announced for mid 2017, adding 6 new acts to the 4 existing ones, therefore eliminating the need to replay the story 3 times. (i have a boner)\n\n[b]Conclusion:[/b]\nFor anyone interested in the action-rpg genre and disappointed by Diablo 3, look no further than this ftp-gem called Path of Exile. Challenging, rewarding and smooth to play, this appeals to everyone: the casual softcore to the min-maxing hardcore player. There is little as rewarding as building up your own character, theorycrafting, gearing, fighting, struggling and finally concquering everything the game has to offer. And then doing another one, thats complety different. And another one.\nFor someone new to the action-rpg genre, don't get scared by the seemingly endless possibilites and mechanics the game offers you, punch through the somewhat tedious first 2-3 hours of the game and enter the realm of the game that will suck you in and never let you out again.\n\n9,5/10", 0.6726322770118713], ["the best diablo2-clone on the market....well, actually it's free. A true f2p.\nA great game for who likes grinding gear games, same name of the sh who created it.\nA tough, time-consuming, not-QoL arpg. \nNot a game I love, but quality in it can't be denied. 8/10", 0.6175316572189331], ["The best of it's kind. Completely F2P, money only gets you cosmetics and extra tabs for your personal stash. No reason not to try it.", 0.5652173757553101], ["if you love game's like diablo/torchlight etc etc then look no further\nbecause this is pretty much the best you can get", 0.523809552192688], ["It is rare to find a free to play game of anywhere near this scale where the pay-to-win factor is so committedly avoided. Having said that, some of the skins and cosmetics are absolutely worth having and the POE community are really responsive and supportive of new players too. Grinding Gear have remained true to their word over a long period of time to ensure wide access and a massive playing base. The skill tree and slot system for weapon improvement has been extraordinarily well-thought out. \n\nThe ability for players to change direction of character development is really quite unparalleled and I can not recommend this game highly enough for balance, replayability and sheer addictive enjoyment. Having completed the game as a nimble (you gotta know how to dodge as some of those bosses hit HARD)  dps-focused hunter, I am going back to the beach with magic in my veins for a different challenge. This is a great game..", 0.5454545617103577], ["So you think this game is all about killing and looting just like any other ARPG. Well, yeah, there is tremendous amount of looting and killing in PoE, but really, really this game is about creating builds and see how it works.\n\nYou have to devour and digest enormous meta to fully enjoy this, and learning it is a part of the fun.\n\nHuge passive tree, lots of active skills (gems), different ways of attack and defend, buffs and debuffs, type of weapons and magic, six classes each with 3 sub top classes and one class which is mix of all of them, and links and synergies between all this stuff. It all leads to literally endless variations how you can build your character and play it.\n\nOh, and this game is totally free. No content is hidden behind the paywall, you just pay for cosmetics and extra stash space which you need only if you love to collect all kind ot trash you'll never need.\n\nSo it's easy 10/10 for me, now I have to create another new character with this build idea I've just got.", 0.54356849193573], ["[h1]I don't have a lot of Hours on this, as I just started playing it through steam. I have been playing Path of Exile since June of 2012 http://i.imgur.com/jeP6URF.png and have thousands of hours on it.[/h1]\n\nIt is among the most amazingly awesome games I have ever played. Coming from Diablo 2: LoD, and the various mods (Valhalla, Eastern Sun, Median, etc) this game is perfect for me. \n\n* I will start here, with the things that I enjoy about it.\n\n1. Diversity among builds. Want to shoot a thousand exploding arrows per second (Quill Rain + Chain/Greater Multiple Projectiles/Exploding Arrow/Fire Penetration)? Want to blast rays of fire that launch exploding balls of magma (Scorching Ray/Cast While Channeling/ Fire Penetration/ Multiple Projectiles/Magma Orb)? Want to call forth the fury of the heavens with a mighty scepter, smashing your foes into submission (Mjolnir+ Lightning Strike/Arc/StormCall/Spark/Multistrike)? The sheer amount of ways you can go about destroying mobs is limited only to your imagination. \n\n2. Story is great, very interestnig, and keeps you entertaining while playing through the game. Unlike other ARPGS of similar play style, Path of Exile is able to effectively deliver a quality story along with the extremely well done gameplay.\n\n3. Scenery is dark and grim, gloomy, morbid, and full of gore. From corpse ridden beaches, ancient temples filled with undead and skeletons, destitute crumbling cities, palace cellars flooded with blood - ridden with heaps of corpses and twisted miscreations, echocing crystal caverns of golems and mutated freaks. The variety in enemies and terrain is very broad. \n\n4. Item creation, map alteration and creation, uber dungeons. There is plenty of challenge to be had in this game, thus keeping you striving to achieve ever greater power and push yourself ot the absolute limits of your capabilities.\n\n5. Infinite replayablity. I have made probably 50+ characters so far, and each one gets progressively more powerful as I understand more about the game, the mechanics, and how to build them effectively. \n\n6. Temp Leagues + Ladder. Nuff said.\n\n7. Constant expansion and content updates. The game is constantly being updated, minor balance tweaks, additional items, skills, monsters, maps, etc. It's amazing.\n\n8. Grinding Gear Games are among the most amazing gaming company. Really really good people and they constantly interact and have dialogue with the playerbase. \"How do you guys feel about X? Does Y feel right to you? If you could change X, what would you do and why?\" etc.\n\n[b]I could go on for another thousand lines but I feel as though I got the point across. The game is amazingly fun and addicting.[/b]\n\n[h1]Now, for the things that, I don't necessarily \"dislike\" - but things that I feel may dissuade other people from playing the game.[/h1]\n\n1. Learning Curve is incredibly steep. Your first 3-5 characters will be absolute trash. You need to do a bit of research on what to do and how to build effectively, otherwise you're probably going to get wrecked hard once you get to a4 merciless. Here is a beginners guide - https://www.youtube.com/watch?v=lEZtq6FSebE&list=PLjlRwdIo6SixoG_Bo5bhKCzZtOMVuVnJZ&index=8&t=8s\n\n2. Repetition of acts, 3 difficulties (however, this will be gone come July - TEN ACTS ONE PLAYTHROUGH HYPE!) Going from Normal, to Cruel, and then to Merciless can really put people off. Myself, I'm used to it and have done it since d2 so it's just a normal thing for the arpg genre. GGG are going to change that though.\n\n3. Item crafting is [b]extremely[/b] expensive. Like, unfathomably expensive. I have never crafted an item before other than throwing an alch and a couple chaos into a rare item. \n\n4. Currency is nightmarishly rare. I've found maybe 4 exalted orbs in my entire time playing this game. Two of them were just within the last week as well. I have only ever owned two 6-link items. Wings of Entropy, and some random rare 2h sword that is garbage. \n\n5. poe.trade is the only real way to trade. $Chat is a scam 100% of the time. Once they implement a real trading system other than posting shops online and checking the forums every 3 minutes, or browsing poe.trade for an hour at a time trying to find an item to fill a hole in your build this game will be just shy of perfection.\n\nThose are really the only negative things I can think of that might dissuade a player from sticking around... the game is magnificent.\n\nI highly, highly suggest you play.\n\n[h1]Overall Rating[h1]\n[b]10/10 - one of my favorite games of all time.[/b]", 0.5416666865348816], ["Random Lazy Review (SP):\n\nThis game may be inspired heavily by diablo 2 but presented a pinnacle of greatness out of itself.\n\n+ One handed easy to play isometric hack and slash worldwide standard.\n+ Main storyline, missions are decent enough.\n+ Every single game mechanic is perfected to the extremes.\n+ Huge skill tree, interesting gem properties resulting in brilliant active skills.\n+ Artistic/Graphical side and variety of characters, enemies, landscapes etc. are a sight for sore eyes\n\n\nSome of minor issues \"for me\" which has no effect on the value fo the game:\n- Where is the pause button? Respawning of monsters in a particular map whenever you are disconnected or hit esc to get a coffee. You have to go through everytime.\n- Too much unecessary loot (little bugs droping heavy armours!).\n- Countless of weapons which make no sense. (a common problem with diablo genre)\n\n Bottomline : Evil Blizzard's worst nightmare.\n\nRecommend : Play it now.\n", 0.540756344795227], ["i love the game but i need a better computer to run most of the game and most of my bilds it does suck only haveing 384 mb of graphics i need to get a new compter otherwise its a good game and yes ive been playing this game at 1-15 fps some times crashing or the game freezes up and becomes unplayable keep up the work ggg keep doing what is necessary to improve the game experience", 0.5396419763565063], ["Hands down the best modern dungeon crawler with multiplayer ever made.\n\nAnd the best part is?  You don't even need to spend a dollar to thoroughly enjoy it.  It also runs anything variably better than a Raspberry Pi.\n\nIt's not pay to win, and it doesn't require you grind for 14 hours a day or keep playing regularly to keep/upgrade your stuff.\n\nI honestly have no idea how PoE can be this much of an amazing game with an amazing developer and an amazing community and not crumble to ashes or burn out like so many games before it.  \n\nIt's truly astounding.", 0.5865834951400757], ["It has been done. A better game than Diablo 2 has been created. I'm not going to argue with you about it. I was 13 when Diablo 2 came out, and I spent some of the best years of my life on that game. It invoked me with a sense of nostalgia that will, frankly, never fucking leave me. \n\nThe official Diablo 3 - You are looking at it. When I first played this game, I said to myself \"This game is so similar to D2 that the devs are going to get sued!\"\n\nJokes on me. This gave has (approximately) 25x (yes, 25x) as much content as D2. The crafting system puts every other game's system to shame.\n\nWhatever. Take an oldschool D2 player's advice and DL the freaking game. It's free to play, pay to stash, but you start with plenty of stash tabs. Trust me brother, they get you *good and hooked* before you even think about spending a penny.", 0.5362902879714966], ["I was a big Diablo 3 fan. Years ago I tried this game in beta and brushed it off after 20 minutes to play more Diablo. In those years I've seen that POE has had countless updates and content. It's really came into its own. I was tired of Diablo 3, and the developers decisions with it. I tried this game again and was amazed at how far its come, and how much it does right compared to Diablo 3. \n\nThis game has incredible depth and unique varied RPG systems that makes leveling up really fun. You have the skill tree (similar to FFX) as you level. You also have skill gems and gem slots that allow you to add, remove, and mod skills with other skills. Its a very fun system. You can also level up those skills too. \n\nThe gameplay is addicting and fun. Party up or solo its a great experience. Skills are unique and fun to use and mod, and the addition of 5 potion slots makes it even more vaied. \n\nThe developers really know ARPG's. They listen to the community and make smart decisions with balance, gameplay, and how items/currency work. They give you plenty of freedom with items that can customize your gear so you have lots of room to make something you want work. Best ARPG I've ever played!", 0.5353372693061829]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/238960/header.jpg?t=1726453971", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/238960/capsule_231x87.jpg?t=1726453971", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/238960/capsule_184x69.jpg?t=1726453971"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.pathofexile.com"}, "developer": "Grinding Gear Games", "owners": "20,000,000 .. 50,000,000", "tags": ["Free to Play", "Dark Fantasy", "Action RPG", "Hack and Slash", "Loot", "MMORPG", "Multiplayer", "Dungeon Crawler", "Isometric", "Character Customization", "RPG", "Online Co-Op", "Inventory Management", "Singleplayer", "Action", "PvP", "Horror", "Massively Multiplayer", "Fantasy", "Adventure"], "languages": ["English", " Portuguese - Brazil", " Russian", " Thai", " French", " German", " Spanish - Spain", " Japanese", " Korean"], "concurrent_plays": 5568, "number_of_achievements": 127, "categories": ["Single-player", "Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "In-App Purchases", "Remote Play on Tablet"], "genres": ["Action", "Adventure", "Indie", "Massively Multiplayer", "RPG", "Free To Play"], "short_description": "You are an Exile, struggling to survive on the dark continent of Wraeclast, as you fight to earn power that will allow you to exact your revenge against those who wronged you. Path of Exile is an online Action RPG set in a dark fantasy world. The game is completely free and will never be pay-to-win.", "long_description": null}