{"name": "Dying Light", "app_id": "239140", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£13.99", "final_price": "£2.79", "discount_percent": 80, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 82635, "negative_reviews": 4977, "reviews": [["\r\n---{ Graphics }---\r\n☑ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☑ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☑ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☑ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10\r\n\r\nThanks for asking me to play! <3\r\n", 0.8503813147544861], ["I used to think I liked zombie games. I played them all—slow, fast, crafting survival, mindless shooters... but then Dying Light came along and ruined everything.\n\nNow, in any other zombie game, I feel like I'm crawling through wet cement in flip-flops. No other game lets me parkour across rooftops like a caffeinated ninja, throw zombies off buildings like I'm in an action movie, and then immediately regret all my life decisions when the sun goes down. This game delivers on all fronts.\n\nJust when you think you've done it all, along comes The Following DLC with new locations, an improved story, and a freaking buggy to mow down zombies at 100 mph. It's everything I ever wanted—what more could you ask for?\n\nOh, I know. How about a medieval dungeon crawler inside a zombie game? Because that's exactly what Hellraid brings to the table. One moment you're slashing through infected in Harran, the next you're wielding swords and battling demonic skeletons in a cursed tower. Does it make sense? Not really. Is it fun? Absolutely.\n\nTechland deserves a medal for making a zombie game that still looks amazing years later. Or at the very least, they deserve my eternal gratitude.\n\n10/10 I would play it again.", 0.8043678402900696], ["fun immersive game, but DO NOT accept any drops from any player, unless you are actively progressing alongside them. a very common griefing method is giving new players OP items so all the challenges are trivialized", 0.6701648831367493], ["Review after finishing the main story, with all the side quest and only some challenges done. The game's atmospheric setting and intense game play moments made for a thrilling ride.  Overall, a fantastic game that's a must-play for fans of the zombie genre!", 0.5898305177688599], ["gameplay-wise this game is great, story-wise it can get very stupid, at least the Main Character are not bad. \n\ncompletionist be warned, around 50% of the achievement are online co-op and/or require DLCs.\n\n\n\n\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ review template source}---\n☑ https://vojtastruhar.github.io/steam-review-template", 0.5880944728851318], ["A great mix of parkour, survival and zombie horror \nfun on your own, but way better with friends. Definitely worth a try for any zombie game fan 10/10", 0.5817490816116333], ["Dying Light is one of the best and most unique zombie games I have ever played! The parkour element is incredibly fun and is what sets this game apart from other games like it. The parkour is fun to use, and the two maps are incredibly fun to run around in! The combat against zombies is fun, and I love the detail with the ragdoll physics and how you can break the bones on zombies. It makes it feel more rich and layered. The soundtrack is also amazing, and fits the tone of this game incredibly well, and elevates certain moments pretty well. While not as strong as other parts of the game, I think the story is pretty decent, and sets up some fun sequences which allow you to utilise both combat and parkour in fun and inventive ways. Kyle Crane (the main character) is also quite well written, and his VAs performance is incredible and does a good job at making him incredibly likeable. The story is much better in The Following. It has a cool mystery element which keeps you hooked, and a pretty cool twist at the end. The Following also introduces a new driving feature, which is just as fun and rewarding as the parkour element. I also enjoy the side missions in both the base game and the following. Some are quite dull and boring, but there are some that have some really funny moments or memorable characters that stick with you. \n\nThere are a few things that aren't that great, but they don't bring down the experience at all. The combat is good against zombies, but against humans it is dreadful. You can just use guns to nullify this, but it still doesn't remove the fact that melee combat against humans isn't fun and annoying to some degree. Like mentioned earlier, the story is decent, but not very creative or original. The Following has a great story but the base game story is very basic. It is carried heavily by Kyle Crane, his VAs performance, and the many cool sequences that are in the story. \n\nOverall, this game holds a very special place in my heart, and I would recommend it to anybody! This game is an incredibly solid 9/10 if we ignore my biases (I would give it a 10/10 but objectively it is a 9/10). If you haven't, play this game! It is incredible and worth your time and money", 0.5813953280448914], ["After about 30 hrs playing this game I'm uninstalling.  Too many dumb things, like I've died more times to my guy not grabbing ledges after using grappling hook than anything else.  Now at this point of the game they just spawn the stupid runners every 15 secs from sewers and under cars.. like how the hell they got 7 - 10 runners under one car.", 0.5507640838623047], ["\r\nprobably one of my favourite games. i love the open world quest hunting games where i'm free to do whatever but there's stuff for me to do to progress the story. i love kyle <3", 0.54356849193573], ["Gameplay and Movement so smooth that you'll cum in your pants an want for more everything you can see is climbable including zombies and bandits \r\n\r\nso the big issue? \r\nthey do not know how to make bosses each boss with simply a bullet sponge (mind you i was a the hardest difficulty so i die in 2 hits no joke) and at 50% phase 2 was it summoning alot of mobs that'll make it worse oh yea then you gotta start from the beginning, Story was ass, but the dlc [The Following] had great story. but the movement and traversal of the open world was so good you can ignore it. Way to experience the story is easy difficulty but then you'll miss on the adrenaline rush of some chases that are important to the story (wont spoil what it is) You'll Never forget you first night out in Harran and dont try to open any doors that you shouldnt. Good Night Good Luck\r\n\r\n8/10", 0.5416666865348816], ["MAC USERS READ THIS! \nI bought this game on my mac once, and it broke randomly. So i bought it again! And i was playing it and this texture was stretched out but it didn't bother me. The next day the textures were just sooo stretched out so i restarted the game thinking that would fix it, it just wouldn't boot anymore. So i recommend you don't buy this junk.", 0.540229856967926], ["It's fun, but badly optimized and too expensive.\n\nAlso, this game has one of the most toxic fanbases I've ever seen. Grow the F up, please. It's not my fault the game runs like garbage half the time.", 0.5335820913314819], ["A good game. I played entirely solo but can imagine its even better in co-op. The story is not great and the main villain is a cartoon. \n\nThe game is saved by its interesting fusion between crunchy melee and its parkour. Without the parkour I don't think it'd be anywhere near as good. \n\nBurned out on this for now but may come back to do The Following expansion at a later date.", 0.523809552192688], ["Damn, I am not a fan of horror games but this game exceeds all my expectations. I recently bought this game and only have 6 hrs of gameplay and I am not lying i dont have the strength to play this game in night. The first zombie like creature [spoiler] Volatile [/spoiler]encounter is enough for me to race my heart. [b]Those who love horror games this game is a masterpiece.[/b]", 0.523809552192688], ["Very nostalgic game. Banger soundtrack along with fun parkour. This game has workshop support and you can resume playing after you beat the last mission. For sure buy even at full price", 0.523809552192688], ["Genuinely one of the worst written stories of all time. Excellent gameplay marred by a story so predictable, bad, and frustrating that I several times dropped playing it specifically for the dozens of \"win in gameplay, die in the cutscene\" level writing the story beats had. Not to mention, the primary storyline features the beautiful trope of a magical villain that despite logic, reason, reality, or previous story beats, puts you in bad or tragic positions because apparently deaths and monologues are good writing. Would genuinely be better off with the main story removed, which is sad because the world building and environment is amazing, and the carefully designed map and gameplay elements make the actual gameplay thrilling. Unfortunately every bit of world development happens in time with the story, which ruins it. I'm 50/50 on recommend or not, but the story is so painful I can't really. If they didn't ruin the gameplay in DL2, fingers crossed that's the one to get.", 0.523809552192688], ["so damn fun with friends and truly one of the best zombie games of all time\n\nunlock the dropkick asap, it's hilarious", 0.523809552192688], ["1.launch game\n2.Enter Story mode\n3.Get bitten\n4.play whole game and go after Rais\n5.Kill Rais\n6.Absolute Cinema", 0.5223700404167175], ["Наконец-то я добил эту игру. \r\nВ прошлый раз наиграл в нее 8 часов и дропнул на миссии, где первый раз ночью нужно было убежать от Прыгунов. Это реально жутко, особенно когда твой персонаж бомж. А первые 8 часов твой персонаж бомж и находится в соответствующей локации - Яме. \r\nТолько в конце первой половины игры твой персонаж начинает что-то из себя представлять, и если ты играешь без гринда и рашишь сюжет, то у тебя появляется первое нормальное крафтовое и огнестрельное оружие. Пытаться зачищать зомбки долго, нудно и лута в первой локации немного, поэтому я не жалею что рашил сюжет. Плюс самая главная фишка игры - паркур - в первой локации не раскрывается, так как рядом стоящих зданий немного. И часто приходится бежать по земле. \r\n\r\nВсе меняется во второй половине игры и убивать зомби становится  не то чтобы легко, но тебе есть хотя бы чем их убивать и самое главное с прокачкой уровней появляется добивание, если повалить зомби. Оно сильно упрощает жизнь. Крюк кошка у меня появилась где-то на 70 процентах пройденой сюжетки, но мне хватило времени ее оценить. Это прикольная механика. \r\n\r\nОсновное в этой игре - геймплей. Сюжет - его тут нет. Лучше не пытаться воспринимать попытку в сюжет всерьез. Тут нет даже попытки сделать хоть одного персонажа, на которого тебе не будет плевать. В том числе и главного героя. Их основная движущая сила - тупость. \r\n\r\nИгру проходил на сложности сюжет, но не скажу, что она была прям простой. Система лута и выживания тут прикольная. Крафт тоже. \r\n\r\nЕсли вам нравится зомби сеттинг и  вам хочется смотреть как гнилые головы зомбей разлетаются от разного видна оружия, то советую. Главное, не задушиться и на забросить игру за 8 первых часов.", 0.5172414183616638], ["fantastic game, incredible graphics, compelling story line..\r\nand you go through all that for a goddamn quick time end boss fight... @#*%ing QUICK TIME?!?\r\nLIKE WHAT THE ACTUAL F?!\r\n\r\nmassive MASSIVE let down. i hate quick time, i cannot do quick time. 80 hours of game play for the biggest disappointment EVER. \r\n\r\nSO so disappointed.", 0.514893651008606]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/239140/header.jpg?t=1738004178", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/239140/04f5f510bda7a47ea9d0ff8b2f3313072035d81b/capsule_231x87.jpg?t=1738004178", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/239140/04f5f510bda7a47ea9d0ff8b2f3313072035d81b/capsule_184x69.jpg?t=1738004178"}, "support": {"support_website": null, "support_email": null, "game_website": "https://dyinglightgame.com/?utm_source=Steam&amp;utm_medium=Link&amp;utm_campaign=Dying_Light"}, "developer": "Techland", "owners": "10,000,000 .. 20,000,000", "tags": ["Zombies", "Survival Horror", "Horror", "Online Co-Op", "Open World", "Parkour", "First-Person", "Survival", "Open World Survival Craft", "Gore", "FPS", "Action", "PvE", "Stealth", "PvP", "Multiplayer", "Post-apocalyptic", "Story Rich", "Action RPG", "Hack and Slash"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Dutch", " Polish", " Portuguese - Brazil", " Russian", " Korean", " Simplified Chinese", " Spanish - Latin America", " Japanese", " Thai", " Traditional Chinese", " Turkish", " Czech"], "concurrent_plays": 9348, "number_of_achievements": 78, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Workshop", "Steam Cloud", "Valve Anti-Cheat enabled", "Includes level editor", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "RPG"], "short_description": "First-person action survival game set in a post-apocalyptic open world overrun by flesh-hungry zombies. Roam a city devastated by a mysterious virus epidemic. Scavenge for supplies, craft weapons, and face hordes of the infected.", "long_description": null}