{"name": "Getting Over It with Bennett Foddy", "app_id": 240720, "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£5.79", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 32480, "negative_reviews": 5919, "reviews": [["i pray on this mans downfall\n\nOtherwise this game is very niceing. I like the soundtrack. \n\nHowever for your own sanity I urge you to stay as far away from this THING as possible. Just as Mark said... if you use this game to torture the worst of your enemies, you would be seen as cruel, a monster perhaps.", 0.6052202582359314], ["I was an anxious kid with a grey matter starved brain listening to A Moon Shaped Pool and Israel Kamakawiwo'ole just to keep from feeling numb for another second. So, needless to say i greatly appreciated the introduction of masochism into my psyche by this neat little game. 10/10", 0.5859693288803101], ["This f*cking piece of junk-ass game is the worst f*cking game ever. \"Getting Over It\" is not a game—it's a psychological torture device disguised as an indie art project. This sh*t made me break my monitor three f*cking times. THREE. I’m typing this on a replacement keyboard because the last one was murdered by a flying coffee mug during my fourth fall back to the f*cking beginning. Not to mention, my PC’s fans were screaming like they were being exorcised, overheating so bad it could've cooked a godd*mn steak on the GPU.\n\nThis game made me so loud, my parents thought I was possessed. They packed my bags and drove me to an adoption center like I was some kind of demonic foster project gone wrong. Do you know what it feels like to be disowned because a man in a pot couldn’t climb a mountain with a f*cking hammer? I do.\n\nAnd Bennett Foddy? That calm-ass narrator with his smug, philosophical bullsh*t quotes while I’m spiraling into a black hole of pure f*cking rage? F*ck that guy. No one needs a voiceover quoting Nietzsche when they just lost 45 minutes of progress because their mouse had a slight hiccup.\n\nYou think you’re making progress, right? You hit the tree, passed the garbage can, launched yourself over the house, and you're like, \"Maybe I can do this.\" Then BAM—you overshoot the slide by 2 pixels, and now you’re in a pit so deep it might as well be Hell itself. It’s not just a fall. It’s a soul-crushing, reality-shattering descent that takes your will to live and tosses it off the f*cking cliff along with your self-esteem.\n\nI screamed so loud during one fall that the neighbors knocked on the door to check if I was dying. I was, Brenda. I was dying inside. Every time I think I’ve gotten better, that maybe I’ve mastered the controls—NOPE, the game hits me with a \"f*ck you\" swing that launches me from near the top all the way back to the f*cking tree at the very beginning like it's some kind of sick joke.\n\nAnd don't get me started on that f*cking anvil section. Whoever thought \"Hey, let’s make a pointy piece of sh*t cliff with nothing but slippery rocks and hope\" should be jailed. In a pot. With a hammer. Forever.\n\nThis isn’t just a game. It’s an emotional purging ritual. It's like Bennett Foddy looked at the concept of hope and said, \"Let’s make a game that sh*ts directly on that.\"\n\nF*ck this game. F*ck the pot. F*ck the hammer. F*ck the mountain. And f*ck whoever decided that mouse-only controls were a good idea for platforming.\n\nAnyway. I’ll probably play it again tomorrow", 0.5419847369194031], ["Now you might be wondering why would someone ever spend more than hour in a rage game like Getting Over It? At first I had that same question  but I soon realized people don't care about the funny lookin cauldron man they care about Bennett. Some people may hate him but other love him, he's like your dad in the game. I couldn't stop playing once I heard his irresistible voice. Somedays I would open the game to hear Bennett's silky smooth voice tell me that I almost made to the top and his truly poetic words kept me from falling off the edge. Needless to say I made it there and have no regrets, I just miss his voice.", 0.5374845862388611], ["I loved this game… and also broke a screen and a mouse. 😅\nGetting Over It is a unique experience: frustrating, unforgiving, but strangely satisfying. If you enjoy extreme challenges, humiliating falls, and existential crises at 3AM, this game is for you.\n\nI definitely recommend it – just know what you're getting into. It’s rage-inducing, but it also teaches patience (and maybe anger management 😂).\n\nGood luck to anyone brave enough to climb!", 0.531189501285553], ["This game is life, pain is life, pain is frustration, pain is this game, pain is you.", 0.531189501285553], ["Bought this game for 0.6$ worst investment in my life \nHad to buy new monitor and keyboard", 0.531189501285553], ["Another banger that I was forced to play for hours and hours on end, fun experience I must say. On my way currently to get the last achievement, not as hard as one might think. I do have to say tho, spending more than 20 minutes on this game will make your blood boil.\n\nGood luck!\n\nEdit: Beat it 50 times now, every victory filled me more with despair. End time, 7 min 34 sec.", 0.523809552192688], ["It accomplishes its job, and Is sorta fun, but is better on a video. I would not say that is a good, difficult.", 0.5196927785873413], ["Came for the pain and suffering, stayed for the great voiceovers", 0.5], ["Frustrating at times, but not as rage inducing as its reputation makes it out to be. Quite fun once you get the hang of it! :D", 0.5], ["I feel satisfied with this game I am not really much of a gamer myself as they call them I have never really enjoyed the tedious process of collecting material to do this task to be able to do that task to complete this objective I have never really found enjoyment within that in the medium of video games but this game felt different it felt like more of an art piece I actually felt like for once I am connected with the creator of this art piece and I am not just playing some lifeless game that a multi billion dollar studio created to hope to get you to spend money on there micro transactions and such I feel as when I played this game I felt calm I felt like I did not need to hurry or to make sure that my progress was saved or had to wait for my cousin to come over to my house so we could keep on going it felt as if I could just hope on for a bit maybe try get halfway across and once I fall off of orange hell I could just exit and go on with my day I liked that it kind of also reminds me of a gay furry novel called echo I would recommend you give it a read if you ever have the chance", 0.5], ["I like it, it is a little frustrating, but pretty good. It also helps with patience. It's got good quotes when you fall, too.", 0.5], ["This game has gave me depression. Memory loss. and increased my anger issues by a lot and punched a hole in the wall and broke my monitor 10/10 buy it", 0.5], ["this is unironically one of my favorite games unfortunately. 10/10", 0.5], ["At first when I firstly touched this game I was hating on the creator for make a stupid game and was making excuses about the mechanics and Bennett talking over then fell down furthermore blaming Bennett talking. Now right after I rage quit, then next day I came back to the game and after 1 hour I was actually able to beat it. When you are playing this game take your time on the game and you should take break and you could beat the game. 10 out of 10 game overall.", 0.5], ["very fun game, it took me 5 hours to beat it for the first time, then beat it in 1 hour for the second time and it now takes me about 10 mins for a game\n\n9/10\n\n(very fun for the first time but no reason to play after 50 wins)", 0.5], ["You ever make a mistake in a game and blame the game, but it's really your fault? Well this time you're right, it's the game's fault.", 0.5], ["I have played this game a lot. I've beaten it 475 times and I can say its a very simple yet complex game. It originally took me 12 hours to beat my first run and now i average 3 minutes to beat the game. The game feels like the hardest game you've ever played the first time around but once you beat it once the entire game becomes so much easier. I genuinly reccomend beating this rage inducing silly game at least once. i enjoy speedrunning it so much i did it hundreds of times", 0.5], ["I definitely recommend the game to people looking for a reason to smash their laptop into a thousand pieces", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/240720/header.jpg?t=1666987027", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/240720/capsule_231x87.jpg?t=1666987027", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/240720/capsule_184x69.jpg?t=1666987027"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.foddy.net/2017/09/getting-over-it"}, "developer": "Bennett Foddy", "owners": "2,000,000 .. 5,000,000", "tags": ["Psychological Horror", "Difficult", "Singleplayer", "Physics", "Philosophical", "Horror", "Funny", "Platformer", "Indie", "Survival Horror", "Casual", "Dark Humor", "Replay Value", "Adventure", "Action", "Comedy", "Story Rich", "Strategy", "Great Soundtrack", "Third Person"], "languages": ["English", " Japanese", " Russian", " Korean", " Simplified Chinese"], "concurrent_plays": 278, "number_of_achievements": 3, "categories": ["Single-player", "Partial Controller Support", "Commentary available", "Remote Play on Phone", "Remote Play on Tablet", "Family Sharing"], "genres": ["Action"], "short_description": "A game I made for a certain kind of person. To hurt them.", "long_description": null}