{"name": "The Forest", "app_id": "242760", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£15.49", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 160907, "negative_reviews": 7876, "reviews": [["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10", 0.7165183424949646], ["The Forest is nothing short of a masterpiece! From the moment you step into the game, you're immersed in a beautifully crafted world filled with mystery, danger, and adventure. The open-world survival mechanics are engaging and rewarding—gathering resources, building shelters, and surviving the wild feels incredibly satisfying. The atmosphere is tense and immersive, with the chilling sounds of the forest keeping you on edge.\r\n\r\nThe AI and enemy design are top-notch, and the constant feeling of unease makes every moment in the game exciting. Multiplayer is a blast with friends, and there’s always something new to explore. The way the game balances exploration, combat, and crafting is perfect!\r\n\r\nIf you're a fan of survival games, this is a must-play. 10/10 would recommend!", 0.6550323963165283], ["I thoroughly enjoyed playing this game. Its open world design and survival mechanics, combined with the zombie combat elements, make for an incredibly engaging and entertaining experience. Exploring the vast world, uncovering hidden caves, and collecting all the achievements added a great sense of accomplishment and discovery.\n\nOne of the standout aspects is the freedom it offers in terms of gameplay. Building bases, scavenging for supplies, and surviving alongside friends adds a layer of depth that keeps things fresh and exciting.\n\nHowever, the story leaves much to be desired. While I won’t go into spoilers, the narrative feels underwhelming, especially with its multiple endings. It lacks the impact and cohesion I was hoping for.\n\nThat said, this game is far from being a bad title. While it may not be the best game I’ve ever played, it’s definitely one I’d recommend particularly for fans of open world survival games with cooperative multiplayer. If you enjoy zombie themed gameplay, exploration, and base building, this one is well worth your time.\n\n", 0.6021220088005066], ["The Forest drops you into a beautiful yet terrifying wilderness where the locals aren't exactly welcoming (think cannibalistic mutants with a serious personal space issue). Crafting and survival are key, but let's be honest, most of your time will be spent screaming and desperately trying not to become someone's dinner. If you enjoy being constantly on edge and occasionally building elaborate tree forts that ultimately fail to protect you, this game is a wild ride.", 0.5454545617103577], ["Even though this game is coming up on its 7th year anniversary, it is just as enjoyable as when it first released! Brilliant game.", 0.523809552192688], ["The game is atmospheric when playing alone and fun with friends.", 0.523809552192688], ["I think it is a very good game to play with your friends, you need to discover each cave without the help of map.", 0.523809552192688], ["The mutants ruin it for me. If it was just cannibals/tribals, and building was less grindy in single player, I'd like it.", 0.523809552192688], ["good game a bit scary at times but with the right friends its a very good game", 0.523809552192688], ["This is a great way for not paying CHILD Support... no wonder people like this game", 0.523809552192688], ["one of the survival games that is suitable to play with friends, very exciting and challenging", 0.523809552192688], ["A decent survival game, with plenty of elements that are hard to digest.. literally...  Apart from that, I can vouch for the game to give you a nice eerie feel, and plenty of scare potential here and there. Glitches and bugs are plenty, but still the game is worth playing, especially with a friend. The co-op mode is pretty cool, and honestly the only way to play the game in my opinion.", 0.523809552192688], ["After mandatory 10min in the main menu to listen to the music, create a save and spend hours chilling in the forest, meeting some locals along the way. Oh and there is your son you are supposed to find, but that's not very important. \r\nFor me it's still one of the best survival horror games out there.\r\n10/10", 0.523809552192688], ["The Forest is a gripping survival horror game that blends intense exploration, resource management, and psychological terror. Stranded in a mysterious forest, players must craft, build, and fight off intelligent cannibalistic mutants. The eerie atmosphere, realistic visuals, and immersive sound design heighten the tension, especially at night. Solo play feels terrifying, while co-op adds strategy and fun. With its unpredictable AI and deep survival mechanics, The Forest offers a thrilling and unforgettable experience.", 0.523809552192688], ["I wouldn't call the game bad, but I felt lost most of the time I played the game, since most things are rather obscure, and I just didn't have the energy or time to actually learn the intricacies of the game, probably since I didn't enjoy it much.", 0.5220588445663452], ["i actually have never finished this game because i always played co-op with online friends that i stopped being friends with before we got to the end. the game is pretty buggy and very repetitive to where you're just sitting there bored and grinding for the same items over and over but it's easy because once you enter/leave a cave everything instantly responds so you can stock up on resources way too easily. it's fun to build with cheats on and make cute builds with friends and seeing what we can build together like it's minecraft creative. other than that i don't recommend this game, sons of the forest is slightly better but you can find better games out there. my overall rating for this is a 5/10.", 0.521276593208313], ["Very nice game for 1.5 euro realistic graphics and good gameplay", 0.5185185670852661], ["Initially on my first play through, this game seemed like anything but a survival open world crafting game, especially after playing games like Valheim and 7 Days to Die.\n\nIt is open world, but it's the same map no matter what, same seed, same locations, same caves, which I thought was really bad for a survival game. The reason for this is probably because this game has a story. When you start the game there is no sense of direction or what to do. I was very confused for this reason and ended up at the \"end game\" location without knowing it. I also thought trees didn't regrow, but I was wrong about that.\n\nI tried giving the game another chance 2 years later and this time I focused on taking it easy, explore every corner, read the clues and the notes to figure out what to do and what I need, and it ended up being a very interesting game. I really enjoyed the \"mysteriousness\" of the game that I initially hated, exploring the caves one by one finding new gear and clues to complete the story. Building a base, and the constant fear of getting raided by cannibals. The enemies progressively become stronger the longer you play the game. At the end of the day, it's still a pretty linear game since you need to explore the caves in a specific order, but that's something you need to figure out yourself so there's still some freedom in the game. As for the story, it didn't interest me that much, I only really enjoyed exploration, building, crafting, and surviving, planning my next steps. It can be a fun game but don't expect it to be a traditional survival game, and expect it to be linear.", 0.5168918967247009], ["Really fun survival game. Cannibals are challenging yet fun to fight and the atmosphere is really great. You will never have a horror experience like exploring a dark cave with a bic lighter while hearing screams in the distance.", 0.5081967115402222], ["很好玩的游戏，前期食物会自己上门，后期盔甲自己上门", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/242760/header.jpg?t=1699381053", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/242760/capsule_231x87.jpg?t=1699381053", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/242760/capsule_184x69.jpg?t=1699381053"}, "support": {"support_website": null, "support_email": null, "game_website": "http://survivetheforest.com/"}, "developer": "Endnight Games Ltd", "owners": "20,000,000 .. 50,000,000", "tags": ["Open World Survival Craft", "Survival", "Open World", "Horror", "Crafting", "Adventure", "Building", "Survival Horror", "First-Person", "Action", "Exploration", "Sandbox", "Singleplayer", "Atmospheric", "Simulation", "Gore", "Realistic", "Indie", "Zombies", "Early Access"], "languages": ["English", " French", " German", " Czech", " Finnish", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Swedish", " Traditional Chinese", " Turkish", " Italian", " Spanish - Spain"], "concurrent_plays": 6990, "number_of_achievements": 45, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "LAN Co-op", "Tracked Controller Support", "VR Supported", "Partial Controller Support", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "Simulation"], "short_description": "As the lone survivor of a passenger jet crash, you find yourself in a mysterious forest battling to stay alive against a society of cannibalistic mutants. Build, explore, survive in this terrifying first person survival horror simulator.", "long_description": null}