{"name": "The Binding of Isaac: Rebirth", "app_id": "250900", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£10.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 122351, "negative_reviews": 3407, "reviews": [["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10", 0.721429169178009], ["You run around as a naked midget spitting at people. You eventually meet a chick but she's trying to stomp you down because she hates people under 170cm, but she violently screams and hides away if you pretend to be a Jehovah's witness.\nDespite having \"binding\" in game's title, there is no shibari set in the entire dungeon.\nAlso I wasn't able to find a garbage plant because there is no bovine transformation, either. I think Steven lied to me…\n\nThis is one piece of trash. You should play it.", 0.6738166809082031], ["Best traumatic childhood simulator!\r\n\r\nThis game has a really unique artstyle and has tons of content through the dlcs. Every Run is different and Binding of Isaac never fails to suprise and challenge me. In addition to that you can really see the developers have put their heart in this game and created a really fun game. \r\nWith Friends this game is even more enjoyable.\r\n\r\nAll in all do yourself a favor and go beat Mommy!\r\n\r\n10/10\r\n\r\n\r\n", 0.6283783912658691], ["isaac has been a part of me for every chapter of my life. i always come back to it or more precisely, it always comes back to me. at my lowest and at my highest, isaac has been the backbone of my being. im afraid without it, i wouldnt have been able to type this right now. really thankful for edmund and the team for bringing us this gem of a game. isaac has been the perfect stand in for me, as of typing this right now im in the rebirth journey of my life. and hopefully just like isaac, i can find peace with myself and have the strength to shape my story just like in repentance.", 0.6118951439857483], ["Bro this is the best game if you have a toaster PC, nah but for real they don't actually make games like this anymore like what the hell, it's so simple let so addicting this game has been around for years and to this day it still gets supported that's insane nowadays games are one hit wonders they come out, shine for a year and just die off completely, similar to today's music, i highly recommend this game to anyone that wants to feel the 2000s style again, this game is a pure example of not judging a book by it's cover, don't get fooled by the graphics, yes it looks dated but who the heck cares the graphics don't make the game it's the mechanics of the game the pure skeleton that makes the game, love it.", 0.5454545617103577], ["Game good \ninsane replay value and just one of my personal favorite games since i first found it when afterbirth + came out", 0.5454545617103577], ["The Binding of Isaac is a really deep game when it comes to item synergies and what feels like millions of possible builds. Each item you pick up has the potential to change the way you play, like one might replace your regular tears with lazers or one makes you throw up big green explosive bombs, that do very high damage, but can also damage you, giving you a high risk, high reward play style. With around 700 different types of items to pick up and use, it offers a lot of variety to play with. \n\nAnd the game offers many different types of characters to play as, all with a unique and distinct play styles. One might be all about getting hit on purpose to build up damage for the remaining floor you are in while one is the complete opposite, and only gives you one hit before you go down, with the upside of flight and tears that can travel through rocks and obstacles, as well as an unique dice item, giving you a potential re roll of the item you might not wanna take, with the downside of it sometimes deleting the item. Its like gambling in a way, you will do that a lot in the game. Take risks that pay off, but also might backfire on you\n\nWhat i also like is the way achivements are tied to actual useful things. Each achivement you gain actually unlocks something new for you to find, like a new character, new floors, new paths to take and most importantly, new item unlocks. The achivement system is a good way to keep track off, what you might need to unlock next. \n\nThe one small negative i have to give is the game its the type of game you need a friend or a youtube guide to understand what to even do to unlock certain bosses or items. Its very cryptic and confusing if you dont understand it, but once you know, its easy to hop into the game and plan ahead where you want to go in your run, which boss you are working towards and so on.\n\nOverall a highly recommended game, if you still are unsure if you like it, buy the regular game game Rebirth without the dlc, try it out and if you like it, buy all the dlc. (small warning, you might have problems with converting the save from the rebirth to newest repentance + DLC, so if you want to avoid it, you could also just buy everything all at once. Its worth it and you get 200+ hours out of it)\n\n\n\n", 0.5454545617103577], ["10/10\r\nWould get just Rebirth then get DLC's when you like it and REP+ is free and does QoL changes and Co-op", 0.54356849193573], ["Ended up buying this game for myself after buying the first Binding of Issac and Rebirth for my partner as these were some of his favorite games. He ended up getting me interested in these games as well and I bought this one and all dlc so I could play online and its honestly been fun with repentance plus! Would recommend for just base game alone as you can do local multiplayer and have fun that way (though it is different without dlc), but dlc is constantly being fixed and updated along with repentance plus. Nothing is ever really the same between runs and as you play more, you get more characters you can unlock to change up the gameplay that much more and even cool challenges you can try by yourself or with friends. Be warned there's still issues with lag on online lobbies with repentance plus, but it is constantly getting better in my experiences so far.", 0.523809552192688], ["My name is Edmund\nI made the Isaac\nIt was difficult to put the items together\nBut unfortunately something went so wrong\nAnd now i cant do anything but sing this stupid song\nMy name is Edmund Edmund Edmund Edmund", 0.523809552192688], ["tons of replay value and each run is around 30-40 minutes so its a pretty fire way to pass the time when you're busy but got a little time to burn 9/10", 0.523809552192688], ["This is the best game I've ever played, saying that while writing a negative review is ironic I know however there is a problem that just happened to me halfway through my save file. I'm not sure what I did but I must have closed out of the game improperly recently and now all of my steam achievements have vanished. I'm not sure if there's anything I can do to change this other than redoing them on another file but if someone could help me I'd gladly change my negative review.", 0.5192307829856873], ["While this game is fun, its just not AS fun as many of the other games in its genre. The animations and everything about the game are just fine! fun to look at even. There were however some mechanics to the game that I just didn't enjoy. The turds were too tough. The 'upgrades' were not very substantial sometimes. And acquiring a build was entirely left to RNG. I 'beat the game' after a matter of 3 hours but that was only because I got a couple of ridiculously strong upgrades that just happened to synergize.  The lack of a choice make the only way to play just blasting through as fast as you can to acquire some kind of wild build that actually works and dying about 50 times before each good run. Again, a decent entry into the genre and fun artwork but I prefer a game that has more strategy and choice involved in my runs. I'm sad to give it a 6/10.", 0.5116279125213623], ["This game has its claws deep in my spinal cord and every time I try and move away it jingles my vertebra like keys.\n\nvery good, would recommend.", 0.5], ["One of the games that will forever remain a mystery to me. No matter how many times I try, I just cannot get into it. The items seem to be luck-based more than anything; and I understand there are ways to take advantage of the tarot cards/dice in order to reroll and stuff, but that aspect just isn't fun to me. Most of the game's mechanics require the Wiki, and even then, there are too many secrets that you would have no knowledge of without watching a Youtube video or reading up somewhere. Actually engaging with just the game itself is impossible for me; the gameplay loop is constantly interrupted with reading.", 0.5], ["This game goes from a simple fun game to an absolute grindfest where you'll blink and two days will have passed. Recommend 10/10", 0.5], ["It's insane the amount of replayability this game has, even by Roguelike Standards.", 0.5], ["Amazing game, your ass will burn right after you die in a mom boss room when you had a hard run :)", 0.5], ["This was my first steam purchase over 10 years ago and I still play this game to this day. It is one of the best rogue-lites ever developed and made even better by the constant support from the dev team. My heart still races when I encounter some of the final bosses as they've done a great job with balancing the game over the years. 11/10. Get rid of spiked chests tho.", 0.5], ["Amazing game can be frustrating with so much luck involved and if you just have bad luck as a person but its so rewarding when you do have a great run and unlock that next section", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/250900/header.jpg?t=1731977365", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/250900/capsule_231x87.jpg?t=1731977365", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/250900/capsule_184x69.jpg?t=1731977365"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.bindingofisaac.com"}, "developer": "Nicalis, Inc., Edmund McMillen", "owners": "10,000,000 .. 20,000,000", "tags": ["Action Roguelike", "Rogue-like", "Indie", "Replay Value", "Difficult", "Pixel Graphics", "Dungeon Crawler", "Great Soundtrack", "Singleplayer", "Dark", "2D", "Local Co-Op", "Remake", "Gore", "Procedural Generation", "Rogue-lite", "Atmospheric", "Co-op", "Action", "Horror"], "languages": ["English"], "concurrent_plays": 26649, "number_of_achievements": 640, "categories": ["Single-player", "Multi-player", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Action"], "short_description": "The Binding of Isaac: Rebirth is a randomly generated action RPG shooter with heavy Rogue-like elements. Following Isaac on his journey players will find bizarre treasures that change Isaac’s form giving him super human abilities and enabling him to fight off droves of mysterious creatures, discover secrets and fight his way to safety.", "long_description": null}