{"name": "7 Days to Die", "app_id": "251570", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£37.99", "final_price": "£24.69", "discount_percent": 35, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 100896, "negative_reviews": 13642, "reviews": [["The devs got tired of making a survival sandbox game and instead of making a new game from scratch, they decided to absolutely destroy their already half-successful survival game. By slowly taking away survival features, contorting it update by update slowly pulling it apart, taking away features and over-simplifying mechanics they remove any resemblance of realistic sandbox survival, replacing it with arcadey RPG elements. Below is a relatively short list of ways the game has completely dissolved from what it once was\n\n-You can no longer fill jars with water to boil, you have to \"quest\" in order to obtain the materials for a 'dew collecter' which is the only way to collect water from nature.\n-You no longer gain skills in the relevant category (mining = mining xp), instead like in an rpg, you can freely choose to use your skill points however you wish. Bashing zombies means you'll be a world renown chef in no time!\n-You now have to clear POI's aka Dungeons to get anywhere in the game, oh and just to be sure it's a REAL RPG, it even has a difficulty meter neatly placed on top of your screen, giving you META knowledge on whether or not it's too difficult for you. This also gives the player a very nice RPG way of knowing if the POI is even worth their time, as the difficulty scales loot.\n-You also HAVE to complete quests now, that is if you want to get anywhere in the game. Yes, the hallmark of the RPG, questing... unless you actively quest for the traders, you'll be stunted in your progress and will have a hard time getting anywhere. Oh, and when you're done you'll be rewarded with 'gold', 'skill books' and 'loot'. God I love having to run errands in my survival game, it really immerses you in that zombie apocalypse vibe.\n-You'll now need to complete many of these quests, because the only way to reliably gain skill books (which is the only real way to unlock new crafting recipes for tools and equipment) is by questing for them, thus soft-locking progression behind the questing system.\n-You liked being able to customise your character to your liking with a broad range of gear? Well that's too bad, because this game wants to be an RPG, so now you only get 4 slots where you can put VERY specific pre-made outfits, and there will be no customisation, because 'outfits' give buffs when you have the entire set, again, soft-locking character customisation.\n-Did somebody say RPG? Well, where are the potions? Oh there they are, disguised as 'candies'. They act exactly like potions, granting the player magical powers like increased resource gain, experience and loot boosts. You can buy these potions from the trader, where they'll be waiting neatly packaged in a vending machine, straight from the post-apocalypse candy factory.\n-And together with this it's also been decided that every dungeon should have a pre-determined path. Instead of looking through houses, scavenging every room and looking for hidden items, the game should feel like an RPG, and everyone knows that a dungeon needs a clear path to follow and a nice big loot room at the end, so that's what they did. Houses and other POI's now have a neatly placed hole in the wall or open door etc. that holds your hand as you traverse through the dungeon, leading you to the price at the end of it, all without having to smash a single door and all stacked together so that there's no mistaking it. \n\nAgain, this is just what popped up in my head, there's loads of other changes that either made the game a horrible sandbox survival game, or helped turn it into an RPG. I feel sad, this game used to be amazing, now you're forced to play the game how the devs want you to play it. I mean they even removed the Sandbox tag on Steam\n\nShame on you Fun Pimps\n\n\n", 0.9024150371551514], ["The concept is that at some point, there was a serious disaster.  Now, every 7 days the moon turns red and hordes of zombies come to try to kill you.  Further, zombies are everywhere, usually moving slower during the day and faster at night.  They hunt you if you get close enough.  Otherwise the world is our world with the standard day night cycles, nature etc… Well, at least that was the original concept of the game..   \n\nIt used to be a logical open world that was tough to survive in but the physics and requirements for survival and crafting was the same as IRL.  You could learn the basics by doing and better stuff by finding specialist books that covered that subject. Sadly, that is not the case anymore.  Now you have to find magazines, lots of magazines. \n\nYou used to be able to make weapons, progressing in a logical way from stone clubs and stick bows and arrows and spears to a pipe blunderbuss with pebbles for ammo to a single shot pipe shotgun with real shot to pipe revolvers to pipe machine guns with very small mags to better versions of each until you got up to m60’s and sniper rifles and compound bows.   Now, well now you can make a pipe machine gun, with that complicated machine gun firing mechanic on day one, no magazines required.  But don’t worry you won’t be able to cook anything and grass clothing is all you can make too.  How does that make sense? \n\nYou used to be able to make armor pieces of different types and jumble them together to get the type of armor coverage and movement you wanted. The armor you made even looked like you had patched stuff together to make them.  Now you have “Sets”. Each piece gives you some magical special ability and if you have the whole set there are magical set abilities.  They don’t say it’s magical but in practice it clearly is. I mean really?\n\nThere was a logical progression of building from simple wood to reinforced wood to stone to reinforced stone to cement to rebar reinforced cement to steel.  Not so much now. \n\nCrafting was first do it to learn it, then became perk based (experience let you learn stuff), and now became you don’t know jack and can’t learn jack and thus can’t craft jack, (or cook jack), UNLESS you find enough magazines on the subject.  Specialist books do still exist to provide extra’s.  But wait… you can still make that pipe machine gun right off the bat, and you can still build wood buildings…… No magazines required. This makes sense why? \n\nThe natural world used to follow the rules of nature.  That is, you could melt and then boil snow to make potable water; you could gather water from streams and lakes to boil so you could drink it safely; you could even drink water from the lakes or streams in a pinch and hope you didn’t get sick.  You could find wild berries, (Snow berries), in abundance in the snow biome to survive on for a bit.  Yes, there was a small chance they would make you sick too but that was usually better than starving.  Now, well now you can’t melt snow nor gather water from lakes or streams. The only way to get water is via a Dew Collector.. yeah. Hope you find those magazines you need fast so you can figure out how to build it.  Wonder what wildlife uses?  Well, you could always buy water from a vending machine or trader.  Oh yes, you can also hope to find something to drink in a zombie infested house or building… \n\n\nZombies.  Zombies used to behave logically for a zombie.  They would wonder around until they spotted someone and then they’d try to go eat that someone.  Sometimes they would try to eat the wildlife and/or fight wildlife. They could fall “asleep” or comatose in buildings and could wake up if disturbed.  During a blood moon, they would become stronger and crazed and KNEW where you were and came in a horde to get you.    Now, well it’s a bit different.  Now zombies wall themselves into walls, ceilings, you name it and wait for you.  Now, they can appear, literally out of thin air if you step on the software coded “trigger” block or area.  Stealth or no stealth, that trigger block still creates the zombies and they will all agro on you. \n \nQuests:  At first, quests didn’t even exist.  Now, well now they are your life blood.  They are how you reset buildings you already cleared of zombies and loot.  They are how you get that money you need to buy those special books you can’t find, from the trader or those crafting centers (Forge, cement mixer, etc), you haven’t found the magazines for yet.  What about a nice gun or extra ammo or, early on, the basics.. Food and water.   Doesn’t feel so much like an open survival world when you have to go to a quest provider all the time. BTW, the quests are limited in that they repeat.  You end up doing the same quest at the same buildings, over and over and over and… \n\nTraders:  It used to be a specific trader could be in a forest zone in one area and a desert in another etc.  They were not tied to a specific biome.  Now they are and that, my friends, is simply sad.  I say this because the traders are not generic, they have their own personalities and to some extent specialties. So now you are Forced to go to a specific biome to find that trader you like.  They simply won’t exist in any of the other biomes. \n\nStory line:  The game starts out with an interesting storyline beginning teaser, which is also alluded to by at least one of the traders in one of their statements to you.  Yet, as of this writing, April 2025, no story has emerged.  This is sad to me as it seems such a story could be easily put together, especially with the quest system in place. \n\nLastly, even after all these years in development, the basic block on block building problem remains.  The ground blocks have a different orientation than the above ground building blocks.  They don’t mesh smoothly.  So, when you are trying to build say a driveway, you end up with an entry slope block that does not smoothly go to the ground of the next block.  Rather, there is either a ledge or a deep crack between the blocks that bikes and motorcycles usually can’t cross and other wheeled vehicles may or may not cross with a significant bump and resulting vehicle damage.  \n\nFor me, this has been a sad downhill ride.  I was so excited at the beginning, everything was logical to me and natural.  Now it’s all contrived and not at all realistic in the game play on even the basics.   \n\n\n", 0.69565749168396], ["Was a great game during its many alpha stages and has come a long way with performance and content. \nBut the game since going into 1.0 has suffered with an identity crisis between being an open ended survival game like it used to be and a linear RPG in the sense that you are expected to play how the devs want you to play instead of playing how you would like.", 0.6057491898536682], ["The devs have no idea what they want to do with a game.\r\n\r\nIt went from an Open Sandbox Survival game to an RPG Sandbox Survival game where your options to approach things have been severely reduced and u won't get better at X thing by doing it. Instead u must shoot zombies & do Quests so you can get better at Cutting Trees or Crafting better gear\r\n\r\nYou MUST also know what you're doing, by watching some guides & videos. U must choose a class, which also limits what weapons u can use properly. U want to use clubs & Shotguns? Go for Strength, but wait... This Rifle & SMG are really good, also this pistol is quite nice... Now you must spec into Rifles, SMG & Pistols which all have different trees & point requirements in their respective category... But damn, I also need to spec into faster digging, faster mining, electricity, crafting, workbenches, vehicles, fuel, chemistry, medicine, Quest rewards, Quest EXP, Faster looting, Better rewards, Better loot rewards... Damn... Where my points go? Why am I so weak? Go figure... Stick with a main build and main weapons for one playthrough otherwise forget it, if u want other quality of life things. Use mods or edit the files for more points per level\r\n\r\nYou can find what u need to progress on either day 1 or Day 20, thank you RNG and RPG elements. It's fine to cheat your Forge Ahead magazines if u still haven't found enough to craft a forge on Day 10... But wait, you have 90 in Robotics and 70 in Medicine at least cause of all the damn magazines and RNG\r\n\r\nForce players to engage with Quests by sending them to a Trader as soon as they spawn when they finish their tutorial in a matter of seconds or minutes. Grab a quest, go to a Quest Marker on the map, click on it when u get there, now follow the ,,Dungeon\" aka the Building u arrived by going through the loops that the devs hand crafted for you, for each building. It's fine if u get confused and just carve your way through the walls, but that'll make the devs sad :( cause that's now how you're supposed to play the game. \r\nBy getting to the end of the ,,Dungeon\" you'll be met with lootboxes.\r\nThe moment u interact with a Quest near a Building, it will reset the entire zone, so everything u build, destroyed or harvested will be reset as it was. Use this to your advantage and destroy your immersion \r\n\r\nU can also eat candy to mine faster, shoot better, lockpick 100%, negate fall damage. Totally realistic and fair. Jump 10 meters, explode harder & ride faster.", 0.5862466096878052], ["its a good game but the lockpicking is so bad it makes me want to uninstall, the rng breaks lockpicks right at one second left and it resets it to 3 or 4 seconds so most of the good loot you cant access making the game stupid and annoying.", 0.581994354724884], ["Fun games lots of replay-ability. Even if you get bored with the vanilla/base game the mod community has made amazing mods/overhauls you can easily install to experience new things in game.\n\nRecommend playing with friends to have a great experience, but playing solo is still fun.", 0.5658990740776062], ["Zombie games scare the heck out of me!! But 7 days is my absolute favorite crafting survival game and the zombies just make it a lot more exciting.  Very very fun to play with friends especially for some of the more intense quests/adventures.", 0.5608775615692139], ["Well, after several patches, this game has some serious performance degradation. The difficulty has been nerfed so much that even an encounter with a single zombie mob during daylight in a no-difficulty zone has turned into an epic battle. Guess some \"purist\" clique got their ear. So far, it's not worth the consideration. Perhaps I am a niche player not worth considering. Having all the achievements except the online ones, I will now bury this trash next to other games that suffered a similar fate, where devs listen to the loudest and most stupid suggestions.", 0.5603588223457336], ["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☑ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☑ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10", 0.5504852533340454], ["Back in 2016, i first played this game. It was in its first betas, and I was scared shitless as a 8 year old kid playing this game but it was absolutely fun. Finding guns, building bases, having no direction but still going in one anyway. I bought the game at around roughly 10 dollars, and building, crafting, and looting was pretty janky but still had that indie charm that I came to love over the years. Whatever i came back to now that's apparently 35 dollars more, quest based, limited creativity mess that still looks the same after 9 years? absolutely can't believe the sale is still around 30 dollars. Whatever mind is behind the thought process of ruining an already only okay game was absolutely astonishing. Quest system is weird and out of place, limits house building since you have to live nearby so you can do quests all the time. When I came back and had to reinstall this is what stayed the same after that many years:\n* Zombie AI is the same, buggy and slow but new zombie types that are ALSO pretty janky.\n* building textures are just resolution raised since i was on like 1080P and now its 1440.\n*I saw many of the same textures from when i first played still used now, which can be fine but they werent great in the first place.\n*Physics are basically non-existent, its like never planned on giving it a try except for like fall damage.\n*basically a 3/10 version of rust without the PVP. (I don't even like rust)", 0.5494168996810913], ["I got this game when it was $15 and before they revamped the whole game, the game is great now, but I cannot tell you to get the game for $45 to me that price tag is just too high", 0.5488958954811096], ["I cannot play this game without mods, Its a great game to mod, base game is alright, its essentially a really good canvas for mods community go hard ngl", 0.5454545617103577], ["This is a fun replayable game and great fun in multiplayer. Also this game has a great number of Mods that can be played via PC making it even more challenging.", 0.5416666865348816], ["About 11 years of early access, and when it finally came out, nothing really changed. The graphics are not good for 2024, and the game is too repetitive. Also, without Steam Workshop, there isn’t much to do.", 0.5398589968681335], ["A zombie game that likes to dig up my house (annoying, lol)\r\n.\r\n.\r\n.\r\n.\r\n.\r\n\r\nRating\r\n\r\n---{Graphics}---\r\n☐ You forget what reality is\r\n☑ Beautiful ( If it's version 1.1, I'll rate it Potato. )\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ 16 bit\r\n\r\n---{Gameplay}---\r\n☐ Very good\r\n☑ Good\r\n☐ It‘s just gameplay.\r\n☐ Not good\r\n☐ Bad\r\n\r\n---{Audio}---\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ Mario sound\r\n\r\n---{Audience}---\r\n☐ Everyone\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ The elderly\r\n☐ Harland David Sanders.\r\n\r\n---{PC Requirements}---\r\n☐ windows 98\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast PC ( Maybe more for loading maps and zombies. :D )\r\n☐ alienware\r\n☐ NASA computer\r\n\r\n---{Difficulity}---\r\n☐ Just use mouse.\r\n☐ Easy\r\n☑ Easy to learn / Hard to live.\r\n☐ Difficult\r\n☐ Dark Souls IV\r\n\r\n---{Story}---\r\n☑ No Story?\r\n☐ Memo\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It‘ll replace your life.\r\n\r\n---{Game Time}---\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ Infinity\r\n\r\n---{Price}---\r\n☐ It’s free!\r\n☑ Worth the price.\r\n☐ Not Worth.\r\n☐ You just burn your money.\r\n\r\n---{Bugs}---\r\n☐ Never heard of.\r\n☑ Minor bugs.\r\n☐ Can get annoying.\r\n☐ There are bugs every 1 minute.\r\n____________________________\r\nFor this game.", 0.5374541282653809], ["Absolutely love the game..but i have to give it a negative review\nPrice tag of 43.99€\nDevelopment isn't going as it should be, sorry.\nMultiplayer just dies on horde night, zombies either lagg or fps tanks\nWe're all using rtx 4070-90, i7 14700k or new i9's so it's not our hardware, also all on fiber internet\n\nI'd love to see the game either re-done in a new engine, i'd pay 99.99$ for it again, just to be re-done\nBut i can't recommend it right now.Sorry.", 0.5348837375640869], ["Game was in early access for over 10 years and was abandoned on consoles than resold on the next gen. The game isn't what I don't recommend its the people that make it.", 0.5320302844047546], ["Not worth $44.00, Bland and bad graphics.", 0.5314591526985168], ["Don't buy, this studio has the tendency to change the game loop around a lot (without ever delivering a stable build) it also cheated it's long term supporters and disregards the wishes of it's community.\n\nMalevolent business practices like this developer has shown, must not be accepted by us as a community otherwise we encourage more developers to conduct themselves the same way this studio has done.\n\nBe smart, vote with your wallet and keep the gaming market a bit cleaner tomorrow.", 0.53125], ["The most unoptimized game of all time. This is an absolute joke of an attempt of game development. And you guys are about to publish version \"2.0\"? More like version 0.0.2 alpha test release.", 0.5309562683105469]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/251570/header.jpg?t=1736194886", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/251570/capsule_231x87.jpg?t=1736194886", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/251570/capsule_184x69.jpg?t=1736194886"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.7daystodie.com"}, "developer": "The Fun Pimps", "owners": "10,000,000 .. 20,000,000", "tags": ["Survival", "Zombies", "Multiplayer", "Open World", "Open World Survival Craft", "Base-Building", "Voxel", "Post-apocalyptic", "Online Co-Op", "Building", "Exploration", "Sandbox", "FPS", "Simulation", "Character Customization", "Tower Defense", "Action", "Strategy", "Horror", "Procedural Generation"], "languages": ["English", " French", " German", " Spanish - Spain", " Italian", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese", " Turkish"], "concurrent_plays": 39430, "number_of_achievements": 43, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "LAN PvP", "Co-op", "Online Co-op", "LAN Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Includes level editor", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG", "Simulation", "Strategy"], "short_description": "7 Days to Die is an open-world game that is a unique combination of first-person shooter, survival horror, tower defense, and role-playing games. Play the definitive zombie survival sandbox RPG that came first. Navezgane awaits!", "long_description": null}