{"name": "Rust", "app_id": "252490", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£34.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 423947, "negative_reviews": 62678, "reviews": [["this game is by far is the most family friendly game ever the community is friendly and helpful its hard to find people that swear or unfriendly", 0.766541063785553], ["I have around 2k hours on this game throughout the last 2 years or so, and never more has a game made me want to slowly shove small chunks of glass up my urethra until i piss nothing but bloody cum. I could not hate this game more than i do. I load onto a server and get my ballsack smashed everytime i try to walk off of the spawn beach, i cannot find a singular piece of cloth anywhere on the entire fucking 30 grid map. I love spending time just to either get offlined by a shitty chinese man with 23 hours on the game or get onlined in my 2 by 2 by a 20 man russian zerg that has never left their homes in saint petersburg, Russia whos pc's run for 189.778 hours a week afking their 4 grid long and 7 grid wide base making sure they dont get offlined while their tm8s off of cragislist farm sulfur to raid another 2 by 2. Great game would recommend to people looking to gain  hundreds of pounds and never speak to a woman again.", 0.7079290747642517], ["This game offers the unique experience of being dropped into a hostile world with no instructions, no guidance, and no mercy. The learning curve is less of a curve and more of a vertical wall. Death results in the loss of your entire inventory, followed by the pleasure of being spawn camped and raided at 2:00 AM by dedicated Eastern European players. They thoughtfully max out their mics and scream at you in Baltic languages over proxy chat, adding a personal touch to the experience. Wild animals round out the fun by routinely beating you to death. Overall, a relaxing way to unwind.", 0.6762699484825134], ["great game other than being offlined by 40 yr unemployed male failure's to society", 0.6456692814826965], ["Rust is a brutal but addictive survival game. The thrillif raiding,building, and PvP keeps it exciting, but expect betrayals and a steep learning curve. '' Not for faint of heart''", 0.6370949149131775], ["i get ass raped by cheaters and people with more time on the game then i have living but when these 8 year old children are screaming slurs it makes it all worth it", 0.6021663546562195], ["Games very fun recommend buying it if your racist and want a game to be attached to\n", 0.5779756307601929], ["The most addicting game I have ever played. Nothing in life compares to the adrenaline and fear I get from rust bag fumbling", 0.559808611869812], ["Used to be a good game until they made it for role players and little kids. Weapons don't require skill anymore. On top of that the animals are more dangerous than people. You can kill 10 people with guns but die to a stupid fucking wolf or bear from behind before, during, and after fights.", 0.5586116313934326], ["If you dont have a really good PC or really good internet dowlaoding the assets when loading into a game takes a ridicuosly amount of time like 2 hours just to get in a server", 0.5306012034416199], ["The game is starting to feel like it suffers from the blueprint issue and specifically blueprint bloat. All progress is tied to scrap, and scrap is so hard to achieve when there are clans, cheaters, and general just bad actors. Originally, Rust rewarded players for grinding a bit and reinforcing, now we're forced to engage in combat to make progress or just get raided and lose the hours of progress you spent.\n\nI used to enjoy Rust, and while I had some good times with the current patches, I don't like playing it as much as I enjoyed watching it. Call it a skill issue, but gaming it's my job and I don't want it to FEEL like one.", 0.523809552192688], ["GET READY FOR CHEATING AND HACKING! \nI have yet to play on an official server that is not full of aimbots and ESP users, I know in 2025 all games are bad, but it has been terrible lately. Admins are non-existent and let repeat offenders back in no big deal. Not sure what anti-cheat software they use, but it is straight up pathetic. If you buy this game and actually want to play without cheaters prepare to use private servers. Unfortunately that's where we're headed next, and the multiplayer environment is one of the best aspects of Rust.... not with cheating though. \n\nI do like playing the game, but with the toxic players it becomes very hard to play at points....", 0.523809552192688], ["if u wanna loose ur social life and wake up to hearing footsteps and rockets going of hallucinating and being scraed when u go off play this game", 0.523809552192688], ["I would rather put my d in a blender than grind this game. I would rather watch paint dry than playing this game. i would rather eat a hot dog sand which, and be hot asf outside than play this game. 100% buy this game tho.", 0.523809552192688], ["Unless you love smashing your face against the wall while cheaters run you down, don't play this.  The updates are really cool, and the DEVs are trying to make this game fun but it's so riddled with cheaters and clans that unless you are unemployed this is unplayable.", 0.523809552192688], ["qsuch a fun game, I loved playing this game and played it since alpha! RECOMMENBD!", 0.523809552192688], ["Very family friendly, low end game for bad pc, can play for 1-2 hours a day for the employed people. PVE based game", 0.523809552192688], ["Rust on PC is a brutal, survival game where players build, raid, and fight to stay alive. With intense PvP, resource management, and constant threats, it’s both rewarding and unforgiving.\n\n10/10 OwO <^-^<", 0.523809552192688], ["Fun to build and that type of stuff but the amount of hacks make it not any fun for people who dont.", 0.523809552192688], ["Best game ever created, try it out and see for yourself! Ps. You will not stop playing!", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/252490/header.jpg?t=1738927718", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/252490/21aac0b6e20e1ba12f635e7deb730e32a51afbd5/capsule_231x87.jpg?t=1738927718", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/252490/21aac0b6e20e1ba12f635e7deb730e32a51afbd5/capsule_184x69.jpg?t=1738927718"}, "support": {"support_website": null, "support_email": null, "game_website": "http://rust.facepunch.com/"}, "developer": "Facepunch Studios", "owners": "20,000,000 .. 50,000,000", "tags": ["Survival", "Crafting", "Multiplayer", "Open World", "Open World Survival Craft", "Building", "PvP", "Sandbox", "Adventure", "First-Person", "Action", "Nudity", "FPS", "Shooter", "Co-op", "Online Co-Op", "Indie", "Post-apocalyptic", "Early Access", "Simulation"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Russian", " Simplified Chinese", " Ukrainian", " Polish", " Portuguese - Portugal", " Turkish", " Arabic", " Czech", " Danish", " Dutch", " Finnish", " Greek", " Norwegian", " Portuguese - Brazil", " Spanish - Latin America", " Swedish", " Traditional Chinese", " Vietnamese"], "concurrent_plays": 130057, "number_of_achievements": 92, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "In-App Purchases", "Valve Anti-Cheat enabled", "Stats", "Remote Play on Tablet"], "genres": ["Action", "Adventure", "Indie", "Massively Multiplayer", "RPG"], "short_description": "The only aim in Rust is to survive. Everything wants you to die - the island’s wildlife, other inhabitants, the environment, and other survivors. Do whatever it takes to last another night.", "long_description": null}