{"name": "Rocket League®", "app_id": "252950", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 195520, "negative_reviews": 29208, "reviews": [["making the game free was the worst idea. full of the worst kinds of people and you know who i'm talking about", 0.6026608943939209], ["Best of the best. I think it should be awarded for being the HARDEST game in the gaming history. There's more BILLIONAIRES than Supersonic Legend's ( Best rank. )", 0.5823095440864563], ["Hands down the game I've put the most hours in. I probably have another 1500 hours across various platforms (Rookie numbers, I know) and I'm still trash at this game. \n\nAnyone that says this game sucks, no my friend... We suck.", 0.5742785930633545], ["I bought this many years ago from steam. Now I need an epic games account to even play local multiplayer. I do not want to make an epic games account. I want to play the game I bought. Absolute fraud and illegal in many countries. Shame on you.", 0.5629138946533203], ["First of all, making this game free was a horrible idea. It's full of sh*tty people. Second of all WHY THE F*CK DID YOU REMOVE THE TRADE, they took all the fun out of the game. If you didn't started the game and considering giving a shot. DON'T. If you stuck with this game, REMATCH (yes the football game) is much better option and even its beta has more balanced matchmaking than this sh*thole. We don't give a tiny damn about collabs you are bringing in. Servers are sh*t, lobbies are full of boosted people, even in Champion/Diamond lobbies. Reporting a player is a joke, absolute joke, it doesn't work at all. I am sorry to myself playing this much of this darn game.", 0.5480557680130005], ["Used to like this but suddenly now can't play it because it's forcing me to log in on browser with an account I don't have so until it's fixed it's essentially bricked for me.", 0.5257062911987305], ["Fast pace.  Short matches.  Easy to jump in and out of game play in a short window of time.", 0.523809552192688], ["[h1]Rocket league[/h1]\nwhere do you start? The answer is you dont, this game is one of the very few games you cant just pick up and be good at it actually takes time to be good at it takes time to understand the game and its mechanics to understand the community i have over 6k hours over all accounts and have peaked high gc 2 after that the game becomes super super comp and takes dedication and time i just dont have anymore the game has become far more than what anybody scoped from SSTARPBC to the year 2025 Rocket League this game is not  for the weak minded or easily distraught, the community can be very toxic and will put you down if you cant triple flip reset musty psycho sting pop ceiling shuffle triple tap sandwich 7 heli reset breezi bar down and even IF you manage that youll just be called a sweat and a no life and jobless so, with that being said play the game how you want to play it and dont let anyone bring you down the game has freedom for every player on the field no matter 1v1 2v2 3v3 and even 4v4 if your manic enough to play, to have different skill sets and playstyles", 0.523809552192688], ["ass game\nedit \nThis is the worst game i have ever played the matchmaking is worse than dota 2................", 0.5206022262573242], ["The devs don't care about this game anymore. It used to be great, and then they got greedy. It still has it's moments for the individuals that fell in love with it when it was new and flashy. Now it's old and outdated, I'd say wait for the sequal, but everyone knows it'll never happen..", 0.5121951103210449], ["Been playing since 2015 but now I cant even play one fucking game without lag and there is to many smurfs in low ranks. I uninstalled and wont be playing anymore.", 0.5098039507865906], ["SBMM needs to die. it ruins games and definitely does here. im new to the game and im playing against gold and platinum players", 0.5080275535583496], ["Steam Review (English)\n\nI've played Rocket League for about 210.6 hours, and it’s been an incredibly fun experience. The gameplay is fast-paced, exciting, and easy to pick up but hard to master. The cool cars add a unique twist to the classic soccer formula, making every match feel fresh and entertaining.\n\nWhat I love most is how quick the matches are – they keep the action nonstop, and there’s no time wasted. The community is generally friendly, and I've had a lot of positive experiences with teammates, which makes the game even more enjoyable.\n\nIf you're looking for a fast, competitive, and fun game to play with friends (or solo), I highly recommend Rocket League. It’s one of those games you can just dive into and have a great time every time.", 0.5062761902809143], ["Rocket League is an All-time great game with each game only lasting 5 minutes.\r\nYou can choose how serious you want to take the game, and the skill ceiling is plenty large for anyone.\r\nLow ranks are extremely fun and high ranks are very satisfying. The game is also free which is a huge plus.", 0.5062761902809143], ["Can no longer play Fuck Epic for requiring me to have an Epic account to access this game.", 0.5053004026412964], ["This is one of my childhood favorite games, be glad you can't buy it here anymore because epic games essentially ate the game, threw it up then ate it again, crapped into metal box and then shipped in on a cargo ship out in the sun for 4 weeks to get to Australia in which spiders opened the box and crawled into the game and started playing it. If you ever wanna meet one, just play ranked until you make it to platinum and then find one player that only skips a goal replay if they didn't score it.", 0.5047212243080139], ["I started this game out on PS , where i put roughly 2000 hours in..now , after an additional 2277 hours into the PC version..this game has become absolute trash. Friends and I called it when Epic first took over that the game would go downhill , as it has. Epic has become more concerned with releasing a new car/decal/trail/etc every week/other week instead of keeping servers running smoothly or fixing the bugs in the game. the new items were OK at first , but seeing as they're now charging $25USD per car , or $20USD for goal explosions , its honestly just become a stupid moneysink. Do yourself a favor and go play Rematch when it fully releases instead of the hot pile of garbage that RL has become.", 0.5038276314735413], ["I have 1200 hours in this game, haven't played for a while and now I'm locked out by some epic games bullshit. fuck epic!", 0.5038276314735413], ["Bring back Snowdays and keep it in there you cowards. Preferably ranked but I would accept it just coming back and staying as a casual mode", 0.503311276435852], ["Worst game I've ever seen, no updates, a toxic community you've never seen, even the local dealer isn't as toxic as that, seriously... Insults in every game, postponements in every game. And gameplay-wise, between your teammates who ff when you barely take a single goal... useless updates, “new maps” every 3 months that “just” add grass... IG bugs where you pass through the ball, cardboard servers... Nothing goes...", 0.503311276435852]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/252950/d56cf9d01073d893677fb9e7e257b79fd7939ee3/header.jpg?t=1741975345", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/252950/22565fe74a11fe5742c11580ec7baed616df31f3/capsule_231x87.jpg?t=1741975345", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/252950/22565fe74a11fe5742c11580ec7baed616df31f3/capsule_184x69.jpg?t=1741975345"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.rocketleague.com/"}, "developer": "Psyonix LLC", "owners": "10,000,000 .. 20,000,000", "tags": ["Multiplayer", "Football (Soccer)", "Competitive", "Sports", "Racing", "Team-Based", "Online Co-Op", "Football (American)", "Fast-Paced", "Co-op", "Action", "Funny", "Great Soundtrack", "Local Multiplayer", "Split Screen", "Local Co-Op", "Singleplayer", "4 Player Local", "Casual", "Indie"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Dutch", " Portuguese - Portugal", " Japanese", " Korean", " Russian", " Turkish", " Polish"], "concurrent_plays": 16632, "number_of_achievements": 88, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Shared/Split Screen PvP", "Co-op", "Online Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Cross-Platform Multiplayer", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "Partial Controller Support", "Steam Cloud", "Stats", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Action", "Indie", "Racing", "Sports"], "short_description": "Rocket League is a high-powered hybrid of arcade-style soccer and vehicular mayhem with easy-to-understand controls and fluid, physics-driven competition. Rocket League includes casual and competitive Online Matches, a fully-featured offline Season Mode, special “Mutators” that let you change the rules entirely, hockey and...", "long_description": null}