{"name": "Cities: Skylines", "app_id": "255710", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "USD", "original_price": "", "final_price": "$29.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 88658, "negative_reviews": 6639, "reviews": [["\"Z:\\Games\\steamapps\\common\\Cities_Skylines\\Cities.exe\" %command%\n\nRight click the game in your library\nGo to properties\nPaste this line under launch option, replacing the file path with your own\n\nEnjoy the game without needing paradox's dumbass launcher", 0.9543991088867188], ["---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☑ 7\r\n☐ 8\r\n☐ 9\r\n☐ 10", 0.6774193644523621], ["The sheer amount of dlc makes me regret buying this game. And on top of that it hasn't been reasonably priced even 10 years later. I got 20 hours out of this game and never touched it again because the base game is missing a lot. Not sure why the simulation genre is so riddled with this horrible trend where there are 100s of dlcs all priced 10+ dollars each. And on top of that, Paradox requires their useless launcher for the game. I won't be buying Cities Skylines 2 and I am now wholly uninterested in games made by paradox.", 0.5820139646530151], ["Have been playing this since it came out, so over 10 years now. This is definitely THE BEST city building game. Enjoy every second of it. Especially with the mods from Steam workshop, you can make everything you want come true in this game. Yes there is a Cities: Skylines II but you should not go for that given all the crappy bugs. CHOOSE THIS ONE instead.", 0.5721357464790344], ["~just my opinion~\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☑ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10", 0.5416666865348816], ["This game has made me rage quit more than any first person shooter game I've ever played. It's addicting but extremely complicated, and the tutorial was hardly a tutorial. I find myself constantly googling how to do various things because the \"tutorial\" did not show me how. Once i think i'm in the clear, things go straight back into the shitter, and end up losing all the money I've made, and is damn near impossible to get back. I thought this was going to be a fun and relaxing sim tycoon game, but I was very very wrong. So glad i bought this when it was on sale for $2.99 instead of paying full price. Could be a skill issue, sure. I will continue to play the game because I do enjoy playing it when things go well, and hope to get better in the future, but i'm just not understanding why it has to be so extremely difficult from the get go. Again, the tutorial was hardly a tutorial. For a game that is so in depth, it needs an in depth tutorial.", 0.5387097001075745], ["I'm not review bombing over DLC or the state of CS2. But I'm coming back to this game after a bit of a hiatus. In the meantime, I've played Workers and Resources, OpenTTD, Transport Fever 2, and Rail Route in this niche of gaming. The thing that just baffles me right out the gate, starting a new map, is just how bad the road laying tools are. Not that W&R gets credit for being easy, it's not. But it's amazing to me that this game had the success it did, with the positive reviews it had (until now) with these major flaws. \r\n\r\nFirst off, you're starting a map with a divided highway going through it. Yet, you don't actually have those types of roads unlocked, namely high speed on and off ramps. So you can't even manipulate the goofy interchange they put on the map for you. OK fine, I'll use the one way single lane roads with a low speed limit. And as much as I hate them IRL and in game, let's see if I can build a cloverleaf so I can just get stuff started. The way roads connect and interact is so bad, I just can't even continue. Even with anarchy, which really just makes your roads look glitched and stupid. You can't create a proper angled ramp. It's basically a little intersection that curves steeply off the road you're connecting to. The way this game cannot properly handle road connected at angles makes it a fundamental no from me. I've seen plenty of content creators trying to solve this problem to try to create semi realistic intersections and interchanges. The fact that you have to sit there and fiddle with something that should be EASY in a game like this is just sad. If I want to sit and fiddle with complicated things, I'll play Oxygen not Included or W&R. CS is supposed to be approachable. But instead of trying my hand at city design, I'm spending the last hour trying to work around the limits of this game before even planting one zone.", 0.537366509437561], ["Cities Skylines is a strong city-building game that offers plenty of tools to craft your dream metropolis. While the traffic management for the citizens can be downright maddening, with endless congestion even in seemingly well-designed networks, it does add an element of strategic thinking to the gameplay. The DLC packs expand the game significantly, introducing new features and options to enhance the experience, but they can be quite expensive if purchased all at once. \n\nOne fun aspect is seeing them go about their daily lives—watching them head to work, visit shops, go to school, and return home gives the city a lively, realistic vibe. One of the game's best features is its vibrant modding community. With custom assets and mods available through the Steam Workshop, you can tweak almost every aspect of your city, from unique buildings to tools that improve traffic flow. Overall, it's a solid choice for fans of city management simulations.\n\n", 0.5258620381355286], ["The EA-killer itself. Amazing what the development group produced with this game. After SC2013 was such a let down, they knock it out of the park. Here's hoping the sequel doesn't suck.", 0.523809552192688], ["No matter what you do the populous complains to the point where I just want to go Joseph Stalin on them all,  the balancing act of maintaining a city is more annoying than anything, ESPECIALLY when you carefully plan things out logically and to the methods that a REAL city would thrive from, NOPE not in this game, the algorithms are there to punish you rather than provide rewarding realism based on real world economics and logic. Oh and the \"chirper\" which is essentially a simulated twitter feed from city residents in game is an abomination that constantly chirps and cannot be shut off.", 0.523809552192688], ["Cities: Skylines is a fantastic city-building game and, unfortunately, still far superior to Cities: Skylines II. Even after a decade, it remains the best in its genre. The level of detail, modding support, and creative freedom make it a must-play for any city-building enthusiast. Highly recommended!", 0.523809552192688], ["---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n☑ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10", 0.52173912525177], ["Cities Skylines is a great game in my opinion. You don't even have to buy extra content or DLCs for it too be good. You can do so many things, and they keep adding stuff. If you like building your very own city from srcatch and want too control every little thing, you can do it here! \nI have been playing it since et came out and now it's been 10 years, and i'm still playing it. Never getting tired.", 0.52173912525177], ["spent 20 min trying to figure out how to change the direction of a road, had to start a new game, in the new game i had 0 roads unlocked for some reason and couldnt place anything so i tried to start a third game and it crashed. time to uninstall", 0.5205479264259338], ["pretty fun and a solid, challenging simulator even without dlcs", 0.5199999809265137], [">puts all types of schools everywhere\r\n>most of the populaton is dumb\r\n>gets education improvement mod\r\n>people are too smart for normal jobs\r\n                                                                        10/10 no joke", 0.5185185670852661], ["Pros\n-ten million times better then the sequal\n\ncons\n-have to spend a billion trillion dollars for the DLC's that make the game a little more immersive. \n(DLC's free with the sequel so what gives)", 0.5185185670852661], ["[h2]Game installs 3rd party launcher[/h2]\n\nDespite not being disclosed in the Store Description of the game, Cities: Skylines installs the paradox launcher at first start. While there are ways to circumvent that, both - 3rd party launchers and \"forgetting\" to mention it - is an absolute no-go. At least for me.", 0.5161929726600647], ["This one just wasn’t my cup of tea. I love life sims and management type games and decorating but I think that without the people watching it just fell short for me. I definitely appreciate the appeal of this game tho and it is well made it’s just a bit boring for me", 0.5159151554107666], ["Game is not complete. Devs rigged game so cities fail without DLC. Come on have to pay extra just to get roads that should have been in game. And you had to know that the cargo train station runs to slow and causes traffic jams. Do not buy this unless it comes with all DLC for less than 20 dollars.", 0.5159151554107666]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/255710/header.jpg?t=1742911104", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/255710/4cf458b43b41e4f86d3e4e604e7a7577c7926b01/capsule_231x87.jpg?t=1742911104", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/255710/4cf458b43b41e4f86d3e4e604e7a7577c7926b01/capsule_184x69.jpg?t=1742911104"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Colossal Order Ltd.", "owners": "10,000,000 .. 20,000,000", "tags": ["City Builder", "Simulation", "Building", "Management", "Strategy", "Sandbox", "Singleplayer", "Moddable", "Economy", "Resource Management", "Mod", "Realistic", "Replay Value", "Casual", "Modern", "Real-Time with Pause", "Family Friendly", "Great Soundtrack", "Funny", "Action"], "languages": ["English", " French", " German", " Spanish - Spain", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Korean"], "concurrent_plays": 15768, "number_of_achievements": 127, "categories": ["Single-player", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "Steam Cloud", "Includes level editor", "Remote Play on Tablet", "Family Sharing"], "genres": ["Simulation", "Strategy"], "short_description": "Cities: Skylines is a modern take on the classic city simulation. The game introduces new game play elements to realize the thrill and hardships of creating and maintaining a real city whilst expanding on some well-established tropes of the city building experience.", "long_description": null}