{"name": "Chained Together", "app_id": 2567870, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£4.29", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 15776, "negative_reviews": 1406, "reviews": [["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10", 0.796135425567627], ["the first hour is funny then you just get brutally molested by the game bcecause you stupid ass friend did not make the jump or the jump was too big", 0.5410361886024475], ["It's better to not have friends for this game. Restarting 100x for one jump has been a great experience!!!", 0.523809552192688], ["Still haven’t finished the game yet, but wow—this game has trained me and my partner to be pros at co-op games! HAHAHAHA. Now, whenever we play other co-op games, they feel too easy!\n\nThe graphics are insane. I’m afraid of heights, and this game makes it feel so real—I genuinely get scared when we’re high up! The adrenaline rush is what got us through some levels. This game is absolutely unforgiving—if you fall, you fail, and you have to do it again. But honestly, that’s what makes it so good!\n\nWe love this game, and I highly recommend it to anyone who wants a real co-op challenge!", 0.523809552192688], ["Great game with friends, but even solo it was an enjoyable 3D platformer!", 0.52173912525177], ["the game has a good feel to it they did make it single player which i do like. It got a few game modes as well i do also love how big the game is not to add they allow workshop maps to change it up they did a really good job on the cloud graphics as you climb and the 3 different levels of the map and the way they emerge with one another also very fun with friends", 0.5], ["A game that you can play with your friends for five or six hours at most, a game that can be considered good for its price, which often makes you sweat.", 0.5], ["If you hate the people you are playing this game with you will not enjoy it too much. If you like the people you are playing this game with just know that you now do not and will need a break from them. Sorry, but have fun playing!", 0.5], ["chained together is a really good game but some levels are kind of hard but some are quite easy like the puzzle one were you have to use your brain is hard but some simple only up things are easily done", 0.5], ["Chained Together offers a unique and exhilarating cooperative platforming experience. In this game, players are literally chained together, requiring seamless coordination and communication to navigate through challenging levels. The game's mechanics foster a strong sense of teamwork, as each player's actions directly impact the group's progress.​\r\n\r\nThe level design is both creative and demanding, providing a satisfying sense of accomplishment upon completion. The game's aesthetic complements its intense gameplay, creating an immersive environment that keeps players engaged.​\r\n\r\nWhether playing with friends or tackling the challenges solo, Chained Together delivers a memorable and rewarding gaming experience. Its innovative approach to cooperative gameplay sets it apart, making it a must-try for fans of the genre.​", 0.5], ["Игра оправдывает свою стоимость, после этой игры я стал мёртвым внутри дед инсайд гулем SS-ранга и больше не чувствую боль от этих ничтожных пыток 10/10", 0.5], ["\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10", 0.5], ["Chained Together war für mich eine der größten Enttäuschungen, die ich je erlebt habe. Schon nach den ersten Minuten war klar: Dieses Spiel bietet kaum Abwechslung und zieht sich endlos dahin.\r\n\r\nDie Spielmechanik ist simpel, was an sich nicht schlimm wäre – aber es fehlt komplett an Variation. Man macht gefühlt immer wieder dasselbe, ohne dass sich etwas wirklich verändert oder weiterentwickelt. Nach kurzer Zeit stellt sich eine enorme Langeweile ein, und selbst im Koop-Modus kommt kaum Spaß auf.\r\n\r\nAuch das Leveldesign wirkt lieblos. Es gibt weder überraschende Momente noch kreative Herausforderungen, die einen bei der Stange halten. Stattdessen kämpft man sich durch eintönige Abschnitte, die sich wie eine lästige Pflicht anfühlen.\r\n\r\nInsgesamt ist Chained Together für mich das schlechteste Spiel, das ich je gespielt habe. Es fühlt sich unfertig an, bietet kaum Motivation und ist einfach nur monoton. Wer Spaß und Spannung sucht, sollte einen großen Bogen darum machen.", 0.5], ["Pretty intense, wild, and fun. Challenge your patience and your friendship quite a lot.\nRun like potato on Steam Deck BTW.", 0.5], ["An enraging game but in all the right ways. If you get stuck take a break for 20 minutes or even a day, and then come back. The rotating shipping crates KILLED me. One of the best games to play with friends because of the teamwork aspect and accessibility.", 0.5], ["very fun games kind of gone past peak but still good. u can easily make it harder or easier for your self and overall solid game to play with friends", 0.5], ["The h of the highest unlocked point in the esc menu is not upper cased, literally unplayable", 0.5], ["This game was fun in a messed up way. Kinda like playing a horror game but worse.", 0.5], ["It is so fun but It is also so annoying (especially with TacocatPacocat) but over all is super fun. It is ten times better only up because you can do single player and multiplayer. Also if you are really bad you can go back to the highest point you were if you fall really far.", 0.5], ["i bought my friend this game only to stop him from completing the first jump\n\ni recommend repeating this method", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2567870/header.jpg?t=1732288374", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2567870/capsule_231x87.jpg?t=1732288374", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2567870/capsule_184x69.jpg?t=1732288374"}, "support": {"support_website": null, "support_email": null, "game_website": "https://linktr.ee/AnegarGames"}, "developer": "Anegar Games", "owners": "2,000,000 .. 5,000,000", "tags": ["Co-op", "Adventure", "Casual", "Platformer", "Puzzle-Platformer", "Simulation", "Action-Adventure", "3D Platformer", "Third Person", "Exploration", "Funny", "Online Co-Op", "Multiplayer", "Mystery", "Post-apocalyptic", "Emotional", "Physics", "Surreal", "Controller", "Choices Matter"], "languages": ["English"], "concurrent_plays": 3450, "number_of_achievements": 16, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Partial Controller Support", "Remote Play Together", "Family Sharing"], "genres": ["Adventure", "Casual", "Indie", "Simulation"], "short_description": "From the depths of hell, climb chained to your friends through diverse worlds. Solo or co-op, try to reach the summit and discover what awaits you there...", "long_description": null}