{"name": "Serious Sam 4", "app_id": 257420, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£33.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 3936, "negative_reviews": 815, "reviews": [["Serious Sam 4 takes the series in a new direction. This time around its a prequel that takes place before the older games. A 4-player coop mode is designed to allow friends to work as  team to take on enemy forces. Of course the game is also single player.\n\nThe graphics in Serious Sam 4 are modern and more designed around modern consoles. The MSI Katana with RTX 3070 can handle this game fine. The game is barely playable in a GTX 1050 Ti.", 0.6170581579208374], ["The game starts out slow but it REALLY Picks up and gets REALLY good the further you go in. Keep playing it and you wont be dissapointed. You just HAVE to keep going and keep playing even if you think the game is bad. Give it ATLEAST 4 Hours it will 100% be WORTH it, TRUST Me on this.", 0.5258620381355286], ["I'm a big fan of Serious Sam games.. Love them..But this one is just.. Feels rushed, graphics even worse than the old Serious Sam 3 game. \n\nFeels cheap, runs pretty bad for it's graphics, lots of popups fps drops from 100 even on 4070Ti super..\nI gave it few chances but everytime i close it after 5 mins because it just feels like cheap unity game from 2010 that you play on browser.....\nI was really excited to play SS4 but yeah.. Just stick with the old titles.", 0.523809552192688], ["Tried to give it a fair shot again, got disappointed from minute 1. Graphics are worse than TFE HD that came out 6 years earlier, texture and models keep popping and fading in even on Ultra settings. The game tries too hard to be funny for it's setting all the time with no charme, if you want a funny and enjoyable Serious Sam go play Serious Sam 2. Enemy design is bland and pretty boring. I gotta say the basic weapons like shotguns and assault rifles do feel a lot punchier in this game so thats a plus. Of the levels I played most of them were pretty boring, mostly because the setting doesn't fit a Serious Sam game at all in my opinion, for me Serious Sam excels in settings that aren't based in \"present\" times where you are not bound to the limits of real life. Overall massive disappointment as a long time Serious Sam fan since I was 6 years old, it's an OK shooter but as a Serious Sam game it just falls short.", 0.5175438523292542], ["Excellent!\r\n\r\nWithout doubt the most enjoyable, pretty and well made game in the series.\r\n\r\nIf you like Serious Sam, shooters in general, stupid (but good) humor, silly guns, or humongous fights: Just buy it. It's a no-brainer.\r\n\r\n20 ish hours campaign might feel short, but each area is well fleshed out and fights are interesting and challenging. You'll easily add more hours beating it again on \"Serious\" difficulty, which require significantly different approaches. Secret hunting is also interesting and can add a few hours.\r\n\r\nMany memorable moments and quotes that I won't spoil here. Go play the game and discover them yourself for some good laughs.\r\n\r\nA few negatives, or near-negatives:\r\n- The ultimate Ackerman fight (or whatever its name was), feels unbalanced, confusing and annoying. I blame only 50% on skill issues\r\n- Some fights can feel overwhelming, but there's always a strategy, weak point or better weapon selection that solves them\r\n- Easy to get lost in some areas, but the augmented reality gps solves it elegantly\r\n- Some areas allow you to travel really, really, really far in the wrong direction, where there is nothing to find. Arguably a positive, as it showcases impressive technical abilities of the engine, with large scale areas. However, it can be frustrating when you think you're hunting secrets but discover you're actually 10 minutes away from anything of interest (nice exploration though)\r\n\r\nIt's just a great, polished game.", 0.5], ["Feels like an inferior game to original SS games in every way.\nFeels lower budget, unfinished and with a coinfused direction.\n\nAll open regions seem pointless, first half is too slow nad boring, and only the very ending feels like a real SS game where we start getting large scale fights.", 0.5], ["Serious Fun for Serious fans.\n\nI love Serious Sam, I've played them all from First Encounter up to 4 and none of them have ever dissapointed me. This last installment is no exception. It's just fun and big and over the top like all previous games. \nThe game did not start great and I feel that the Italian campaign is perhaps the weakest part of the game (except for that glorious Popemobile), but once Sam gets to France I was having an absolute ball and it just got better and better. I bought it on sale and I've already added Syberian Mayhem to my wishlist if the expansion is as good as the game, I'm sure I'll have no regrets.\n", 0.5], ["Pretty decent Serious Sam game in comparison to 3 this entry felt closer to TFE and TSE in terms of gameplay with 2's story elements being kinda funny listening to your teammates banter even if the lines come out pretty jank most of the time. \nNo shortage of secrets with zero clues and very overwhelming fights on harder difficulties that leave you exhausted just like the old days.\nThe addition of skill points and gadgets makes it kinda feel like a cheap Doom Eternal but overall I think it breathed a bit of life into the gameplay loop so im not complaining.", 0.5], ["TFE, TSE, and 2 are some of my favorite shooters, but this game didn't hit the right spots at all. They scaled up too much when they should have just condensed things down into the core SS formula while adding in elements that compliments that formula.", 0.5], ["If you like the Serious Sam franchise, this one will not let you down.\r\nThe fights are intense and fun\r\nThe story is actually good\r\nThe jokes are funny\r\nThe graphics are actually good\r\nI can only recommend it! :)", 0.5], ["Each successive game is getting worse. This time, the developers tried to do something new—specifically, open-world levels. I really liked the concept, but the game does not capitalize on it. The concept is underdeveloped and diluted by a factor of 10 to 1 in favor of the old, outdated gameplay. Basically, Sam was surpassed by Doom, and the developers are too afraid to do something new on a big scale.  I also rage quit on a boss in the castle. No other game in the series is that difficult. And this isn't just fair, Dark Souls–like difficulty—it’s almost intentionally infuriating, reminiscent of \"I Wanna Be the Guy\" difficulty. I'm just too tired. I've already beaten a couple of hard bosses/locations (mine was insane), so I know I can do this. But you're telling me that I need to either restart the level to stock up on armor because the developers forgot to place a restock before the boss, or restart several levels to get the chainsaw I missed, which would annihilate the boss? No, thank you. That's too much effort for a brainless shooter.", 0.48310813307762146], ["hay lắm , tôi hi vọng sẽ ra phần tiếp theo cho tới kết thúc , tôi rất nể phục người làm game này , hi vọng họ sẽ phát triển lâu dài", 0.4931682348251343], ["Great game overall.   Very challenging.   Ending was quite difficult.", 0.5], ["One of the best shooters to play with boomer friends.", 0.5909867882728577], ["It's Doom 2016 but worse in pretty much every way.", 0.49794235825538635], ["Run and Gun, Have Fun", 0.5817490816116333], ["WHY SO... SERIOUS!?\n\nno seriously... its a good game, trust me bro.", 0.523809552192688], ["Better long running franchise than Super Mario.", 0.5], ["One of the best co-op shooters.", 0.5357142686843872], ["performance issues on steamdeck", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257420/header.jpg?t=1728688201", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257420/capsule_231x87.jpg?t=1728688201", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/257420/capsule_184x69.jpg?t=1728688201"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.serioussam.com"}, "developer": "Croteam", "owners": "1,000,000 .. 2,000,000", "tags": ["Action", "Gore", "FPS", "Co-op", "Shooter", "Multiplayer", "Violent", "Adventure", "Comedy", "Singleplayer", "Great Soundtrack", "Fast-Paced", "First-Person", "Blood", "Classic", "Difficult", "Indie", "Arena Shooter", "Open World", "Third-Person Shooter"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese", " Turkish"], "concurrent_plays": 141, "number_of_achievements": 54, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Workshop", "Steam Cloud", "Family Sharing"], "genres": ["Action", "Adventure", "Indie"], "short_description": "Serious Sam 4 reignites the classic FPS series in a high-powered prequel loaded with an explosive arsenal, intergalactic carnage, and perfectly timed one-liners.", "long_description": null}