{"name": "Mount & Blade II: Bannerlord", "app_id": "261550", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "USD", "original_price": "", "final_price": "$49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 78215, "negative_reviews": 11485, "reviews": [["\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☑ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10\r\n\r\n", 0.7783500552177429], ["I simply don't understand how unpolished this game is... After all these years!!! Still crashes randomly, the campaign is meh at best.", 0.647937536239624], ["If you played the previous Mount & Blade: Warband, this game feels pretty much the same with better graphics. It is a bit disappointing in depth, but a good game nonetheless.\n\nIf you've never played a Mount & Blade game, you've gotta try this. This game feels like a mix of Skyrim and Total War, is highly modable and you could spend 100h or more on a single game. And since it's a sandbox, high replayability.", 0.5962278246879578], ["If you have a AMD RX 5700 XT, this game has a game-breaking bug that makes it so you cannot actually play a battle on these maps in the game. You have to autoresolve.\nTowns and Castles\n\n    Amitatys\n    Amprela\n    Charas\n    Myzea\n    Onira\n    Pen Cannoc\n    Ustokol Castle\n\nVillages\n\n    Asalig\n    Kuruluk\n\nRegular Battle Maps\n\n    Damar River (Steppe)\n    Myzead Woods (Plain)\n    Ozu River (Steppe)\n    Sulun Dag Wastes (Steppe)\n    Temea Creek (Plain)\n\nThe only solution is to roll back drivers to 23.5.2 which released in 2023-06-01, almost TWO YEARS AGO. Taleworlds has done NOTHING to remedy this and everytime you post your crash logs to their forum, they just copy and paste \"Sadly we can't reliably reproduce the GPU crashes on debug environments.\" on every forum post. If you buy the game, and your GPU and CPU can handle it, you should expect it to work. This does not. Taleworlds: Please just fix this damn issue. This is one of my favorite games of all time and I hate having to leave a bad review, but this issue going on THIS DAMN LONG is just insane.", 0.5833333134651184], ["If you're someone who loves action, definitely get it—this might become your favorite game.\nHowever, if you're someone who likes RPG, this is absolutely not the right place. Even after all these years, proper diplomacy hasn't been implemented in the game.\nMoreover, in the late game, you never feel like a king or a lord.\nIt's similar to how in Skyrim, even after becoming the guild leader, no one reacts to it.\nIn this game, too, there’s no feeling of being a king or a lord.\nIf you're going to play this game, it should be for the action alone. Don’t believe in its other promises because it has lazy developers.\n", 0.5737583637237549], ["Bannerlord has come a long way since its rocky launch. While it still doesn’t quite have that magic spark that Warband had, there’s no denying that Bannerlord is now a solid game — and a worthy sequel in most respects. It’s exactly what you’d expect from a follow-up: more of the same, but bigger, better-looking, and far more refined.\n\nThe quality-of-life improvements alone are fantastic. Managing armies, fiefs, companions — everything feels smoother and more accessible now. The systems are still deep, but far more player-friendly than Warband ever was. Core combat is still satisfying, large-scale battles are a blast, and the game world finally feels alive thanks to all the new systems and polish.\n\nBut let’s be honest — the real reason Bannerlord is starting to shine is mods. Now that the game’s been out for a few years and the modding tools are solid, the community is kicking off properly. Those legendary total conversion mods from the Warband days — Lord of the Rings, Warhammer, historical eras like the Samurai and Napoleonic Wars — are all starting to take shape again.\n\nThere are already a few standout mods with active communities, like Persistent World, which is fantastic for those who want that immersive sandbox roleplay and combat. There’s even a small competitive scene for vanilla and some mods, where players join teams, clans, or regiments and take part in organised battles. So whether you're into casual sandboxing, roleplay, or competitive multiplayer, there’s a decent amount going on for everyone.\n\nIf you’ve been on the fence about jumping in, now’s a great time. The vanilla experience is solid, but as these big mods get more fleshed out, Bannerlord might just recapture that iconic spark Warband had for so many of us.\n\nAnd TaleWorlds...\nWHERE’S MY NAPOLEONIC DLC?!\nWe need line battles. Muskets. Drums. Shouts of “Hold the line!” echoing across snowy hillsides. You did it before — bring it back!", 0.5669291019439697], ["Warband is better in everyway than this, except for the limit the engine puts on battle sizes and it's lack of cool siege mechanics, and the least important, graphics. Unfortunately, now I choose this over that for those reasons, since big battles and trebuchets breaking walls have been something I've wanted a first/third person hand in since Total War.\n\nBut why, why do I not recommend this. Because, it's been 5 years since release, and it's just revolting how Talesworld keep adding dumb updates that break mods we rely on to add stuff to the game that the lazy developers should have added by now.\n\nThe DLC they are coming out with is so lacking in comparison to warbands DLC's. Charging us for adding naval battles and a new faction to the base game is a poor excuse for a DLC. \n>:(\n\nViking Conquest for warband, had it's own campaign, it's own full fledged map of England, Ireland and Denmark, factions to match, and new unique mechanics. Napoleanic Wars for warband also had content. These were worthy of being called DLC's, since they actually delivered on content. But no, Talesworld have got their money now didn't they, so their care level for the customers has gone down.\n\nIf warband had the same siege mechanics with breaking walls, trebuchets and what have you. and the ability for 2000 warriors in a battle, I'd be on that instead of this piece of unstable crap.", 0.5586550831794739], ["Overall, very good game play. Needs more tutorials. I think it could be better but worth buying.", 0.5564516186714172], ["Game still has GPU crashing issues despite being a known issue for 3+ years. Crazy that the game was more functional in early access.", 0.5495848059654236], ["It's only fun with a heap ton of mods. And even then, there's a lot missing from the game. Somehow the devs managed to have fewer features and less depth than Warband or WFAS.", 0.5471220016479492], ["Absolutely great game! I love the modding community more though, the amount of mods you can have on this game is astounding with great dev support for the modding community. Above average vanilla experience, I can't wait for more updates in the feature with more vanilla items and modes!", 0.5454545617103577], ["This review is based solely on what was promised and what we received (some things might be missing, so feel free to add positive or negative implementations on the comments), not with the aim to bad mouth the game, but to put the situation plain and simple for any newcomer ( especially because of the new DLC coming out) so here we go:\r\nImplemented Features ( some don't fully work )\r\n1. Battle Terrain System\r\nWorks just as intended, only problem is not all maps have been created/released. And there is snow and rain on the campaign map which doesn't really affect the outcome of battles.\r\n2. Voice Acting for Dialogues\r\nA portion of dialogues, especially greetings and main storyline conversations, have been voiced in English. Doesn't really add much, it's a nice touch and all but basically no localization and feels weird when the silent dialogue was just fine.\r\n3. Multiplayer Enhancements\r\nFeatures like voice chat, cheer and shout systems, and custom servers have been introduced to improve multiplayer communication and gameplay. And on top of that, they broke the sounds for the cheers with the new implementation of extra cheers you can unlock with in-game currency.\r\n4. Crafting Orders\r\nThis system allows players to accept crafting orders, adding depth to the weapon crafting system and providing a new career path within the sandbox.\r\n5. Keep Battles\r\nExpanded sieges now include climactic battles within besieged castles, offering more immersive siege experiences.\r\n6. Party and Kingdom War Stances\r\nPlayers can assign orders to subordinate parties to dictate their approach towards hostilities, adding strategic depth to kingdom management. Though I haven't noticed any big difference in AI responsiveness to this.\r\n7. Perks\r\nYou can customize your characters based on what perks you put on them, some perks do not work and there is no way of training the perks other than doing their passive skill ( no books or trainers)\r\n\r\nUnimplemented or Uncertain Features\r\n1. Expanded Settlement Management\r\nWhile the game includes basic settlement management, more detailed control over village infrastructure and development is still lacking.\r\n2. Replay Editor\r\nAlthough there were discussions about a replay feature, it has not been fully realized or integrated into the game.\r\n3. Unique Companion Quests\r\nThe game lacks unique quests for companions, which were initially promised to add depth to character interactions. This one has received the cold shoulder when asked about to silently get rid of any further ideas of implementing it.\r\n4. Expanded Banditry and Crime Systems\r\nPromised features like expanded interactions with city gangs and a more complex crime system have not been fully implemented.\r\n5. Intrigue and Diplomacy\r\nMechanics involving espionage, defamation, and complex diplomatic interactions are still underdeveloped or missing.\r\n6. Feasts, Tournaments, and Ceremonies\r\nSocial events like feasts, tournaments, and ceremonies for milestones such as a child's coming-of-age are not present in the game. Tournaments are just random events that appear and sometimes hold no meaningful reward or participants.\r\n\r\nIn Development or Under Consideration\r\n1. Sally Out Missions\r\nCurrently, when defenders sally out during a siege, it initiates a standard field battle. Plans are in place to create dedicated missions for these events to enhance immersion. ​\r\n2. Cut Scenes for Life Events\r\nThe introduction of cut scenes to commemorate significant life events, such as the birth of a child or the death of a comrade, is planned to improve narrative immersion.\r\n\r\nThese are not everything that was promised, but just some key points to give somewhat of an idea of what's happening with the game. Could go on with minor bugs in singleplayer and multiplayer combat bugs and animation glitches, but main part of all of this is to say that the game was never fully released. I'm not saying I didn't have fun spending 1000 hours in singleplayer and another 1000 in multiplayer, just saying what they're putting out is not what you're getting, as I have seen plenty of people with no more than 10 hours just quit the game because it's not what has been advertised. So this upcoming DLC is just another cash grab from Taleworlds, same strategy they pulled when they classified the game as fully released and releasing the weird digital companion DLC, same as when they released it for consoles and you can't even download mods ( unsure if you can even play multiplayer on console). I like the game but if you're expecting everything you've read or seen on Taleworlds promotion don't bother buying.", 0.5444685220718384], ["Dead world when all is said and done. After the battles are over, there's very very little to do. Like so many games of the last 15, maybe even 20 years, no effort and thought into the gameplay capabilities of the player outside one specific function.\n\nAn open world without is nothing if your character is not an open world of possibilities within. That goes for any npc. They're little more than cardboard cutouts.\n\nThe battles are fun, but unsustainable because there's nothing to really fight for and cultivate. Can't expect recommendation when the cause of investment is so overtly shallow.\n\nThat being said, like skyrim, the framework is excellent for mods and the modders have shown that (bless them).\n\nYou'd just expect TW to do so much more to fulfil their end of the bargain and they didn't. I think they said they'd be doing a massive update soon for us though so we'll see if that fixes it.", 0.54356849193573], ["Game has the potential to be great, but the devs seem to have their priorities mixed up.\r\nAI for the lords on the campaign map is awful, they siege far away settlements, ignore close by friendly settlements under siege, voting for war while already at war. There needs to be better mechanics to manage armies and conduct war, AI decision making needs to be improved. Instead the devs focus on a million different helmets and a dlc that will ultimately suffer from the same issues as the base game.", 0.5412535667419434], ["The campaign is the worst ever thing created. I could have down syndrome and create a better campaign solo than the entire development team. Fix the god awful campaign? No lets release a dlc several years after release. I cant imagine developing this game and looking at the campaign and saying \"yeah this is great\". its the same 3 quests on repeat until conspiracy fires. Does your country help with these quests that are pertinent to the nation? No. Player only. It's bewildering how awful the campaign is, whatever path you choose, independent kingdom or gifting the banner, its complete trash. If you buy the game do not engage with the dragon banner at all, one of the worst campaigns/stories ever created in gaming history.", 0.5351608991622925], ["503.6 hours on record. Fantastic game with a wide variety of play styles supported from a developer that is deeply invested.\n\n10/10 would buy it again.", 0.523809552192688], ["Fun at first but a grind in late game coupled with extremely frustrating glitches and bad AI:\n\n- if you besiege a castle and are defeated and only lose some of your soldiers, but get attacked by a party waiting outside, your entire army randomly glitches and disappears and you have to face the entire attacking party alone.\n\n- some sieges won't end because there's one enemy that apparently glitches into the middle of a wall forcing you to retreat and try again.\n\n- soldiers will abandon the battering ram or siege tower mere feet from the wall/gate and when you call them back to it, they won't help push anymore; instead they'll just march behind and get wiped out by enemy catapults\n\n- to save memory, armies only partially load at the beginning of a battle, so entire waves of soldiers will suddenly appear out of thin air later on in the fight, sometimes right on top of you. When your second wave randomly spawns, you're not alerted, so they may end up just standing there not doing anything. \n\n- you can organize the order of your soldier types in your party manager, but if all of a certain kind dies or are upgraded, but then you get more of that kind later, they'll appear at the bottom of the list instead of in the spot you put them in, making the sorting function essentially pointless when you have to completely redo it after every major battle and re-recruiting cycle.\n\n- friendly armies have very poor AI and will do things like walk right by smaller and weaker enemy armies that are besieging your towns and castles or aimlessly chase around smaller but faster enemy parties they'll never catch up with until the army is forced to disband after running out of the cohesion stat.\n\n- if you get captured you're stuck with no options but to watch the NPC who captured you randomly run around the map till it finally offers you to pay a ransom to be freed, and when you do, you have a temporary speed penalty and will often get recaptured again within seconds.\n\nIt's a broken, half-finished game. It can be fun, but definitely not worth the full price.", 0.523809552192688], ["Unplayable trash. Constant crashes - rglGPU_device_d3d11::create_render_texture errors - unacceptable for a game that's been around for years.", 0.523809552192688], ["There is no suitable description for this greatness, from the first moment you are in the game until you die, your main character will not decrease the amount of passion, as for the open world, the world is very large, the cities and the village are large and the terrain is different, as for the RPG style, you may be absorbed in building your character inside the game more than your real character , but as for the strategy, I guarantee that when you finish controlling the empire you want and fight more than 50 battles, you will become better than Napoleon personally without a doubt, enjoy this greatness until the next part is released", 0.523809552192688], ["Some gamebreaking bug that wont let you open the game since 2023 with no fix in sight", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/261550/header.jpg?t=1742509686", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/261550/capsule_231x87.jpg?t=1742509686", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/261550/capsule_184x69.jpg?t=1742509686"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.taleworlds.com/en/Games/Bannerlord"}, "developer": "TaleWorlds Entertainment", "owners": "10,000,000 .. 20,000,000", "tags": ["Medieval", "Strategy", "Open World", "RPG", "War", "Sandbox", "Multiplayer", "Singleplayer", "Action", "Character Customization", "Simulation", "Moddable", "Adventure", "Horses", "Realistic", "Third Person", "Historical", "First-Person", "Great Soundtrack", "Early Access"], "languages": ["English", " Simplified Chinese", " Turkish", " Traditional Chinese", " French", " Italian", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Spanish - Latin America", " German"], "concurrent_plays": 27822, "number_of_achievements": 50, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "Partial Controller Support", "Steam Cloud", "Includes level editor", "Remote Play on Tablet", "Family Sharing"], "genres": ["Action", "Indie", "RPG", "Simulation", "Strategy"], "short_description": "A strategy/action RPG. Create a character, engage in diplomacy, craft, trade and conquer new lands in a vast medieval sandbox. Raise armies to lead into battle and command and fight alongside your troops in massive real-time battles using a deep but intuitive skill-based combat system.", "long_description": null}