{"name": "Call of Duty® 2", "app_id": 2630, "platforms": {"windows": true, "mac": true, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£14.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 3381, "negative_reviews": 269, "reviews": [["Game looks amazing, even after all these years. And who would have thought that it's been 20 years already. Still works flavlesly, even on windows 11.", 0.6422144770622253], ["The best game in the Call of Duty franchise. No melodrama or silly inter-personal conflict driven plot. Just WWII in video game format, with you as a grunt. Iterates and improves on its predecessor in all the right ways.", 0.5634920597076416], ["It’s alright.\n\nNowhere near the best of the series, but it’ll do if you need pure and simple shooting gallery to ease your mind after work (or after System Shock, in my case).\n\nSome setpieces are better than others, though; the number of the exact same two-story houses I cleaned at the tail end of the English campaign and the beginning of the American one is bordering on ridiculous.", 0.523809552192688], ["This game is awesome! Like it predecessor \"Call of Duty\" and its successor \"Call of Duty: World at War\" - its one of the only games that are well made for WWII (in my opinion these 3 games are the only good ones connected with WWII). The graphics, yes, they are old, but they look good, I believe. They still hold up and look well for 20 years later. Unlike its predecessor, the graphics don't feel as old. A big improvement there. Gameplay is fun as frick! It's amazing, again, yes, nothing special, but tons of fun and a lot to do, you even have Multiplayer introduced here. It's a WWII FPS, nothing to fancy, but you don't need fancy here, it's just so good. Storyline is great. I love it! Thanks to these games (when I was about 8-9 years old), I learned a lot about history and put myself in these scenarios. I can only imagine what people went through, I tear up at some missions, remembering that this all actually happened. I would highly recommend playing this game! \r\nOverall I would give this game as well, a 10/10! For sure. All 3 of the mentioned CoD games are the only good CoD and WWII games, I've ever played (FPS-wise).", 0.5], ["What a blast to play I beat the whole game on hardened 8/10 does crash at start up.", 0.4838709831237793], ["Insane replay ability! This I would argue is one of the top five Call of Duty games I've played!", 0.523809552192688], ["well for those of us that remember when this came to pc. Nostalgic dont compare to games of today. Play and enyoy or dont", 0.5], ["Old ass peak game, i like it, makes my balls tingle", 0.6497989296913147], ["GOATed game, still can find a MP match no problem in 2025", 0.523809552192688], ["this game makes the first one look bad because of how good it is\r\n", 0.5444191098213196], ["classic underappreciated asf", 0.5275590419769287], ["THE WWII Shooter experience!!!", 0.5275590419769287], ["yeah its a good game\r\n", 0.5], ["buy it or you're gay", 0.5454545617103577], ["damn old compass", 0.46783626079559326], ["Really cool game.", 0.5], ["love old daays", 0.5], ["game fun", 0.5], ["One of the best COD games!", 0.5], ["is good\r\n", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2630/header.jpg?t=1731698337", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2630/capsule_231x87.jpg?t=1731698337", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2630/capsule_184x69.jpg?t=1731698337"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.callofduty.com/"}, "developer": "Infinity Ward", "owners": "5,000,000 .. 10,000,000", "tags": ["World War II", "Action", "FPS", "Multiplayer", "Singleplayer", "Shooter", "War", "Classic", "First-Person", "Historical", "Military", "Atmospheric", "Controller", "Story Rich", "Violent", "Co-op", "Adventure", "Online Co-Op", "Casual", "Simulation"], "languages": ["English", " French", " German", " Italian", " Spanish - Spain"], "concurrent_plays": 222, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "Family Sharing"], "genres": ["Action"], "short_description": "Call of Duty® 2 redefines the cinematic intensity and chaos of battle as seen through the eyes of ordinary soldiers fighting together in epic WWII conflicts. The sequel to 2003's Call of Duty, winner of over 80 Game of the Year awards, Call of Duty 2 offers more immense, more intense, more realistic battles than ever before, thanks to...", "long_description": null}