{"name": "Goat Simulator", "app_id": 265930, "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£8.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 26698, "negative_reviews": 2873, "reviews": [["it is absolutely the funniest game i have ever played i would reccomend this game to other people but i wouldnt mind getting rid of the innapropiate language in this game", 0.523809552192688], ["\njust hit, break, run and smash\nin short it's very fun", 0.52173912525177], ["funny game to lose time for whenever your bored or whatever.", 0.5], ["great game but if you consider buying all the DLC just get the remaster", 0.5], ["you might be looking at this game because its on sale. I am here to recommend you buy the newer ones. If you have kids and they want to play, be prepared to see the same levels and same things over and over again. recommend this game if its a good deal :)", 0.5], ["amazing game, insanely funny, indie, contains references from coffee stains's other games, contains references from the hitchhiker's guide to the galaxy by Douglas Adams, and makes satisfactory way more fun to play", 0.5], ["it fun and its funny i would recomed to everyone if you want destrucson an", 0.5], ["intense game that lets you as a goat basically do whatever in a limited sense. heavy on system performance even currently.", 0.5], ["im not here to give much advice but goat simulator remastered is out and its good but if you want to mod your game pick this goat simulator anyways bye and have fun goating it! OH WAIT one more thing if you want this on mobile you can no mods though if you want goat simulator goaty but mobile search goat simulator winter bundle and yeah okay have fun goating!", 0.5], ["Goat Simulator is one of the greatest games of all time, from the extensive research done to create an immersive and realistic goat experience, to the historical accuracy. This is truly a masterpiece of a story, which had me sitting at the edge of my chair.   The game truly is the G.O.A.T", 0.5], ["Pretty big nostalgia trip, I remember playing this on my tablet while hanging out with my cousins back in 2014", 0.5], ["this game is very cool when your playing multiplayer. This game is one of the best Ive ever played.", 0.5], ["Very good sandbox, just hop in and do whatever the hell you want. Has a lot of funny aspects and moments. DLCs are all really good as well, all of them having tons of new stuff to do and mess around with.", 0.5], ["This game cured my terminal diabetes, cancer, nicotine addiction, and made me 6\"4' and the day after I won Mr Olympia. If you don't buy this game, you are gonna die never experiencing true fun, never gonna experience this life changing game play.", 0.5], ["I love it. i had it on console but now on my computor. I'm glad it has workshop support.", 0.5], ["I love that this game exist and that there is an achievement for your game crashing and that 22% of players have it.\r\n\r\nI wish that we got the remake for free though... only thing it has that I dont have is the mobile exclusive high school dlc which I really miss... but I am NOT spending more money on f**king goat simulator ;-;", 0.4761904776096344], ["这游戏也太容易卡死了，而且无法呼出菜单界面和控制台，只能重启，非常无语。评论有说设置成中文百分百卡死，但是我第一次玩的时候是英文，界面能动但角色卡死。不推荐，推荐只买3，那个好玩\n——\nidk why it's too easy to get stuck, can not call out the menu interface and console to close it. ONLY RESTART.\nSome says the stuck is caused by language setting but my first play is in English, it seems to be fair on both languages.\nI only RECOMMEND GOAT SIMULATOR 3 , better and more fun", 0.4572127163410187], ["This is a silly game with some funny jokes that reek of the early 2010s. If that's all you want, then I recommend it. But as a game? Something to sit down and play after a long day? No.\n\nPoorly optimized, questionable controls, and the humor gets grating after a while. The game's 'quirks' are funny at first, but then gets boring.", 0.4545454680919647], ["When Roger Ebert boldly declared that \"Video games can never be art\" in 2010, he CLEARLY never could have anticipated this artistic masterpiece. Goat Simulator sits in the cannon alongside the greatest western artistic works such as the Sistine Chapel, the Mona Lisa, The Divine Comedy, Romeo & Juliet, Da Vinci's The Last Supper, Skibidi Toilet, Dostoevsky's Crimes And Punishment, and the cinematic works of the great filmmakers such as Tarkovsky, Kubrick, and Lynch as well as The Minecraft Movie. It really taps into the cultural zeitgeist of being a human living under late stage capitalism and the painful struggles for survival that the poor and working middle classes face when the goat says \"BAAAAAAA!!!!!\" We feel his RAGE living in a system designed to keep us down, as similar to the lyrics of The Smashing Pumpkins in their song \"Bullet with Butterfly Wings\" which says \"Despite all my rage, I am still just a rat in a cage.\"\n\n\nWhen David Lynch (RIP) said “Ideas are like fish. If you want to catch little fish, you can stay in the shallow water. But if you want to catch the big fish, you've got to go deeper. Down deep, the fish are more powerful and more pure\", he was CLEARLY talking about Goat Simulator (2014), which is the artistic biproduct of a team not afraid to take true risks and dive into those deeper more serene artistic waters. \n\nSomeday, Goat Simulator will be taught as a MANDATORY course in art schools around the world. A masterpiece of Dadaist satire that Duchamp would have been proud of and thought of as natural the spiritual successor to his groundbreaking Urinal masterwork known as \"Fountain\" from 1917. \n\nThis PROFOUND insight into the human condition really elevates Goat Simulator to the highest of literary prose. \nI cannot recommend Goat Simulator enough! \n\n\"12/10\" - IGN", 0.5], ["my mom is the best she got me 130 something games and they are really fun and cool\r\nmy mom is a lengend like technoblade technoblade never dies not even close technoblade will be missed forever go sub to him on youtube and me its fallinginglife and technoblade make him insanely powerful hes watching obove", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/265930/header.jpg?t=1728895842", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/265930/capsule_231x87.jpg?t=1728895842", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/265930/capsule_184x69.jpg?t=1728895842"}, "support": {"support_website": null, "support_email": null, "game_website": "http://goat-simulator.com/"}, "developer": "Coffee Stain Studios", "owners": "2,000,000 .. 5,000,000", "tags": ["Simulation", "Funny", "Comedy", "Open World", "Sandbox", "Physics", "Destruction", "Casual", "Indie", "Action", "Memes", "Singleplayer", "Third Person", "Co-op", "Local Multiplayer", "3D", "Dark Humor", "Exploration", "Cute", "Arcade"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese", " Turkish"], "concurrent_plays": 91, "number_of_achievements": 127, "categories": ["Single-player", "Multi-player", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Workshop", "Steam Cloud", "Steam Leaderboards", "Includes level editor", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Casual", "Indie", "Simulation"], "short_description": "Goat Simulator is the latest in high-tech Goat Simulation technology.", "long_description": null}