{"name": "Grand Theft Auto V Legacy", "app_id": 271590, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 469960, "negative_reviews": 91940, "reviews": [["Sucks that i can't play a game that i paid for because the publisher changed the EULA after I bought it.", 0.8628547191619873], ["Hackers and griefers will do anything just to ruin your experience, but I'm going to recommend it because it has an amazing single-player story.", 0.7343952655792236], ["Better then enhanced, no bugs, no false bans, everything works as it should do. \n\ngreat story. \nfunny online mode for friends. \nyou can grind 24/7. \nnice cars and guns.", 0.634499728679657], ["Even years after its release, Grand Theft Auto V remains one of the most ambitious, polished, and flat-out entertaining games ever made. Whether you’re in it for the gripping story, the sprawling open world, or the chaos of GTA Online, this game delivers in almost every category.", 0.6000000238418579], ["so money hungry and yet slow and glitchy after all these years. Good game. horrible company", 0.5740286707878113], ["If corruption, inbreeding and greed were the only qualities needed for one to be elected as a politician, Rockstar could form its own government, inhabited by the descendants of the apes, which still play this game, who joined the human gene pool by interspecies mixing, and whose primal, cave dwelling neurons, mistake this money laundering scheme of a program as a \"fun\", \"enjoyable\" and \"not at all bad\" game. \r\n-2/10, I wish I could take the time I spent on this game back and invest it in watching grass grow.", 0.5495689511299133], ["One of the best game played again after a long time and still enjoyed like the first time :)", 0.5383492708206177], ["my relationship with this game is very abusive. it lures me in with promises of money and fun and once i return it starts beating me and berating me with horrible things. its crashes uncomfortably often and getting money take so long for no reason but i want so badly for the game to be fun. i will still play this horrible chore simulator nonetheless", 0.5258620381355286], ["But of course this is one of the most bestest games ever to be thought of. You should get it. If you don't then make sure you're touching grass or learning the piano.", 0.523809552192688], ["It sadly can not longer be played on Linux and the Steam Deck.\nBattlEye is a rootkit that has a total control to your machine as it run in kernel level, don't install it.", 0.523809552192688], ["GTA V is the game where you get to live the American dream... if your dream involves stealing cars, running over retirees, and fistfighting drugged-up clowns in broad daylight. The story mode is a criminal soap opera that swings between genius and total nonsense, and somehow it works. But the real madness begins in GTA Online, where the economy is so broken they’ll pay you $15 for risking your life in a mission, while a flying bike costs $4 million. The inflation here makes Argentina look like a stable utopia. If you’re not a millionaire or a hacker, you’ll spend months grinding missions against NPCs with aim sharper than your childhood trauma. And yet, something keeps you coming back. Maybe it’s because the whole thing is designed to exploit you, just like real life, but with cooler cars.\n\n[table]\n    [tr]\n        [th][h3][b]QUALIFICATION[/b][/h3][/th]\n        [th][h3][b]7/10 CAPITALISM [/b][/h3][/th]\n    [/tr]\n[/table]", 0.523809552192688], ["What a dogshit business decision.\nCharging full price for a shittier version of the game with a gimmicky hardware dependent feature, then calls it the \"enhanced\" version and unlists the original.", 0.523809552192688], ["Played this game on the Play Station 4 (PS4). I \nwould say the single player is better. \nOne of the best open-world games made. \nFew things I didn't like were the lack of \nenterable interiors, easily get a wanted \nlevel and hard to get rid of one, storyline was \ndecent but not as good as 4 or San Andreas, \nand no single player dlc like come on \nGTA 4 and other games I played had single \nplayers dlcs why not this game. For online\nI didn't like it because in a public lobby you might \nrun into griefers who will try to kill you. \nPlay in an invite only sessions with your friends. I \ngot it again on PC just so I can mod it.", 0.52173912525177], ["\"sorry there isnt enough space to install the rockstar games launcher on your computer. At least 1 GB is required. I have 200 GB's available on the same drive.", 0.52173912525177], ["Good game, graphics alrights, would recommend the enhanced version more!", 0.5192307829856873], ["This WAS a fun game, but then rockstar decided to \"enhance\" their game with kernel level spyware because they don't understand what server side anti cheat is. Then they also force this spyware on people who just want to enjoy the single player game.", 0.5162040591239929], ["This is not a bad game, it's pretty enjoyable. But after playing through this and then returning to gta 4  i can say that gta 4 is way better.", 0.5064102411270142], ["This game has taught me a lot about the community and everyone in it. It has really opened me up to not being just another straight person.\n", 0.5053003430366516], ["Uf it's now called Grand Theft Auto V Legacy not just GTA5. \n\nIt's fun, but the loading times are way too long. \n\nStarting a lobby is tedious, creating and logging in to rockstar blabla is just dumb. What do you want with this data? impress the investors?\n\nReally annoying and not pleasing what a game should be.\n\nWasted much time in the strip club while drinking vodka. Can recommand", 0.5], ["VERY good game i always paly it wirh clau and georgica", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/271590/header.jpg?t=1741120008", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/271590/capsule_231x87.jpg?t=1741120008", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/271590/capsule_184x69.jpg?t=1741120008"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.rockstargames.com/V/"}, "developer": "Rockstar North", "owners": "50,000,000 .. 100,000,000", "tags": ["Open World", "Action", "Multiplayer", "Crime", "Automobile Sim", "Third Person", "First-Person", "Mature", "Shooter", "Adventure", "Singleplayer", "Third-Person Shooter", "Racing", "Co-op", "Sandbox", "Atmospheric", "Funny", "Great Soundtrack", "Comedy", "Moddable"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Traditional Chinese", " Japanese", " Simplified Chinese", " Spanish - Latin America"], "concurrent_plays": 83118, "number_of_achievements": 77, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV"], "genres": ["Action", "Adventure"], "short_description": "Grand Theft Auto V for PC offers players the option to explore the award-winning world of Los Santos and Blaine County in resolutions of up to 4k and beyond, as well as the chance to experience the game running at 60 frames per second.", "long_description": null}