{"name": "Serena", "app_id": "272060", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 18, "negative_reviews": 11, "reviews": [["The game was short but interesting, beautiful and immersive. Sometimes it was slightly frustrating because I didn't know what to do.\n\nOverall I'm glad about trying this game, yet I'm very annoyed about a bug. Typing the Windows key, either to minimise or by mistake, moved my mouse to a screen corner and I couldn't move it at all anymore. I had to either force a computer restart or use Ctrl Alt Delete to close the game.", 0.6057538986206055], ["10 minutes into the game: \"Gosh, I already figured out what this story is about.\"\n\n1 hour later: \"...Okay, maybe not.\"\n\nAn unexpectedly interesting point-and-click game. It provides a good atmosphere, great story-telling flow, decent voice-acting, and compelling script. The player feels for the main character and wants to journey with him until the end, which is the key ingredient to any good point-and-click game I feel. I wouldn't categorise this under Horror though, probably more to Mystery. \n\nJust a tip, there's no Pause function in this game. I pressed Esc, thinking it'll pause but instead quit the game so I had to start over. Highly recommended to play alone at home without any disturbances.", 0.6039089560508728], ["It's a good short game that's ambiguous enough to have you going straight to the discussion boards afterwards to read people's theories and interpretations of what just happened.  Story is well done, and voice acting is adequate.\n\nEveryone will likely experience a slightly different game depending on what you interact with and observe.\n\nGame consists of wondering around a cabin trying to piece together the story by clicking on things to reawaken memories, and those memories can change depending on the context and progression of what you've learned/remembered.\n\nAgain, I enjoyed it.  If it sounds interesting to you, give it try knowing that it's well done.", 0.5643726587295532], ["The games like it deperately wants to be called art, but by the end of the game, I don't really know if it's earned that title.  I don't really feel like it's commented on anything or opened my mind to a new perspective in any way.  But maybe I just \"didn't get it.\"", 0.5308758616447449], ["A lot of reviews will tell you that there isn't any actual gameplay in Serena and they're right. There are no items to pick up and use with other objects or locations within the cabin. You will find no puzzles to solve or characters to interact with. The style here is more of what I would call an interactive short story, a story that unfolds in a very dark and interesting way. Many locations and objects within the cabin have multiple pieces of dialogue to add to the narrative, which feels very candid and natural.\n\nPros\n+Excellent and emotive voice acting in the narrations\n+Atmospheric location and sounds\n+Immersive graphical design\n\nCons\n-As stated, there's no gameplay. If you're looking for a traditional point-and-click adventure then Serena isn't for you.\n-With few exceptions, horror is implied, not overt. If you expect jump scares and monsters in your horror, look elsewhere.\n\nAdd Serena to your collection if you appreciate a good narrative and/or are a fan of \"art\" games.", 0.523809552192688], ["0,5-2 hours\nStatus: 3x Meh out of 5\nSlow-movin exploration of one room, story is mostly told retrospective. Good voice acting, little bit eerie, but not really scary. Almost like a one-man show theatre drama, but you are making the choices how fast it will go. Nice plot-twist.\n", 0.5], ["Honestly not much is happening. Its a game to pass a little time with a small story to tell. The main character's personality in his words were pretty off putting for me but I can see how the story goes with that. Very short game. Worth a play through though", 0.4997501075267792], ["Very well done; great storytelling experience exploring a man's life and memories.  No jumpscares.  Would definitely recommend!", 0.5454545617103577], ["Such an amazingly done story with just enough visuals, audio, and gameplay that kept me looking at every single object! I really enjoyed the whole story, the twists, the attention to detail it was all great! And this game is free to play how wild is that! Take a chance and immerse yourself!", 0.49439552426338196], ["While the game had some interesting story points, I couldn't ever finish it because of the controls. Evertime I went to the bookcase, it would't give me the ability to return to the rest of the cabin. So after multiple tries I had to just give up without finishing the game.", 0.48976999521255493], ["This game was amazing. The sound was awesome, the voices incredible, and the story miraculous. I highly recommend everyone to play this game if you like point and clicks and a game that makes you think at the end. :D", 0.47558534145355225], ["I couldnt help but have goosebumps continiously as the game became darker and darker. \nGreat to pass in just an hour or less.", 0.5], ["A found story walking simulator, Serena presents a rather cliche story but with an interesting twist. Solid for a free game.", 0.5], ["Just no!\nThis is one of those story games which is fair enough.\nTo trigger the story elemts you click around randomlyat all the things until a certain thing changes, then you unlock the next step in the story. But that story is taken straight out of a pissy girls facebook feed.\nAlso, theres a bookshelf filled with what I can only assume is some books with titles filled out by a Kickstarter gang. They do NOTHING. \n\nDon't waste your time on this emo piece of shit.", 0.4256995916366577], ["At least it's free. I haven't heard voice acting this terrible in a while; makes Lifetime dramas seem like Shakespeare. Another cookie-cutter indie walking simulator where you just click on objects to hear even more badly acted melodrama, supposedly leding to some \"disturbing\" or \"shocking\" revelation. Zzzzzz...", 0.42060336470603943], ["I kept running into the bookcase glitch as well. shame, seemed a simple story break but enjoyable. especially for free. Anyone else figure out the glitch?", 0.4696391820907593], ["This game just wasted my time playing it. Trying to find the next thing to look at while dealing with the terrible controls is plain bad. When it is listed as a horror game, the player would think there would be some for of scare to it, but Serena doesn't have that. The closest thing is the ending which is predictable and gives no honest sense of fright. The story that some of the reviews praise, is a predictable mess of a old man's life. I was going to record this for YouTube, but it is not worth recording this mess. 2/10", 0.4945598542690277], ["Very short, but interesting. I thought I knew what the story was, but then it twisted, and twisted.\nWell worth 1hr of your time.", 0.50093674659729], ["Didn't work on MacOS. Re-played on Windows PC. But... it's just beyond usual gaming experience, let's put it like this. Very special, short and not sure about the menaing of it all. try it only if you like oddities.", 0.5], ["Short and slightly entertaining. I'd give this a go, it's free and about 30 mins long.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/272060/header.jpg?t=1730388838", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/272060/capsule_231x87.jpg?t=1730388838", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/272060/capsule_184x69.jpg?t=1730388838"}, "support": {"support_website": null, "support_email": null, "game_website": "http://waitingforserena.com"}, "developer": "Senscape", "owners": "10,000,000 .. 20,000,000", "tags": ["Horror", "Free to Play", "Indie", "Point & Click", "Psychological Horror", "Adventure", "Story Rich", "Dark", "Short", "First-Person", "Mystery", "Atmospheric", "Multiplayer", "Singleplayer", "Puzzle", "Walking Simulator", "Co-op", "Hidden Object", "Exploration", "Romance"], "languages": ["English"], "concurrent_plays": 0, "number_of_achievements": null, "categories": ["Single-player", "Family Sharing"], "genres": ["Adventure", "Indie"], "short_description": "How long has it been? A man sits in a distant getaway cabin waiting for his wife Serena. Where is she? Things in the cabin evoke memories, and the husband comes to a disturbing realization... This short point-and-click adventure is the result of a massive collaborative effort between dozens of fans and designers of adventure games.", "long_description": null}