{"name": "No Man's Sky", "app_id": "275850", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 127617, "negative_reviews": 32705, "reviews": [["Don't get me wrong. No Man's Sky is a very fun game. It's visually stunning and there's a TON to do. But....... I want to play with my friends. Multiplayer is in a very sorry state in my opinion. There's a plethora of bugs when doing anything in a friend's base. Controls for allowing friends to do things in your base are extremely limited. And worst of all, why can we STILL not build a shared base? You can assist a friend in building a base, but that base still completely belongs to your friend. If they are offline, you can't do anything meaningful there. Putting a small amount of effort towards making multiplayer features better would go a very long way towards making this game more fun. It would also bring me back to it. Maybe make Clans/Guilds or something that can then own structures with their own set of rules/controls? And focus more on fixing bugs.", 0.7694001197814941], ["\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☑ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☑ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☑ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☑ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☑ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template \r\n", 0.7253704071044922], ["Definitely i'll recommend this game to my friends and other people. Game is so lit, so wonderful. So many things to do. So many worlds to explore. You can build cozy little home somewhere in the middle of the ocean and fish in peace. Or build huge factory which produce you tons of rare resources. Game where you can be part of the exploration guild and analyse flora, fauna and minerals. And then change your'e mind and become a pirate to сommit space genocide. Game, where you walk on the planet and discover a cute little animal and domesticate him. And then on his eyes disembowel his relatives and make delicious foods from them. Game, where developers become crazy (in the good way) and mix in-game lore with the reality. And there is so much more. And more is to come! Thank you Sean and Hello Games team for this wonderful masterpiece! Our journey continuous! <3 <3 <3 I LOVE YOU ALL!!!", 0.6181248426437378], ["I love this game. If you don't buy it, you're missing out. They give tons of free updates and it is so much better than its initial release so I highly recommend it.", 0.5886378884315491], ["This is a great game. It's come so far and has improved so much since launch.", 0.5799242258071899], ["Phenomenal for about 120hrs, which is not a slight at the game I've greatly enjoyed it on multiple play throughs over the years. My only gripe is the lack of end game challenges and things to work towards. Very much worth the money and seems to be getting consistent updates which will only add depth with time.", 0.5776662826538086], ["I bought this game discounted after recent reviews stating it was now a hidden gem. Wow, this game is terrible. It's like it was written by AI. There's no soul to it. It's lacking in story and the planets and combat are not great. There's just no point it, just endless amounts of the same thing over and over. Did not hold my interest at all.", 0.5608474612236023], ["boring game. Everything is too generic, gameplay consists of collecting generic stuff in order to travel to another generic planet and repeat. Exploration looses it's charm when what you are exploring is just procedurally generated mish mashes of assets.", 0.5570469498634338], ["This would have been the absolute perfect game, if only it wasnt for that ANNYOING FUCKING AI LADY ROBOT THAT TALKS TO YOU EVERY 6 SECONDS. THERE ISNT EVEN AN OPTION THAT LETS YOU TURN IT OFF !!!!! Only music and sfx, and somehow she isnt a part of sfx. Please just fix that one issue please, i beg you !!! I just want to have a chill nights evening with music in the background without being dissturbed by that pain in the ass robot lady ai bitch. Im going to end my self if it doesnt change. That is the absolute only issue with this game, everything is absolute perfection. JUST THAT FUCKING ROBOT. Like who even made that stupid fucking voice, please fire them now. Like you could've atleast made the vocie more soothing, like the voices in subnautica, and even they have an option to turn it off. Please take note of this massive issue, i beg of you!!! MY SANITY IS AT STAKE!!!!", 0.5454545617103577], ["Wow how the times have changed, I remember hopping on the hype train way back when No Mans Sky first released. Sadly my computer at the time was unable to run the game due to a missing CPU instruction set. \r\n\r\nFast forward much much later, I recently heard some great things about No Mans Sky and decided to give it another shot. I have been enjoying my time in the game quite a bit. > 100 hrs in and I still find I want to keep exploring and doing things. \r\n\r\nI thought that it would be good fun to challenge myself a little and play on Permadeath Survival mode, it definitely challenged me. I ended up dying 3 times in total before finally on my fourth attempt to complete the story.\r\n\r\nThe first was due to a hostile pirate ship obliterating me while exploring on foot.\r\nThe second was due to not understanding I only had a single choice when getting to the end.\r\nThe third was especially dumb, as I was ravaged by animals. The third one especially hurt quite a bit.\r\nAfter that I buckled up and applied what I learned and got my achievements for completing on Permadeath Survival.\r\n\r\nSome things I wish were better, add female and male versions to all alien and player characters. Flesh out the story a little bit more. Add dynamic quests with more depth, than just go collect blah. Let us customize the look of our existing ships, like basic things like color. I will leave it at that, but you probably get the idea.\r\n\r\nOverall its been a lot of fun, I'd recommend this game to people who just don't mind long walks on alien planets with a little bit of danger involved.", 0.5454545617103577], ["I dont like this game. That might sound odd given the amount of time I've put into it and the fact that I'm recommending it in my review but let me explain.\r\n\r\nObjectively this game is probably one of the best in class as far as proceedural generation goes. The sheer level of ambition this game has is impressive and what they've accomplished is rather impressive. Additionally the dev team is remarkably generous with the after launch support and continued development turning what was a broken mess into a passable game.  Their dedication and the impressive technology at work here which allows a near infinite number of creatures and worlds is why I've given this game a positive review. Objectively they've done a good job even if I end up disliking most of the time I've spent playing the game.\r\n\r\nSo yes its a good game, however, anyone planning to purchase this game should know what theyre getting into. \r\n\r\nEven with the significant amount of after launch support this game is still extremely flawed in many areas and several of the core game mechanics are either clunky, poorly executed, or just outright boring.\r\n\r\nRegarding the proceedural generation, its pretty rough. The worlds and environments are almost never convincing in any manner, many of the environments are clearly just hills with various features stapled on. From far away some of the features work, but up close quite a bit of it just doesnt work. The creatures are oftentimes clearly the result of a computer generation rather than any sort of evolution or design. Additionally all these features are reused very frequently so after a couple of hours you stop really seeing new content.  Planetary biomes are also fairly weak. Once you've landed on a planet, youve more or less seen the entire planet. Its even worse with the oceans, every ocean in the universe is pretty similar. They recently released a new updated to create really deep oceans but even those are very similar across instances.\r\n\r\nGameplay, in my opinion, is very boring. Space combat is very basic, with even a low level ship you can just hold the reverse key and win every fight, enemies also have the handy habit of flying directly i front of your guns even without you turning to aim at them which makes killing them quite easy. There are no drones, limpets, mines, smoke screens, stealth, etc to mix up the fight, its just various forms of laserbeams and missiles. Ground combat isnt any better, its mostly a dps check, there is slightly more variety in the tools but its still very basic walk, point and shoot. The enemy AI is also quite dumb they all just float around and follow you to kill you, theres no retreating to heal or seeking cover. Enemy variety is also poor- the only hostile faction (on the ground) are the sentinels , of which there are a few different floating balls, robo dogs, spider walkers and At-Ats. \r\n\r\nOutside of combat, 90% of the time you'll be walking around mining or scanning stuff. Mostly you mine things to craft the occasional upgrade, but mostly just to regenerate 1 of the dozens of slowing lowering meters that are required to do anything. You have to mine stuff for your multitool power, your oxygen, your hazard protection, your ships launch fuel, you ships sublight fuel, and your ships lightspeed fuel.\r\nAnything else you gather you end up selling..... and thats more or less it. \r\nThere are a couple of quests and a general goal of reaching the center of the universe but there is no other driving motivation.\r\n\r\nYou might set the arbitrary goal of progressing your character to the limit and getting \"S\" class everything, but thats pretty pointless. 99% of the upgrades dont alter gameplay, Theyre instead just rate modifiers. IE - Your oxygen empties slower or your mining beam mines slightly faster, or your gun does a little more damage. Things like that.\r\n\r\nExpeditions - expeditions are probably the best part of this game. The expeditions actually give you a purpose and an objective. They make you start from scratch and work through a series of objectives to earn a permanent cosmetic reward. For the most part the expeditions are usually pretty good, but theyre massively time consuming and also limited time so if you miss one youre usually out of luck. This FOMO is why I've spent 200 hours in this game,\r\n\r\nSo in conclusion this game is okay but its really just a grind fest without any real objective. Theres nothing to explore since the worlds are all extremely similar and constructed from the same parts. The gameplay is boring and repetitive and the only time you'll really have an objective is during an expedition. But if you like the grind or want to get artistic with the base building , then you might have a better time than I did, just dont get sucked into the FOMO cycle.", 0.5428096652030945], ["At first, No Man's Sky was such a colossal mess that the memes about its failure were almost as infinite as the universe it promised. A launch so incomplete it was like buying a rocket and getting a rusty shopping cart instead. People tore it apart, then forgot about it. But, surprise! A couple of years and thousands of updates later, the universe has transformed into something surprisingly beautiful. Now you can soar over planets that are not only visually stunning but also full of life and activities. Sure, the “now it’s great” magic came a little too late, but at least now you can live the fantasy of being a space explorer without wondering what the hell went wrong in the first place. No doubt, what was once a cosmic disappointment is now an intergalactic masterpiece.\n\n[table]\n    [tr]\n        [th][h3][b]QUALIFICATION[/b][/h3][/th]\n        [th][h3][b]9/10 ROCKETS [/b][/h3][/th]\n    [/tr]\n[/table]", 0.5413944125175476], ["Started as a disappointment, turned into one of the best redemption arcs in gaming. \nNow I wander through breathtaking planets and get hopelessly lost in space. There’s not much to do, but somehow, I keep coming back. It’s peaceful, it’s beautiful, and it helped me keep my thoughts composed when I needed it most. Honestly, this game cured my depression more than any therapist ever could. 10/10 would get lost again.", 0.5384615659713745], ["I had high hopes for No Man's Sky. I tried many times, but it just can't hook me. I'm uninstalling after several hours.\r\n\r\nThe main problems, as I experienced them:\r\n\r\n1) Not fun to progress. Typical No Man's Sky quest: go to X and do Y. You go to X, but there's no Y to be found. You alt-tab to your web browser, and search up what is wrong. By the time you figure out how to work around the broken quest (or badly communicated quest goals), you feel like you're doing a job, not playing a video game. Next time you think about launching the game, a feeling of dread overwhelms you.\r\n\r\n2) Grindy and tedious - the game seems to be balanced to 'make the user spend time walking' rather than 'fun'. Which is unfortunate, because travelling (on planet or in space) is slow and awkward. It's cool that there is a lot of vegetation and ground objects, but literally everything inhibits my movement, every 0.5 seconds. That part where your starter ship runs out of fuel in transit, and there is nothing nearby to fuel it with? *Chef's kiss*\r\n\r\n3) Ugly - dear god, what graphic designer thought it would be a good idea to make your buildings WOOD PANELLED? Whatever desire I had to build a cool planetary outpost evaporated when I saw the joke that is No Man's Sky base tileset. You're on a vibrant, colourful alien planet, and your house looks like a 70s station wagon. Just tragic.\r\n\r\nPeople are fawning over this game, but I can find a half-dozen cheaper base-builder / exploration titles that keep you in the fun zone way better.", 0.5352112650871277], ["There's always more to discover, always more to do, always more goals ahead of you. 91 hours in and I haven't even finished the main quests because I've been too busy doing other things. It's a game as chill as you take it. Totally worth your money.", 0.523809552192688], ["Sit back, relax and turn on No Man's Sky. I used to be an everyday gamer. Then life happened. Now every now and then, when i get a couple of hours, this is the game i came back to.", 0.523809552192688], ["Came out a hot mess but its incredibly deep now and lures you into a vast ocean of exploration. The combat is kind of understated but the scavenging and crafting is actually really cool. I really find the Atlas storyline intriguing and its drawing me in to learn more and engage with various systems in the game. NGL I didnt have much faith in the game back on release and pulled a try before you buy. The game really was so promising even back then but the reality was that it was such a shallow experience you really couldn't be bothered to to stay long enough to see the qualities this title offers. It's somewhat of a walking sim in that a big part of what'll draw you into this game is the ability to enjoy the exploration for what it is: The digital vistas of open landscape with beautiful horizons interrupted by moments that have left physical remnants of previous explorers meeting their end, established colonization throughout the galaxy, or the remnants of a civilization long forgotten yet ever present. If you aren't here to see and interact with what's out there then you'll get bored faster than you'll find a reason to continue.", 0.523809552192688], ["Expansive, beautiful game. It can become a little tedious with crafting and farming for items, but it is still an enjoyable time exploring the worlds of No Mans Sky.", 0.523809552192688], ["I don't know why nobody told me about this game.  Probably because they knew I would never do anything irl again.  It's so good, love it.  I actually need to sleep more and play it less.  Bit of a learning curve on some of the stuff and not a lot of direction, but I like that.  You can just do whatever, read the descriptions and functions of things, watch some youtubes for starter tips.  This game is just amazing, basically limitless.  Its got survival, it's got crafting, it's got mining, it's got space pirate battles, space hulk exploration, wildlife cataloging and hunting, farming, foraging, base building, technology trees, combinations and configurations for all the different tech, weapons, vehicles and ships, you can build your own fleet and send them on missions, recruit a squadron of fighters to back you up when things get hostile, explore black holes and extra dimensional space, deep world building and lore, linguistics and research, submarines and deep sea exploration on alien worlds.  It's a wonderful universe to warp into and unwind after work, make some progress on my fleet or upgrade my ship and mine something, take some pictures, kill some critters, whatever.  100/10", 0.523809552192688], ["This is a fun game, Being updated consistently since release, The size of the universe is massive. I go back to the game all the time due to the expeditions they do every few months. This is a game that should be in your library, hours and hours of game play.\n\n10/10 will play again an again. See you in the Anomaly!", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/275850/a98cb49e7544cfe93ddb259fa7cd44859fb79913/header_alt_assets_15.jpg?t=1742997746", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/275850/383e42d6c89fae0016a9f970cea85c3dd139e1c3/capsule_231x87_alt_assets_15.jpg?t=1742997746", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/275850/383e42d6c89fae0016a9f970cea85c3dd139e1c3/capsule_184x69_alt_assets_15.jpg?t=1742997746"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.no-mans-sky.com"}, "developer": "Hello Games", "owners": "5,000,000 .. 10,000,000", "tags": ["Open World", "Open World Survival Craft", "Space", "Exploration", "Sci-fi", "Survival", "Procedural Generation", "Adventure", "First-Person", "Multiplayer", "Sandbox", "Singleplayer", "Atmospheric", "Crafting", "Space Sim", "Indie", "Action", "Simulation", "FPS", "VR"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Dutch", " Japanese", " Korean", " Polish", " Portuguese - Portugal", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 10300, "number_of_achievements": 27, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Tracked Controller Support", "VR Supported", "Steam Trading Cards", "Steam Cloud", "Remote Play on Tablet", "Remote Play on TV", "HDR available", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "No Man's Sky is a game about exploration and survival in an infinite procedurally generated universe.", "long_description": null}