{"name": "BeamNG.drive", "app_id": 284160, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£19.20", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 158214, "negative_reviews": 3775, "reviews": [["If you have a bad time rn this is the best game Because you can slam into a tree with 200mph+ without any consequences", 0.8962111473083496], ["-Download Beamng.\r\n-crash car.\r\n-find mod with more car.\r\n-crash that car.\r\n-find more mods.\r\n-games breaks.\r\n-uninstall and re-install\r\n-fun times", 0.8040087819099426], ["Very realistic car physics and fun open world car game but no sex mod yet", 0.7259677052497864], ["[h1]I Would Recommend! 100%[/h1]\r\n\r\nI really enjoy playing BeamNG, it's fun to just jump on and race some cars around and smash them, this game is a great way for me to release stress and may be for you to.\r\n\r\nIf you like racing cars or trucks, smashing stuff up and just messing around, this game may be for you.", 0.7062937021255493], ["100/10, One of, if not the best car simulation game of all time.\n\nWhatever you think is missing from every other car game, this one has. Just driving around admiring the view or making an incredible view of utter destruction, this game will show you things you have always wanted to see. The admiration and spectacular amount of effort the developers have done to make this remarkable game, will go down in history. Whether you want to race, crash, drift, drive, customize, etc. No matter what ideas you have, or what you want to do with vehicles or cars in general you have the freedom to do and choose every little detail. The amount of hours i have spent in this game do not matter as i would double or even triple it, if i had the chance to. If this game never existed, i do not know if i would be the person i am today without this game. BeamNG.drive has been there at my lowest and i will always come back to it, its just that dang good. If you put the effort in you can make many more things yourself to fill that void that might be missing in your life. This game has taught me even when you think things couldn't get worse, to always get back up and move forward with great strides. You might be brought down by the difficult burdens of life and i promise you, this game will be the torch that lights the tunnel. I guarantee you this game will be worth it regardless the price, and price doesn't matter when the product is sprinkled in the dust of angels and brought down for the world to experience. \n\nWhen i die, i will be commemorating BeamNG.drive on my tombstone, and i will die peacefully knowing i got to enjoy and pleasure myself with the greatest game of all time.\n\nThank you, BeamNG.drive developers, for giving me something to live for and enjoy for years to come, i greatly appreciate the honor you have bestowed upon me and others for being able to play such a masterpiece.", 0.5945945978164673], ["I put a rocket on a bus and flew it into the side of a cliff, 10/10.\r\n\r\nOff-roading physics like crawling, climbing, or Baja racing is far superior to any other game. Would be amazing if in a future update they added more detailed Mud or Snow related physics.", 0.5833333134651184], ["hands down one of the best Driving Sims, graphics are a bit meh when compared to others in the same genre, however the physics are hands top THE BEST. Can easily lose track of hours modding a car, messing around loading & unloading my car onto a trailer to go to the track, and when I start getting bored after hours of playing I just start crashing into everything lol. Game will have you hooked for hours easily, the mods others have came up with definitely keep the game getting closer to reality with graphics and apps.", 0.5597484707832336], ["BeamNG.drive has some of the most impressive soft-body physics in gaming, and it could be the ultimate driving simulator—but it's incredibly frustrating that after all these years, we're still missing features that should be a no-brainer. No dynamic mud effects on cars? Still no realistic tire smoke? No weather effects like rain or snow? And—somehow—still no official multiplayer?\r\n\r\nFor a game that prides itself on realism, these are huge gaps. It's wild that you can watch every nut and bolt fly off your car in a crash, but your tires stay sparkling clean in the mud, the smoke looks outdated, and you're stuck driving solo in an empty sandbox. No weather means no changing conditions, and no multiplayer means no racing, crashing, or just goofing around with friends—arguably half the fun in any car game.\r\n\r\nBeamNG feels like a masterpiece engine trapped in a beta world. I love this game, but it's hard not to be disappointed when these community-requested features are ignored year after year.", 0.5567540526390076], ["If you're coming from more polished games like Forza Horizon 5 and the like, this might feel a bit strange and clunky at first. Work through that, and you will be rewarded with some incredible experiences you won't find anywhere else. And though it is still in beta, the Rally mode is unbelievably good. They really nailed the frantic, on the limit feeling that other games lack.", 0.5454545617103577], ["34th highest reviewed game on steam for a goddamn good reason. Scratches a different itch for everyone, some people like the crashes, some like the driving, some like the freedom of it.", 0.5454545617103577], ["it gave me a good idea of cars and how they work and how much damage cars really have if you roll them or hit something so its a good game if you want to learn about cars and its working parts", 0.5454545617103577], ["At this time, I cannot recommend this game after the new 0.35 update. UI change was horrible, and overall quality of life suffered, also adding more lagginess to the game, creating a feeling of more instability. Will write a better review if fixed for the future, however I do recommend the game itself. Just a lot to tackle as an experienced player now after the update, one can only imagine a first time player.", 0.5262068510055542], ["An must buy if you like sim racing or crashing cars, has an incredible customization with mods. Also Really Fun With Friends if you use and multiplayer mod (beammp).", 0.523809552192688], ["Good game. Sandbox, multiplayer, fun. Also cool to simulate for science.", 0.523809552192688], ["game is amazing for what it is keeps me busy for hours and i always come back. user friendly somewhat this is my first pc game and it runs fine on my lenovo sometimes i run into bugs that i'm not smart enough to overcome so i have to uninstall everything to play again but other than that five stars.", 0.523809552192688], ["the amount of fun i get on this game it cant get any better.\r\ndrive cars and much more also play with friends and have fun try today.", 0.523809552192688], ["Its the most realistic car game in the world at this moment, you can do anything from speed down a highway and drive out of a truck going 120 or fly down a mountain and crash with their good car physics and slow motion effect.", 0.523809552192688], ["Great game. To be honest, this is only for gamers with dgpu (dedicated graphics cards) but my rtx 3060 handles it fine on 144 fps... great graphics, huge selection of upgrades, pretty much any car you could think of (with mods)... overall I'd give this a 9/10 cuz the only bad thing is that you cant really play it without a dgpu.", 0.5236220359802246], ["A very fun game with a ton of vehicles and variants to drive. The only issue I have is the menu is extremely laggy for me. If you like driving games then you will probably love this game.", 0.52173912525177], ["This game is awesome, the physics is realistic, so are the graphics. Totally worth it.", 0.52173912525177]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/284160/header.jpg?t=1743607220", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/284160/capsule_231x87.jpg?t=1743607220", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/284160/capsule_184x69.jpg?t=1743607220"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.beamng.com"}, "developer": "BeamNG", "owners": "5,000,000 .. 10,000,000", "tags": ["Simulation", "Driving", "Physics", "Destruction", "Realistic", "Automobile Sim", "Sandbox", "Open World", "Racing", "Moddable", "Multiplayer", "Singleplayer", "Early Access", "First-Person", "Third Person", "Exploration", "Funny", "Adventure", "Action", "Flight"], "languages": ["English", " French", " Japanese", " Korean", " Portuguese - Portugal", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese", " Spanish - Spain", " German", " Polish"], "concurrent_plays": 21285, "number_of_achievements": 5, "categories": ["Single-player", "Steam Achievements", "Steam Trading Cards", "Partial Controller Support", "Steam Cloud", "Includes level editor", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play Together", "Family Sharing"], "genres": ["Racing", "Simulation", "Early Access"], "short_description": "A dynamic soft-body physics vehicle simulator capable of doing just about anything.", "long_description": null}