{"name": "Gang Beasts", "app_id": 285900, "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "EUR", "original_price": "18,99€", "final_price": "7,59€", "discount_percent": 60, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 19271, "negative_reviews": 3517, "reviews": [["This is a great game if you like ganging up on people and beating them.", 0.6390658020973206], ["ultra epic sigma game i love to dropkick these people into outer space 50/10 would play again", 0.5566502213478088], ["I grabbed my friends ass cheeks in hope of not falling off a building amazing smelling experience, 10/10 would recommend", 0.523809552192688], ["the characters look and sound drunk. I love this masterpiece of a game!", 0.5], ["\r\nGang Beasts is a fighting game where you can fight as different characters made of plasticine. For me, it's a banger and I also like that you can customize your character however you want. Also to mention that this game can be played up to 8 people. You can choose to play with random people or even with your friends. You can choose if you want to play local or online and you can also choose the map that you want to play on or you can set the map to be random. Cuztomization is cool because there are a lot of different things you can put on your character. Each map has it's own ambient and unique technics. Each round is up to 3 wins if you are playing with random players but you can customize the number of max wins if you play with your friends. Each map takes about 3-5 minutes and if the timer runs out, it will be a draw. Most of the maps also include some things that will activate after around 2 minutes of the match and the purpose of it is so that the players don't easily get a draw and they will have to meet some troubles at almost the end of the match. This was a description about what Gang Beasts is about. See you all next time!", 0.5], ["I've brought this game on my laptop to three parties now, mirroring the screen on a TV and playing with CRKD controllers. It's been a huge hit every time - I've gotten more controllers now so that more folks can play at a time. It's playable alone, but the most fun with your friends.", 0.5], ["one of the best games i have ever played, honestly deserves to be way more popular and is so fun.", 0.5], ["HELL YES. If you like party games or anything with ragdolls. THIS IS FOR YOU. I HIGHLY RECOMMEND YOU PLAY THIS. MY ENTIRE FAMILY HAD A BLAST WITH THIS. THERE IS SO MANY FUNNY MOMENTS. this is a underrated game. Try it RIGHT NOW.", 0.5], ["this game i play is a funny game i do recommend for as it is funny when your playing alone or with a friend i made vids of if a fox plays this game but my yt was deleted this game is fun as long as thay dont make it messed up in the future", 0.5], ["I think some of the novelty fades due to exposure, but even so some of my favorite, most gut-busting gaming memories with friends were enabled by this goofy brawler. And that's not nothing.", 0.5], ["silly game hard to master, good challenge... more map variety would be great! seems like the same maps are seeded first, more random would be beter.", 0.5], ["This game makes me happy. Sure, it doesn't have the player base it used to by any means. If you're just looking for slap happy fun then this game is the game for you.", 0.5], ["When Gang Beasts first came out, it was something special. The wobbly physics, hilarious rag-doll brawling, and absurd levels made it an instant classic for couch co-op and online chaos. It was the kind of game you’d throw on with friends and end up crying from laughter—every fight was unpredictable, every win felt ridiculous, and that was the charm.\n\nBut over time, it started to lose its edge. While still fun in short bursts, it never really evolved. Updates were few and far between, and the mechanics—while intentionally clumsy—started to feel more frustrating than funny. The novelty wore off for a lot of players.\n\nThen Party Animals came along and basically did everything Gang Beasts does, but better. It kept the goofy physics and brawling chaos, but added smoother game-play, better polish, tighter controls, and more content right out of the gate. It’s hard to go back to Gang Beasts after experiencing the faster pace and modern feel of Party Animals.\n\nAt this point, unless you’re feeling nostalgic or just love the original art style and simplicity, there’s not much reason to pick up Gang Beasts over Party Animals. It had its time, and it was a blast—but that time might have passed.", 0.4761904776096344], ["liked it because its fun and i saw another people playing it so i wanting to try it out and it was fun to play", 0.4761904776096344], ["Ridiculously fun with friends, despite seeming incredibly dumb.", 0.52173912525177], ["its a very fun game to play with freinds, expect abu baker", 0.46783626079559326], ["amazingly good but if you have a magic mouse you cant climb so mac players, i dont reccomend this for you. if you use a trackpad its even worse.", 0.5], ["I love this game the 2014 version is so fun with family and friends", 0.5], ["They are fighting, and I get into the crane's driver's seat.\nI turn left\nThey all fall down\nEasy win\n\n10/10", 0.5], ["gREAT GAME, PEAK GAMEPLAY, PEAK FRIEND FOR PLAYING GAME. i best in world. learn super headbutt and dropkick.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/285900/header.jpg?t=1732109683", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/285900/capsule_231x87.jpg?t=1732109683", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/285900/capsule_184x69.jpg?t=1732109683"}, "support": {"support_website": null, "support_email": null, "game_website": "http://gangbeasts.game"}, "developer": "Boneloaf, Rocket Science", "owners": "2,000,000 .. 5,000,000", "tags": ["Funny", "Physics", "Multiplayer", "Colorful", "Party Game", "Local Multiplayer", "Party", "Fighting", "Comedy", "3D Fighter", "Casual", "Soundtrack", "4 Player Local", "Co-op", "Family Friendly", "Beat 'em up", "Memes", "Third Person", "Singleplayer", "Indie"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Portuguese - Brazil", " Japanese", " Korean", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 390, "number_of_achievements": 19, "categories": ["Multijugador", "JcJ", "JcJ en línea", "JcJ a pantalla (com)partida", "Pantalla partida/compartida", "Logros de Steam", "Compat. total con mando", "Remote Play en móvil", "Remote Play en tableta", "Remote Play en TV", "Remote Play Together", "Préstamo familiar"], "genres": ["Acción", "Aventura", "Casual", "Indie", "Simuladores"], "short_description": "Gang Beasts es un desternillante juego multijugador de peleas absurdas entre personajes gelatinosos y gruñones que tienen lugar en los peligrosos entornos de las calles de la ciudad de Picadillo.", "long_description": null}