{"name": "Sid Meier’s Civilization® VI", "app_id": "289070", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 84886, "negative_reviews": 15021, "reviews": [["Civilization VI is a fun game, with enjoyable game play, an art style that has a lot of charm, and a good level of challenge.  I've played every Civ game, right from the first one that came out. However, I can not recommend purchasing or installing games from this company. Their EULA is entirely unacceptable. Like a lot of game companies these days,  they have instituted draconian policies putting the people who purchase and play their games in an untenable position of having no real rights or recourse while having to accept the root kitting and data harvesting of their computers. It's not about better service, it's about greed and control. I'm disappointed that Firaxis went this way. Up until now, I always felt I got fair value for my money with a Civ game. I won't be purchasing Civ VII or any other game from them or 2K  until these policies are changed permanently.", 0.8553414344787598], ["Endless variations mean hundreds or even thousands of hours of game play. One of the best values I've ever had for my entertainment dollar", 0.7789255976676941], ["just buy this instead of 7, more stuff, better gameplay, and much cheaper", 0.705187201499939], ["It's the best Civ. One of the biggest things they improved on relative to Civ V was that you no longer have to restart the game if your first city wasn't built on the coast and on a hill. I have zero complaints about this game, and only wish they kept adding leaders. But make sure to get all of the expansions and the critical mods like quick deals, extended policy cards, and map tacks.", 0.6174066066741943], ["one night I was thinking to do one game before sleep on standard speed with emperor difficulty, after some times of playing then I check the clock was showing at 4. When I decided to stop and go to sleep, the next thing I know is its not 4 am in the morning.", 0.5942422151565552], ["Better than civ 7 by far, but not as good as earlier civs when it came out. OK now, but such a lost opportunity.", 0.5795266628265381], ["i find this game very relaxing.  I usually plays only 30 min to an hour.  so one gate often take a week or more.  I like that i can set the dificulty level  from relaxing (I win)  to difficult enough that i lose.  i save the start and some times play the same game over but i have to 'win' using one of the other ways than i won last time.  like chess, you have to plan your plans and 'attack' ahead, some time 100 years.  I started with the first civ game.  the graphics is very good, but i usually turn the music down.  I don't think i will be moving to civ 7 as i understand they have the game divided into 3 different plays.  i like the 'long game' where you have to plan for the future if you want to be successful", 0.5466757416725159], ["Like many civilization games, this one moves in the right direction while at the same time making some game design decisions that make you want to play the predecessor.  In this one, they went with a more cartoony look (which I don't like) and introduced the district system. I both love and hate the district system, its cool and makes things more strategic, but its annoying to want to build a building and you have to build a district first, and you're all out of room or don't want to demolish your improvements on the map.", 0.5396419763565063], ["I have thousands of hours in the Civilization series. I could not get into this game's art style. The graphics for the map and terrain felt blah. I found the UI to be a step back in organization from the previous installment. I have tried to start several games and I find it a chore to go from one turn to another. I thought it was my not enjoying the civ leader but after several starts, I know it's the game and art style I'm not clicking with.\n\nI feel this game is a step back in a lot of ways from previous Civ installments that leave the game feeling clunky and more of a Civ knock-off rather than a real Civilization game.", 0.5369249582290649], ["I don't recommend games that are a copy/paste of previous games then tweeked with massive amounts of DLCs that cost an insane amount of money and a few are almost as expensive as the base game. Yeah of course you're going to get this on sale for cheap like I did, but thats b/c they restrict you to basically nothing then demand 100+ dollars worth of DLC's to play a game that should've been released completed. Map feels small, even on the biggest map setting i could find, probably hidden behind some DLC, along with bug fixes and a complete game.", 0.5255006551742554], ["This version allows for personal game cheat programs to add gold etc...   The newest one does not and will not allow a cheat to be used on a personal, single game. Don't buy the new one VII, the ability to level the poorly skewed gameplay makes it playable.", 0.5076586604118347], ["After being forced to play this game for a good bit I have to say it's pretty bad. The basic strategy for it is to spam cities to a level that every one of your settlements are stealing tiles from another. Then you just build whatever district relates to your chosen win condition. The game even enforces this playstyle with the loyalty mechanics. If you aren't close to your other cities your cities will rebel, and if you don't have the means of stopping it that city is just gone, nothing you can do about it. Conquer it after the rebellion? It's rebelling again in six turns and will spawn two units to defend. Sorry, you should've settled two tiles from your capital.\n\nThe other thing enforcing this playstyle is that war is more of a slog compared to Civ 5, which is an absolute travesty. Civ 5 wasn't a perfect game, but it was fun. War was a matter of keeping up in tech/production and your city placement. Once A bombs come around things can get a little hairy, but as I said Civ 5 is not a perfect game. This game wants you to learn adjacency bonuses for the extremely important districts and also the ins and outs of the superfluous amount of new units. Civ 6 is like if mario party tried to add more mechanics to increase its complexity. That's just not what civilization is about. You could get your friend who only plays Call of Duty on Civ 5 and they'd intuit enough to be relevant. Civ 6 expects you to take the time to learn its tedious mechanics to succeed. \n\nIt's not as if I don't like more intense strategy games, I'm a big fan of grand strategy games in fact. Civilization will never be and should never be that though.", 0.5022624135017395], ["Every leader is mad at you for breathing. 0/10 diplomacy simulator.", 0.5020576119422913], ["Super complex game, slow game play, poor tutorial. there are many other RTS games worth your time. Wouldn't even rate this game. Isn't even worth $20", 0.5], ["Mom doesn't allow me to play first person shooters (too violent, she says). So instead, I'm starving people to death for short-term science-point gain (This will allow me to Greatly Leap Forward past Ludwig who is like 15 turns away from a culture victory).\n\nIf that doesn't work, i can always still nuke his cities to ashes.\nGo for peace. Go for that Diplo-victory.\n\n9/10 would recommend veri peaceful game.", 0.5], ["An excellent improvement from 5.   Some of the options in the DLC really change the game, but it manages to keep being Civilization.  That being said some of the options introduced aren't well used by the AI and can really nerf things with certain mixes of settings.  Overall an excellent game.", 0.5], ["This game use to be fun - it's now too cumbersome and complicated and feels more like a history class - wish I had the old version :-(", 0.5], ["Just a nice remake of a classic, very playable and very similar to the original, heaven really!", 0.5], ["I can't in good conscience recommend this game. It's likely just not for me considering the cult following and community hype this series has amassed.\n\nIt's a silly game that has perfected the \"just one more turn\" mechanic but everything else is infantile. Probably to make it more approachable for casual gamers and new players. It doesn't really seem to matter much what you do in this game, winning is extremely easy if you follow broad stroke and obvious strategies you can borrow from other games. Pump research, pump religion, pump military - expand rapidly to pump more. It doesn't matter what research or policies you implement, why bother reading what they do or plan for it at all. Diplomacy is a joke. Everything is, really. There's no real flavour or character to the game; it's just skin-deep. Perhaps it matters more if you pump the difficulty up to the maximum level, but it's not fun enough to motivate you to do so.\n\nI put in just enough time to beat the game and give it as fair a review as I can after years of hearing all the hype that surrounds this game.  I don't see myself doing it again. There are far better board games out there. To see it make it this far gives the same feeling as when you see the 43rd reimplementation of Catan or Ticket to Ride. It was probably great for its time, but it should've just stayed there.", 0.5], ["Very good\r\n\r\nMicbraiv - Prevents everyone from constructing defensive buildings except its suzerain?", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/289070/header.jpg?t=1740607040", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/289070/capsule_231x87.jpg?t=1740607040", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/289070/capsule_184x69.jpg?t=1740607040"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.civilization.com/"}, "developer": "Firaxis Games, Aspyr (Mac), Aspyr (Linux)", "owners": "10,000,000 .. 20,000,000", "tags": ["Strategy", "Turn-Based Strategy", "Multiplayer", "Historical", "Grand Strategy", "Singleplayer", "Turn-Based", "4X", "War", "City Builder", "Simulation", "Tactical", "Management", "Building", "Great Soundtrack", "Online Co-Op", "Moddable", "Co-op", "Hex Grid", "Atmospheric"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 41136, "number_of_achievements": 320, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "LAN PvP", "Shared/Split Screen PvP", "Shared/Split Screen", "Cross-Platform Multiplayer", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "In-App Purchases", "Steam Turn Notifications", "Remote Play on Tablet", "Remote Play Together", "Family Sharing"], "genres": ["Strategy"], "short_description": "Expand your empire, advance your culture and go head-to-head against history’s greatest leaders. Will your civilization stand the test of time?", "long_description": null}