{"name": "The Witcher 3: Wild Hunt", "app_id": "292030", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£24.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 213246, "negative_reviews": 6978, "reviews": [["After hitting 100% completion in The Witcher 3, I honestly feel like I’ve finished a journey, not just a game. I’ve done every quest, explored every corner, beat both expansions, and yeah—even finished my Gwent deck. It’s wild how much this game pulled me in.\r\n\r\nWhat stood out the most was the storytelling. The characters felt real—Geralt, Ciri, Yennefer, even smaller side characters had depth. Every choice I made actually mattered, and I found myself thinking about the consequences long after I’d made them. Some outcomes hit hard, in a good way.\r\n\r\nThe world is massive, but it’s also full of detail. It’s not just big for the sake of it—there’s something meaningful almost everywhere you go. I’d get sidetracked constantly, and I didn’t even mind. Riding through Skellige or watching the rain in Velen felt peaceful sometimes, like the game gave me space to just be in its world.\r\n\r\nThe expansions were another level. Hearts of Stone had one of the best villains I’ve ever seen, and Blood and Wine felt like a whole new game on its own. I took my time there just soaking it all in.\r\n\r\nCombat took a bit to get used to, but once I got into a rhythm—mixing signs, potions, dodging right—it felt great. I wasn’t just swinging a sword, I was preparing for fights, thinking like a Witcher,\r\n\r\nHonestly, finishing everything felt like closing a great book. It’s rare a game sticks with me like this. If anyone’s wondering whether it’s worth fully diving into The Witcher 3, I’d say absolutely. It’s more than worth your time. :)", 0.6296296119689941], ["I love this game so bad!!!!!!!!! The story, characters, music, and environment are everything I've ever wanted I love u the Witcher 3 this is my favorite game ever ^_^", 0.6115362048149109], ["Recommended ⭐⭐⭐⭐⭐ (187+ hours played)\r\n\r\nIf there’s one game that defines what an open-world RPG should be, it’s The Witcher 3: Wild Hunt. After 187 hours, I can say with confidence—this game is a masterpiece.\r\n\r\n✅ Pros:\r\n\r\nUnmatched storytelling. Every quest, even side quests, feels meaningful and well-written.\r\n\r\nA breathtaking world. From the war-torn lands of Velen to the bustling streets of Novigrad, everything is stunning and full of life.\r\n\r\nGeralt is an amazing protagonist. A badass monster hunter with depth, wit, and choices that actually matter.\r\n\r\nCombat is satisfying. Once you get the hang of dodging, signs, and potions, every fight feels like a strategic duel.\r\n\r\nDLCs are better than most full games. Hearts of Stone and Blood and Wine add incredible content and a perfect ending to Geralt’s story.\r\n\r\nGwent. What started as a simple card game in a tavern became an obsession.\r\n\r\n❌ Cons:\r\n\r\nControls can feel clunky at times. Geralt has a mind of his own when trying to navigate tight spaces.\r\n\r\nThe inventory system could be better. Sorting through gear can be a bit tedious.\r\n\r\nYou might lose your real-life social life. Seriously, this game sucks you in.\r\n\r\nAfter 187 hours, I still want more. The Witcher 3 is one of those rare games that delivers an unforgettable journey. If you haven't played it yet, you owe it to yourself to experience it.\r\n\r\n⭐ 10/10 - Toss a coin to your Witcher, and another 100 hours to your playtime.", 0.547325074672699], ["Great for steamdeck playthrough. Perfect fit. Perfect russian VO.", 0.5454545617103577], ["One of the best rpg experiences I've ever had. I've been playing since the ps5 version and this game has really grown on me. Definitely an incredible atmosphere, characters, an amazing ost, but above all, GWENT", 0.5454545617103577], ["Beautiful game especially after the update , the combat system feels a bit like Dark Souls if you play it on hard difficulties . The main story is amazing ,enemies are well leveled and per total game design and placement 10/10", 0.5454545617103577], ["Incredible game, rich story and world to explore, quite a few builds to try out, everything a RPG should have. Geralt is a good lad.", 0.54356849193573], ["incredible game I have bought this masterpiece four or five times across different platforms and never get tired of playing it You can easily spend over two hundred hours in this beautiful world and still find something new every time If you have not tried it yet whether you are an RPG fan or not you absolutely should This game holds a special place in my heart and always will", 0.54356849193573], ["One of the greatest games I have ever played, even though its now a few years old.\nThe story and the sidequests are just addicting and especially the lighting makes the game still beautiful to look at.", 0.523809552192688], ["I. A Tapestry of Tales: Narrative Mastery\r\n\r\nThe Witcher 3: Wild Hunt is not merely a game; it is a living chronicle where every choice reverberates through a world teetering on the edge of chaos. The story of Geralt of Rivia, a grizzled monster hunter navigating political intrigue, fractured loyalties, and existential threats, unfolds with Shakespearean gravity. The central quest to find his adoptive daughter, Ciri, intertwines with morally ambiguous subplots—such as the haunting saga of the Bloody Baron, whose tragic duality between tyranny and redemption remains one of gaming’s most profound character studies. Even minor side quests, like uncovering the secrets of a cursed village or mediating a peasant’s feud, are imbued with emotional weight, ensuring no thread in this vast tapestry feels inconsequential.  \r\n\r\n...\r\n\r\nII. A World Alive: The Art of Immersion\r\n\r\nFrom the rain-soaked alleys of Novigrad to the sun-dappled vineyards of Toussaint, The Witcher 3 crafts a realm that breathes. Its open world eschews hollow expanses for dense, purposeful design—a crumbling fortress might hide a monster’s lair, while a roadside shrine whispers forgotten lore. The game’s “sense of place” is amplified by dynamic weather, day-night cycles, and NPC routines, creating an ecosystem where even a stray wolf’s howl feels intentional. The recent next-gen update, with ray-traced lighting and DLSS 3, elevates this beauty into a painterly vision, where fog-cloaked forests and candlelit taverns become scenes from a medieval illuminated manuscript.  \r\n\r\n...\r\n\r\nIII. Combat and Alchemy: The Dance of Steel and Sorcery\r\n\r\nGeralt’s combat is a ballet of preparation and precision. Each encounter demands strategy: oils to weaken foes, signs to control the battlefield, and dodges timed to the millisecond. While the system lacks the fluidity of pure action games, its depth lies in asymmetry—a Griffin’s aerial dive feels distinct from a Drowner’s swamp-bound ambush. Alchemy, often a tedious chore in RPGs, here becomes a ritual of survival, as brewing potions under moonlight or decocting toxins from rare herbs ties gameplay to the world’s gritty authenticity.  \r\n\r\n...\r\n\r\nIV. The Symphony of War and Whispers\r\n\r\nFew games marry audio and visual storytelling as seamlessly. The score, a haunting blend of Slavic folk motifs and orchestral grandeur, swells during battles and fades into melancholic lute strains in quieter moments. Voice acting, particularly Doug Cockle’s gravelly portrayal of Geralt, anchors the drama, while ambient sounds—a blacksmith’s hammer, a tavern’s drunken chorus—layer immersion like brushstrokes on a canvas.  \r\n\r\n...\r\n\r\nAmidst the wild hunt’s shadowed cry,  \r\nA witcher walks, where ravens fly.  \r\nThrough blood and wine, through love’s sharp thorn,  \r\nA tale of hearts, both forged and torn.", 0.523809552192688], ["[h1] The Witcher III: The Wild Hunt [/h1]\r\n[h3] \"The song of blood, steel and decisions, that hurt more than an edge of a blade\" [/h3]\r\n\r\nMy rating: 9.5/10\r\n\r\n🧙‍♂️ OVERALL IMPRESSION:\r\nSo, to start, this game was lying in my library for 4 years. Then I started and could not stop until I finished EVERYTHING the game will offer you. It is one of the best RPG games - a massive world that feels welcoming and easy to understand, a great story, and a fabulous atmosphere - this is my review of Witcher 3: The Wild Hunt (+ DLCs). \r\n\r\n🎮 GAMEPLAY:\r\nThe combat system is unique, and it took me some time to get used to it. Once you do, you are a killing machine. Don't forget about runes you can cast, potions you can drink, food you can eat, tinctures you can craft, and your deadly two swords. Crafting feels nice after understanding it. Exploration feels fluent and rewarding. You have a feeling there is so much to do in any direction you move, but it doesn't feel overwhelming, which is a big plus. The only thing I wanna mention here is a healing mechanism. If you don't have DLC, you are missing some crucial skills to get in the early game. That can cost you a lot of nerves, playing on higher difficulties.\r\n\r\n🎨 GRAPHICS:\r\nThis game was released in 2015, and it looks way better than some modern triple-A games. Its stunning colour palette is vivid and lively. It's very well made according to the mood and atmosphere of a game. It's gloomy when you are in a dark cave killing monsters and bright when you are with your friends drinking beers in Kaer Morhen.\r\n\r\n📖 STORY AND ATMOSPHERE:\r\nThe story unfolds after the events of \"The Witcher\" book series, continuing the tale from \"The Witcher 2\" video game. It's masterfully written, with a main questline that feels both monumental and deeply immersive. The characters are richly developed, and forming a strong emotional connection with them comes naturally and quickly. Sidequests are another thing that makes this game stand out so much. They are not repetitive and give you an incredible feeling of the fantasy world, its people, nature, creatures and atmosphere. Lastly, the music is majestic, outstanding, atmospheric and mesmerizing. Indeed, a masterpiece.\r\n\r\n✨ YES / NO:\r\nI wholeheartedly recommend it, but take my advice: Do not make the same mistake I did by playing the first half of the game without the \"Blood and Wine\" DLC. Get it because it's absolutely stunning. It also unlocks essential skills that make a significant difference in the early stages. \r\n\r\n🗡️ ACHIEVEMENTS:\r\nIf you're an achievement hunter like me, you'll need both DLCs. All of the achievements can be unlocked in a single playthrough, but many are missable, so either prepare for a few extra runs or consult a guide.\r\n\r\n⏱️PLAYTIME:\r\nMain game: 78 hours (normal difficulty + side quests)\r\nMain + DLCs: 110 hours\r\n100% completion: 122 hours + one additional NG+ playthrough on highest difficulty", 0.523809552192688], ["Best game I've ever played the story is Amazing. \nAnd the graphics are so good for a game from 2015!\nLooking forward to the witcher 4", 0.523809552192688], ["I really really hate autolock in game. After playing DS 1 to 3 and Elden ring autolock in Witcher is so bad. I stopped using it but still Geralt turns to nearby enemy when i just want to run past them. And casting signs..... gl. But other than that i think game is pretty solid.", 0.523809552192688], ["why?\n-masterpiece of a game: dating-hunting-singlefather simulator with slavic european mythology on top.\n-WILL improve your taste in men\n-WILL make you finally read books\n-PROBABLY will make you a better person or otherwise (because of how much game force you to question yourself)\n\n\nDONT QUIT IF IN SOME POINT IT SEEMS BORING YOU MISSING OUT A GREAT STORY", 0.523809552192688], ["This game still has something to say after ten years of development and is better and equal in many areas and game-making parameters that we have seen in this genre of games in recent years and is one of the best games in this genre and still has its fans. I am very eager for the fourth series of this game series to have fun and adventure in the world of The Witchers.\n\nزیر نویس بازی را از گیم ساب خریداری کنید و از این بازی لذت ببرید", 0.523809552192688], ["I played this game for the first time on my friend`s laptop, then I bought a PC and played it there, then I`ve got Steam and started it here, then I tried it on PS4... and every time it  is still entertaining and feels great. \n\nI really love the storytelling, designs, characters and atmosphere overall. \n\nDefinitely this game is the GOAT.", 0.523809552192688], ["The game that has become the laurel wreath that crowned the gaming industry is not just entertainment, but a whole cultural phenomenon. It is like a symphony, where every instrument, every note, be it visual style, exciting plot or innovative gameplay, merge into a single harmonious whole. It is a work of art that has touched the hearts of millions, leaving an indelible mark on the history of the gaming industry. The success of this game is not an accident, but a natural result of painstaking work and talent. This is a game that will live in the memory of millions for a long time.", 0.523809552192688], ["After finishing every possible choices in this game, every other game seems bad compared to the witcher 3, a seriously great story rich gameplay, not just the story quests, even side quests and random quests!", 0.5205479264259338], ["Words can simply not describe how much I love this game, but will certainly do my best:\r\n\r\nCharacters - Existing characters such as Geralt, Triss, Ciri, Dandelion, Yen, Keira (plus Shani and Regis for the expansions) have been utilized brilliantly from the source material and used so well in the world the game has created, and boy what a world it is! The characters I previously mentioned are probably the ones that stood out for me the most, but to be honest there are so many brilliantly constructed characters (even minor ones like Bart the Rock Troll) that I simply don't know where to even begin... Geralt's interaction with most them is simply brilliant, and the game has so many amazing, memorable moments because of it (including the famous 'drinking game segment' at Kaer Morgen). You also get a logged back story for each character, most of it taken from the books and/or previous games. which is brilliant if, like me, you decided to read the books afterwards or couldn't be bothered playing through the first couple of Witcher games (although I did get through 3 stages of the original game). It's obviously more important to have this as there is alot of stuff in the game that needs back story to elaborate on, weither it be a situation or certain dialogue. Oh yes the dialogue, love love love some of conversations in this game. You can tell alot of thought and effort went into it. The character dialogue for the most part, particularly for Geralt is so complex and funny. As it is with certain other characters mind you, but Geralt's obviously stands out the most\r\n\r\nEnvironment - The graphics and art design for all the environments are simply brilliant, each location had its own distinctive feel and is and absolute joy to explore (I spent about 2 weeks just exploring Skellege's oceans and vast landscapes)\r\n\r\nMonsters/Enemies - Such a huge assorted variety, honestly you can never get bored with the variety of enemies you face. I also love that each monster has it's own unique methods of quickly being dispelled, and everytime you discover something a description will pop up in the beast log, breaking up everything into different categories aswell\r\n\r\nStory - Soooo gooood. Honestly story elements wise, I don't think any game is going to even come remotely close. Especially given that so many of the side stories actually match, and even sometimes exceed, the complexity and epicness of the main storyline\r\n\r\nCombat - Kept interesting through the graphic, stylized fighting and dismemberment. Aswell as the additional use of things like signs and potions. Once again you usually need to use certain combinations of things to kill my monsters more easily, particularly the more defined 'boss level' ones\r\n\r\nExpansions - BRILLIANT. Hearts of Stone has truely amazing story and character elements. While Blood and Wine does this on a slightly lower scale but adds another beautiful environment with various new enemies to face\r\n\r\nSo basically this the best I can do to some up how epic The Witcher 3 is. But honestly, just play the damn game!!!\r\n\r\n10/10", 0.5199999809265137], ["Ah yes, the legendary Witcher. Slayer of monsters, master of signs, and olympic gold medalist in dodge rolling. Combat feels less like an epic duel and more like an endless interpretive dance routine. I came to hunt monsters, not audition for Cirque du Soleil.", 0.501514196395874]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/292030/header.jpg?t=1736424367", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/292030/capsule_231x87.jpg?t=1736424367", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/292030/capsule_184x69.jpg?t=1736424367"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.thewitcher.com/witcher3"}, "developer": "CD PROJEKT RED", "owners": "10,000,000 .. 20,000,000", "tags": ["Open World", "RPG", "Story Rich", "Atmospheric", "Mature", "Fantasy", "Adventure", "Singleplayer", "Nudity", "Choices Matter", "Great Soundtrack", "Third Person", "Medieval", "Action", "Multiple Endings", "Action RPG", "Dark Fantasy", "Magic", "Dark", "Sandbox"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Czech", " Hungarian", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Traditional Chinese", " Turkish", " Simplified Chinese", " Spanish - Latin America"], "concurrent_plays": 16992, "number_of_achievements": 78, "categories": ["Single-player", "Steam Achievements", "Steam Trading Cards", "Steam Workshop", "Partial Controller Support", "Steam Cloud", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["RPG"], "short_description": "You are Geralt of Rivia, mercenary monster slayer. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down Ciri — the Child of Prophecy, a living weapon that can alter the shape of the world.", "long_description": null}