{"name": "Call of Duty®: Infinite Warfare", "app_id": 292730, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£39.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 5213, "negative_reviews": 3417, "reviews": [["This game currently has a major Remote Code Execution (RCE) vulnerability that hackers are actively exploiting. When playing you bare the risk of getting a RAT (Remote Access Trojans) — meaning they can take over your PC just from being in a public match.", 0.8357338905334473], ["FYI BEFORE PURCHASE:\n After downloading the game, to actually play it you need to *turn off optimizations for windowed games* in windows graphics settings for the game to work. \n\nGo to display settings>system>graphics and turn off optimization for infinite warfare and then you can play! \n\n(also, if you want to play zombies, you need to have the Multiplayer content DLC enabled)\n\ngreat zombies and campaign!", 0.6416938304901123], ["The game chrashes the moment gameplay is abt o begin", 0.625289261341095], ["I know people clowned on this back in 2016, but honestly? It’s one of the best CODs out there.\n\nCampaign surprised me. actual emotional depth, great writing, and some of the best space combat in any shooter. It felt like COD meets Mass Effect and I loved every minute of it.\n\nZombies in Spaceland is straight up hilarious. Neon ‘80s vibes, awesome soundtrack, and the map has this weird, nostalgic vibe that makes you feel like a kid. One of my favourite zombies maps without a doubt.\n\nMultiplayer isn’t as sweaty as newer titles, which I do like. But it’s still fast, flashy, and still holds up if you like jetpack gameplay.\n\nIf you skipped it before, now’s the time. Trust me. It’s way better than you remember.", 0.5620437860488892], ["On discount for $20, this game is definitely worth it for the campaign and zombies (somewhat) alone. I can't believe I fell for the hate. Yeah, the multiplayer is dead and does suck in general, but the campaign is definitely a Top 5 of all time and Spaceland is one of the best maps ever made for zombies. Wouldn't really recommend the other maps as they get worse after each release. DO NOT BUY THIS GAME AT FULL PRICE.", 0.5454545617103577], ["Great game, great story made with hard work and love. If you want to play a great story I recommend it but I couldn't find a single multiplayer match due to lack of players. The zombies was neat too.", 0.5255666971206665], ["First off- Disable optimized for windows games across the board under graphic settings. Itll stop the crashes.\nSecond- Grab the HD mod from nexus along with remove hud mod\nStory- Absolutely fantastic. It was well done, great mix of different aspects from ground fighting/ship to ship/spacecraft fighter vs enemy. Story was...fantastic. I sat on this and had it in my library but refused to play at the time because \"future sucks\". Man I was wrong. Absolutely fantastic single player campaign and story.", 0.5], ["The most underrated and mistreated Call of Duty. The campaign is surprisingly good and I recommend everyone to play it or revisit it (as always, on discount. Do not spend 60 euros on a 9 year old game), the zombies are really fun and the multiplayer, well it was already dead when I got the game, oops.\n\nThis game comes from an era where people were fed up of the futuristic theme, but if it came out before Black Ops 3 or Advance Warfare I'm sure history would be very different.", 0.5], ["Great futuristic space combat game, it is nice to see military near-future sci-fi (like The Expanse) as opposed to fantasy-tier stuff like Star Wars or Warhammer 40K. The zero-g combat and tech is really interesting, and the art design is excellent. The fighter combat is not my thing; it feels like that one space mission in Halo Reach. The story is a mixed bag -- there are some cool characters like Ethan and Omar but the villain is pretty stupid and cartoonishly evil without good motivation. I think Killzone did the whole \"colonists vs. Earth\" conflict in a more nuanced way, where the Helghast actually have valid reasons for hating the ISA. Also, whenever your companions die, it is in a stupid way which was easily avoided but is still in the game to force an emotional response. I can see why COD fans wouldn't like this game, but then they complained about this and got the most boring game in the franchise (WW2), so that's something. At least now you can assassinate your enemies with a farting unicorn wearing a Nicki Minaj skin in le heckin realistic boots-on-the-ground modern COD.", 0.5], ["one of the best games ever made, and also better than treyarch zombies in a few ways. (i'm not hating, i am just saying... it is true sorry.) \n\ninfinite warfare has an amazing zombies mode, with tons of things to do on each map, easter eggs that are fun to do, it has 5 cool celebrity characters that you can unlock,  it was made with a vision in mind, and with love too.\n\n  it has a couple of really good weapons thanks to the variants.(you can earn keys and salvage just by playing, no need to spend money.)  \n\n and a really good reward for beating every easter egg for the first time,  with added Replay value on top of that by doing all that again with directors cut on.\n\nthe fate and fortune cards system is better than the gobblecums 100%, it's not even close.\n\nplus all of the maps are good, yes even beast from beyond (tho it could have been more, just imagine if they were given more time.)\n\nmy only 2 small nitpicks are: i wish the characters had way more voicelines, and i wish the fov was done better cause it doesn't feel that high. (also for anyone wondering, the fps is capped/locked at 85, which is displayed as 91 or something like that.)   but that is all.\n\n\nso overall, 9.9 out of ten,  however it sucks that the mp on pc is unplayable due to a bug or something, that was never fixed.\n\ndidn't review the campaign cause i personally don't buy cod games for that alone, but still, it was nice. definitely give it a try if you want.\n\n", 0.5], ["I got this game near release on console and I've enjoyed it from the start. the monetisation on the special weapons is terrible but I honestly don't expect better on activision. the campaign is story I actually really enjoy being a sucker for space and ship battles. the multiplayer is COD, pretty much the same from black ops onwards, definitely nothing ground breaking. zombies is also good, giving a new slightly different look and feel to how it plays but still great. I wouldn't buy this for full price especially  for this being almost 10 years old, but if it goes on sale and you like zombies and want to try the campaign I would say give it a shot", 0.5], ["Wow i have to say this is absolutely one of the most underrated Call of Duty titles period. Not only is its zombies mode endless fun and a real challenge, the campaign is stunning.", 0.5], ["Good game for the zombies mode alone, worth it if you can grab it on seasonal sale for 40$ with all dlc. multiplayer is fun if you can find a lobby but there's alot of sweat and you will die A LOT. Different feel and engine from modern COD games but not as bad as people thought it was.", 0.5], ["COD : Infinite Warfare\r\nThis game is truely something awesome in the COD series , the campaign the zombies mode are both awesome , and some of the best in the series - in my personal opinon!\r\n\r\n- Campaign  is super good , the characters are well voiced acted the lip syncing is also really good most of the missions are pretty fun , sometimes a little basic , but going from planets to planets and then to earth , and also the gameplay change is hella fun/good , overall the ending as well was really done SUPER WELL. I had a blast playing through the campaign!\r\n\r\n- Zombies , yeah zombies in spaceland is the best zombies mode of any COD game TO DATE , the style the charm the secret boss fight/easter egg is also done super well , the weapons are fun the tokens are used for extra things , the sticker book is fun to make , everything in this zombies mode will suck you in for hours and hours , and i'll play zombies even more then i have already.\r\n\r\nThe Negatives - the multiplayer is pretty dead , and i encountered a couple of bugs in all modes but even then this game is super good ,\r\n- BUY ON SALE , its AWESOME!", 0.5], ["the game is good realistic and doesnt need super strong nasa pc but it doesnt get much updates and i played it for a long time this game is good very good soo buy it", 0.5], ["Game worked fine for 9 hours....then stopped. Nothing changed on my PC, but keeps saying that it's now running in safe mode. checked my settings, nothings changed. Either Steam sucks or the game does. Requested refund since i cant play the game....sad.", 0.497925341129303], ["yes but there's a issue that crashing the game a bunch if you don't turn it off to fix that go to settings > system > display > graphics > find the game application \"call of duty game\" press it and turn off optimizations for windowed games (that's what worked for me)", 0.4729729890823364], ["game crashes after any settings change \r\n", 0.5454545617103577], ["They called it Operation Black Sky Below—a shadow mission buried so deep it didn’t officially exist. No records, no medals, no rescue protocol. Just a dead-drop order handed to a fireteam of ghosts. If they failed, no one would even know to care.\n\nLieutenant Lex Navarro, callsign Specter-1, was the team lead. A former Jovian mining enforcer turned SATO spec-ops, Navarro had been forged in low-G riots and hardened through a decade of dirty war. He didn't care about medals or ranks—just finishing the job.\n\nWhen the Settlement Defense Front burned Geneva from orbit, Navarro was already in enemy territory—buried beneath the surface of an SDF-controlled asteroid near Europa, deep inside a converted mining facility that had become a weapons test site.\n\nTheir mission was surgical: infiltrate, locate a new prototype kinetic weapon, and destroy it before it could be launched.\n\nThey inserted during a solar flare blackout, using the magnetic shadows of the asteroid's rotation to slip past orbital scans. No eyes on them. No backup. Just boots, breath, and silence.\n\nInside the base, something felt wrong. Not quiet—hollow. Lights flickered. Power systems were in standby. The air was cold and thick with the scent of ozone and synthetic oil. The SDF weren’t patrolling. They didn’t need to.\n\nMotion pings started to flutter across their HUDs. Navarro raised a fist, halting the squad. Harris, his recon tech, tapped into the local spectrum. “No drones. These aren’t bots,” he whispered.\n\nThen the wall behind him opened.\n\nThey weren’t drones—they were sentries. SDF had built AI-integrated exo-suits—machine-hybrids with humanoid forms and infrared camouflage. Silent. Adaptive. Built to kill.\n\nHarris died fast. His scream never even fully formed.\n\nNavarro dropped one with a short burst to the processor core. Monroe took down another with a thermite spike. The rest of the squad set a fast retreat into the deeper levels.\n\nThe mission had changed.\n\nTime was bleeding out.\n\nThey fought through gravity shifts, server vaults, and an abandoned crew sector that had been sealed and scrubbed—too clean. Every hallway echoed with static. By the time they reached the weapon chamber, only Navarro and Monroe were still breathing.\n\nThe Helios Lance looked like something out of nightmare theory: a railgun the size of a freight train, magnetically stabilized, tied into a crude launch cradle on a tethered orbital loop. It was set to fire in 22 minutes.\n\nNavarro assessed the situation. The control AI was locked. The core was sealed. Too many failsafes.\n\n“We can’t disable it,” he muttered. “We ride it.”\n\nMonroe blinked. “You serious?”\n\n“I’ve never been more.”\n\nThey climbed onto the exterior chassis of the Lance, wired a backdoor into the manual ignition, and preprogrammed a magnetic destabilization. If they triggered it just right, the weapon would fire with no payload, burn out its core mid-flight, and tear itself apart in the vacuum.\n\nAs the countdown hit thirty seconds, SDF sentries breached the chamber. Monroe laid down suppressing fire and got hit—bad. Navarro dragged him up onto the structure, slammed the last command in, and they launched.\n\nThe Lance screamed through the void. Twenty seconds in, the coil fried. It began to tear itself apart. Monroe lost his grip and spiraled off into blackness. Navarro clamped down, silent, as the whole weapon cracked apart around him.\n\nLater, a SATO patrol drone picked up a faint beacon—barely more than a whisper, wrapped in static and ice. Navarro was floating in the wreckage, suit shredded, left hand gone, visor webbed with cracks. Still breathing.\n\nThey never asked what happened.\n\nThey never mentioned Helios Lance in any official report.\n\nBut it never fired.\n\nAnd the planet never felt its wrath.\n\nSomewhere in the shadows of space, a silent mission had saved millions. And only one man remembered.", 0.5454545617103577], ["haters gonna hate but fr just give it a try u weirdos\r\nps. zombies", 0.5487105846405029]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/292730/header.jpg?t=1646764561", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/292730/capsule_231x87.jpg?t=1646764561", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/292730/capsule_184x69.jpg?t=1646764561"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.callofduty.com/infinitewarfare"}, "developer": "Infinity Ward", "owners": "1,000,000 .. 2,000,000", "tags": ["Action", "FPS", "Multiplayer", "Zombies", "Space", "Futuristic", "Shooter", "Hero Shooter", "First-Person", "Singleplayer", "Sci-fi", "Robots", "Adventure", "Story Rich", "Atmospheric", "Quick-Time Events", "War", "Great Soundtrack", "Co-op", "Post-apocalyptic"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 199, "number_of_achievements": 88, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Valve Anti-Cheat enabled", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "Infinite Warfare delivers three unique game modes: Campaign, Multiplayer, and Zombies.", "long_description": null}