{"name": "Robocraft", "app_id": "301520", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 606, "negative_reviews": 359, "reviews": [["[h1]Ruined by Developer Decisions and Carelessness[/h1]\n\nThis was one of my favorite games back in 2014. It had everything you could ask for: balancing, a good community, active and attentive devs, weapons that complemented each other, fun gameplay, good progression, lack of \"pay2win\" and so forth. Needless to say, it was awesome.\n\nThen the January 2015 update was released.\n\nThe January 2015 update added a new gamemode where you destroy towers, levelled up, and respawn if destroyed. Initially, me and the rest of the community thought \"Cool.\" and waited to see what else was in store. Little did I know that the downfall of Robocraft had begun.\n\n(Order not completely accurate)\n\n\"Megabots\" (gigantic robots basically) were removed as soon as the update came out, if not before.\n\nCrates were introduced (partially replacing the robits system), level based CPU limits eliminated, and the tech tree removed, eliminating progression, reducing creativity, and generally made the game much worse. Despite the huge outcry and the veterans and other players who started to leave the game, the devs simply ignored the community and moved on.\n\nHelicopter blades were added, enabling people to make flying fortresses (maybe literrally). Personally I don't think much of this.\n\nThen weapons, most notably an anti-air cannon and a minigun, were added, making weapons unbalanced and the game more frustrating to play. As a pilot in Robocraft (a more \"traditional\" one who used plasma bombers), this particulary saddened and angered me.\n\nA robot shop was added, further reducing creativity.\n\nAn intro was added into the game, giving the game a more \"cheezy\" feel and making it seem as if the developers were copying other games. By this point, I personally felt that the developers were catering more toward children (12 year olds) and no longer valued older players and veterans.\n\nAll this time, veterans and other older players were leaving the game as it became increasingly apparent that the developers were not listening to the community. \n\nA new chat system was added, featuring a clan system that the community had been asking for for a long time. This was not nearly enough however, as the other changes above (as well as others) and the careless developers made the game unenjoyable for me (and potentially other older players, although I can not speak for them on this matter).\n\nI finally left Robocraft for good in mid 2015 (shortly after the new chat system was introduced) after a brief stint operating a hovercraft with SMGs.\n\nIn it's current state, Robocraft is unbalanced and unenjoyable. The developers are careless and possibly largely inactive (aside from bugfixes and tweaks). Gameplay is frustrating, gamemodes horrible. \n\nAs another reviewer (spynathan) has said: \"From Robocraft to Robocrap.\"\n\nIf, somehow, all (and I mean all) changes to the game were reverted back to sometime before the January 2015 update, say, November 2014, me and other members of the community (read their reviews to see what they have to say) who have left Robocraft may very well return.\n\nUntil then, goodbye Robocraft.", 0.8721897602081299], ["I remember when I got this game in 2014. It was one of my first steam games. I immediately got addicted to it and spent my spare time climbing up the teirs. The game reached its height when megabots where introduced. But over time the game got worse and worse. By the time crates where introduced the game was unplayable. I can't believe that you could mess up a great game this much.\n\nEDIT: I just saw that Freejam finally removed those terrible crates. I'm going to leave my review negative for now but if they keep going in the right direction I will make my review positive. Don't disappoint me Freejam!", 0.8649266958236694], ["I decided to finally review the game which I knew and loved by the name of Robocraft.\nWhich my review can be best summarized by:\n._.\n\n\nRobocraft started out as being such a interesting concept. Build a vehicle out of cubes and pit them in combat against each other in an arcade style arena. Robocraft was initially successful, but then the FreeJam lost sight of the original game. Making update after update that made the game worse.\n\n-Flying fast? Nah, speed is boring\n-Pilot seats & Triforcing? Nah, let's just build bricks\n-Teirs? Who needs teirs, let's just make matches unbalanced\n-More parts! Who cares about part balance, just create more!\n-More game modes! So many that you take forever to find a match\n-LOOT BOXES! everyone loves RNG and not get the items they want. They'll surely give us money now\n\nPros: \n-Build bots out of blocks\n-Fight other players with your custom bot\n-Different weapons & movement parts\n\nCons:\n-Devs seem to make the game worse\n-Building lacks depth\n-Poor balancing\n-Very grindy (P2W)", 0.8581530451774597], ["Now, I only have around 80 hours in this game. But I have played what it was back in its \"hayday\" and I have played what it is now. There was a point in my time of playing robocraft in which I couldn't stop playing. It was a drug, and an outlet to let my creatvity go head-to-head against other people's equally absurd ideas. What it is now, I can't really understand what went wrong. Call me melodramatic, but how does one screw up a wonderful game so [b] BADLY [/b]? I don't know.\nAll in all, this game has become what it worked so hard to go against. A game that requires very little creativity and a lot of mommy's money. \n\n\nDon't let me change your view of this game, give it a try. But know that you are playing a shell of a once mighty game.\n\n", 0.7824349999427795], ["Man, this game used to be the best. There was an awesome sense of progression and the game was unlike anything before. Then FreeJam removed all of the things that made the game good.\nNow I will list everything great that FreeJam removed during updates:\n1 Tech Tree\n2 Tiered blocks\n3 Megabots (And megabot battles)\n4 Sense of progression\n5 Expandable CPU\n6 Only allowing 1 weapon type\n7 Having all weapon tiers work simultaneously together, not seperatly\n8 Getting money instead of crates at the ends of matches\n9 (Decent) Balance in ALL battle modes\n10 The Pit\n11 True Team Deathmatch (Not this Brawl BS)\n12 The need for medics (Because auto regen)\n13 A good community\nThe list goes on and on\n\nNow here are the things FreeJam added to make the game \"better\" while they were removing everything i just listed:\n1 Paint...\n2 An obscene amount of cosmetic BS\n3 Crates...\n4 Need to rely on luck (crate drops after matches)\n5 Horrible balance between weapon types\n6 Being able to have FIVE weapon types (RIP strategy)\n7 Auto heal (Ruined medics forever)\n8 Crates...\n9 Everyone gets 2,000 CPU at the start because SCREW PROGRESSION\n10 And also Crates...\n11 Removal of the Pilot Seat\n\nI've tried to get back into Robocraft but way to much has changed. There is no point to playing this game because FreeJam gives you everything off the start. There's nothing to work towards. Maybe FreeJam will revert back. But I doubt it.\n\nThis game had so much potential to be (and was) amazing, but FreeJam wants your money, not your passion for a game that once was amazing.", 0.7808209657669067], ["sigh..... \n\n\nReally isn't much you can really do to get through to the devs. In fact they don't listen at all. I loved this game so much and put many hours into it. I did manage to play it for another ~20 hours after the \"Epic Loot\" update somehow but it got repetitive. That update in my opinion being the WORST adition you can possibly put into a game where you BUILD the robot the wa YOU want it. That update has made it literally the hardest thing to do due to it's mechanic. It could've been handled better like just a new reward you get along with earned currency. I got bored with this game real quickly because I couldn't really experiment that often or freely with new weapons and modules because I couldn't buy them. \n\noverall was good pre box era. Now really difficulit to get a foothold. \n", 0.7342612743377686], ["So many reasons why this game is terrible crap. Want to read some? probably not, this games flaws is like a series of unfortunate events, its depressing and limitless.\n\n1. Bugs\n2. Abusive Mods\n3. Inactive Devs\n4. Greedy Devs\n5. Epic loot Update\n6. Community\n7. Meta\n8. FJ Cant Get Rid of Meta\n9. All Updates Only Include Massive Weapons\n10. Shitty Balancing\n11. Crappy Economy\n12. Shitty Updates\n13. Useless Support\n14. Buggy Forums\n15. Childish Community\n16. Super Slow Progress \n17. P2W AF\n18. Slow Proccesing\n19. 40 Minute Queue Time (Sometimes)\n20. Cancerous Community & Bots\n21. Starter Bots Are OP\n22. Hypocritcal Community\n23. FJ just goes with shitty community\n24. FJ doesnt even try to improve\n25. FJ literally banned me because their mods dont know how they are supposed to do their job or theres a bug that mutes me with no warning\n26. They are EXTREMELY unprofessional for punishing players on their behalf", 0.7164936065673828], ["Old robocraft was so much better, it had an technology tree, weapons that worked and you had to have at least some skill to win, you could carry or be carryed by your team.\n\nNow all guns are terrible, you can't do anything you want unless you give money to 'em, you can't even PAINT your robot/car/air unit, I used to enjoy this game extremelly much\n\nYou had to battle alot to win upgrades, now, everything is desorganized and paid.\n\nPoor Robocraft, what have you done to yourself ?", 0.6483742594718933], ["I used to love this game. I started playing it when it was pretty new (around early 2014) and it was amazing then. I stopped playing after a while, and didnt play it for quite some time. Then one day I was looking through my library, and i saw this game, and I though \"Hmm that was pretty fun, I had a good tank, maybe Ill login and see whats new...\". That turned out to be a mistake.\n\n Aside from the building of the robots themselves, the game shows almost no similaritys to the fun and creative idea that it was in the beginning, and the only bots you see now are tiny, op balls of smgs that can somehow defeat a plasma tank that is 5 times its size. In addition, the loot crate system is just a front for the devs to make a cash grab with premium. Even if you somehow manage, as a new player, to do good in a match, and get a decent loot crate, you only get HALF of the loot from that crate unless you pay for premium access. Yes, \"see that legendary/epic weapon/part in your loot crate? HOORAY for you! But guess what, you dont get to have it unless you pay us money!\". And on top of this the recycling system, putting in parts to get \"robits\" to forge new parts, has an appalingly low return rate, which can only be increased by getting premium. And even then the return rate is low. \n\nThe devs alos saw fit to get rid of the capture the flag game mode, and replace it with a glorified version of deathmatch called Brawl. It is essentially everybody against everybody deathmatch instead of team deathmatch. Apparently they thought we needed two deathmatch gamemodes instead of just one. It has no teamwork or strategy like the capture the flag mode used to have, its just kill everyone else and get money. If i wanted that kind iof mindless crap I would go play Gta V.\n\nTo say the least I am VERY disappointed in the direction this game has taken, and the utter lack of attention the devs give to the opinions of their community.  Like a disproportionate number of other games in its genere, it has become all about the devs making money. And yes, i understand perfectly well that they need money to make and upkeep the game, but making it an unbearable grind and ignoring all advice from their players is unacceptable. 2/10, Ill be back when they start listening to us.\n\n", 0.5956785678863525], ["Garbage balance.\nGarbage economy and proggression.\nGarbage game modes.\nGarbage scoring.\nGarbage matchmaking.\n\nThe only reason to play this game is if you invested in it back when it showed promise, or if you hope against all reason that the few games that are fun will compensate the ones that arent.", 0.634994626045227], ["I can't play this game anymore, 316 hours and I'm finally done.\nEvery enemy team has 3 drones, 2 walker snipers and 1 ghost shotgun. I can't use the bots I want to use or else I get spawn camped or I can't even do damage.\nThe only way to win is getting other people to play with you and use the most over powered robots, I can't do that.\nI hope robocraft finds balance sometime, but goodbye.\n\nIf you are deciding to start playing this game, brace yourself. It's going to he a steap bumpy ride.", 0.5698708891868591], ["It's a good game, but after level 20 the team builder goes haywire and the match is pretty much decided from the start. Also it often won't let you in when you try to log in with steam.\n\nEdit: those were the days, back in 2017 while the game was in Alpha. Now the game is a mere shadow of what it once was. The game is quite poorly balanced, since some weapons are so OP that they are almost an instant win and some are so weak that one has to be stupid to use them. But more ridiculous than that is that weapons get stronger the more you play them. Which means that new or returning players have to sit through hours of losing matches to even be able to have a light chance. This is by far the worst attempt f balancing I have ever seen.\n\nThe player base is super low. The few players who still play have their weapons maxed out. Buy Trailmakers for real money instead, since the amount of fun per Euro you'll have there is way higher than here, even if this game is free.", 0.5192307829856873], ["Hello, Robocraft used to be a good game.... I give up.... rail guns are being used as tank weapons when they should be terrible at close combat.... and the new tesla bot that game out has free rain over the map and there is almost one in every game....  I recomend not playing this game until these have been fixed.  ranged weapons are fine if thats what they are good at not a all around weapons..... and teslas need to have a change where they have to deactivate there wepon or there cloak is droped.  If they make these changes then I will come back...  Try again in another year guys.  1/24/17 \n\n9/3/17 Note Update tried playing robocraft for a week.... I dont see tesla's all over the place any more so that must have been resolved... but rail guns are still a problem.... rail guns should be to shoot from a sniper position not close cobat... A FIX FOR THIS would be to make the rail guns beam tighter... expample I know most of you have been hit by a rail gun when the rail gun targeting beam is not even on your robot, this is becouse the beam has a certian thickness... make the diameter for the beam tighter.... this would turn rail guns back into what they are ment to be.  Until then still not a good game to get tell this is fixed.... Ill update again after another 6 months to a year... see you guys then....", 0.5641570687294006], ["Wow u guys rly fucked the game up... I think I ll try playing this next year :D\nIf dev smart enough,  they will start paying attention to community.", 0.6141498684883118], ["Was a really good game until the \"Unleashed\" update.\n\nActually : full of bugs, completly unbalanced, broken leagues, broken match making, long waiting time, almost 0 social, and is about to destroy the game for redo from scratch...\n\nThe worst : the staff (admins and mods) who cries against competitives bots just plays uber competitive bots, exploit match making and make lose and block their players. If you try to talk, they ban you.\n\n\"you have been suspendeed from playing robocraft\"\n\nBut... why i had been suspendeed you will ask ?\nIt's simple : My game crashed.\n\nSo, a moderator with wich i already had argues in private life made a false denonciation.\n\nSo, in robocraft, a corrupted moderator can report you for a game leave, and you get ban. YOU GET BAN CAUSE YOUR GAME ENDED !!!!\n\nWTF ?\n\nAnd, strangly, at the EXACT SAME TIME i just get the lead of my clan, wich is rival of the mod's clan.\n\nIn same times, i reported many times clans like Atlas Core and HEX wich abuse bugs and farms...\n\nWhat happenned ? Nothing, cause the glitchers players were.... MODERATORS.\n\nSome screens...\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=869106881\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=869106943\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=869106990\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=869107037\n\n\nACTUALY : this advice is still true. Robocraft's staff are incompetents and corrupted and the game becomes more and more boring PAY TO WIN.\n\nAnd steam charts are a proof, nobody want play no more :\nhttp://steamcharts.com/app/301520", 0.5639632940292358], ["i have played this game for 2-3 years and i would say the game went down and diyed because the crates give peaple so god loot and what i got was junk :( #whyruinrobocraft", 0.6079288721084595], ["It's so sad developers pull shit like this nowadays, the current playerbase of robocraft will never know how good robocraft was before the devs just said \"f it\" and added all the crap that's currently in the game, looting system, p2w etc.\n\nThis game was a solid 10/10 a couple of years ago and now it's just a stinking pile of money grabbing shit. I thought freejam was better than this.", 0.550000011920929], ["Finally uninstalled this trash heap of a game. Between the constant disconnects of players on both teams, and the horrible balance of parts and weapons in the game by incompetant developers, its no surprise this game didnt even make the top 10 in the Indie DB awards for 2016.\n\nFeels like the people making this game have no idea what they are doing or what they want this game to be. Its a complete mess.", 0.549323320388794], ["If this review came out two years earlier, I would be like \"OH MY GOD YOU NEED TO GET THIS GAME\"; until update after update of just terrible additions came out. Before the Spectrum Combat update came out, I used to spend basicly everyday playing this game because no matter which level or how good you were at the game, there was always a position of experience for you. There was so much content and diversity, but that all changed. Many others feel the same way I do. I hope the devs start listening to the community and fixing the game that they have ruined so us veterans can return and feel like an old part of our lives had just returned to us.\n\nEDIT\nI can't even bare to look at my own review anymore because of all the other veterans who talk about there own experiences and it's so nostalgic because of how easily I can relate to them", 0.5454545617103577], ["I once played this game called Robocraft. I found it through a friend of mine and quicly got addicted to it. Playing the battles with completly different robots and weapons was amazing, seeing people use planes either as bombers or as fighters was just something that inspired me to actually reach lvl 80. The spider legs update, AMAZING. So cool to crawl a wall and shoot down stuff. Spider legs with wings? AWESOME! I loved it because it was a grinding game, something that took skill either to construct or fight enemies. I really had much fun. But then, the worst update of all times came. All the time I took to get to level 80, wasted. Because they introduced crates. CS:GO, LoL, OW, those are games that you win cases to have cosmetics and stuff, but this, no. Before if I wanted to buy lets say, a new pair of laser guns, I would have to play max of 5 matches, depending on the way that you played, if you had a good score, if you helped win the game. Now when you do all of those good stuff, you only earn a higher probability crate. Probability, so you can still get sh*t loot from it. It's completly pay to progress. It's embarrasing how such a good game became a pile of complete utter sh*t.\nPlease read your reviews. The really long ones that tell you what's good and wrong in this game. If you do that you'll see your player count rising up again. Make this game great again.", 0.5451167821884155]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/301520/header.jpg?t=1737463288", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/301520/capsule_231x87.jpg?t=1737463288", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/301520/capsule_184x69.jpg?t=1737463288"}, "support": {"support_website": null, "support_email": null, "game_website": "http://robocraftgame.com"}, "developer": "Freejam", "owners": "10,000,000 .. 20,000,000", "tags": ["Free to Play", "Robots", "Building", "Multiplayer", "Action", "Shooter", "PvP", "Massively Multiplayer", "Sandbox", "Crafting", "Third-Person Shooter", "Sci-fi", "Strategy", "Simulation", "Early Access", "Indie", "Open World", "Funny", "Adventure", "RPG"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese", " Korean"], "concurrent_plays": 4, "number_of_achievements": 43, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Steam Trading Cards", "In-App Purchases", "Family Sharing"], "genres": ["Action", "Indie", "Massively Multiplayer", "RPG", "Simulation", "Free To Play"], "short_description": "Build insane, fully customisable robot battle vehicles that drive, hover, walk and fly in the free-to-play action game Robocraft. Add weapons from the future and jump in the driving seat as you take your creation into battle against other players online!", "long_description": null}