{"name": "Mortal Kombat X", "app_id": 307780, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£15.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 8632, "negative_reviews": 2146, "reviews": [["For some people this is the last great Mortal Kombat game.\n\nThis franchise has never been something that I love (I am just not a fan of its mechanics.)...but damn it is a great game on its own merit.\n\nSolid single player content.", 0.607236385345459], ["Rekommend for anyone who like good old fighting games. The story was interesting with lots of kool characters, although it is a little over the top to keep fighting with the same character in the story mode. It is a continuation from the previous games. There are many new characters added to give us a wider range of options. Lots of mini games such as test your might (a thumb killer) . It can be a bit of a slugfest to earn enough koins to unlock all the skins, fatality and brutality. DLCs recommend for anyone who can't be bothered. The price is really low for such a high quality game. Rekommend when on sales.\n\nP.s. Warning: it takes up a lot of space, so may not be suitable for anyone with limited space.", 0.5652992129325867], ["played this mostly on console, i have dumped hours upon hours on this game and it still is very good to this day\r\n\r\nget the game on sale though (with dlc if possible)", 0.5387097001075745], ["This game is a steal if you can wait and get it on the 80% off sales it occasionally has. Some of the best Kombat in the series and love the variety with choosing from the styles you want for each fighter. Feels a lot quicker and more responsive than the newer titles with graphics that are surprisingly good for being a decade old.", 0.5346506237983704], ["still the best MK game to date for its fast gameplay and fun combos. would reccomend picking up to play with friends", 0.5327103137969971], ["Super-addictive combat is a hallmark of this franchise. The graphics and combat scenarios are excellent, especially towards the end of the story mode.\nThe combat is very well done, which motivates you to keep playing and exploring this wonderful game.\n", 0.523809552192688], ["Not working online. WB Support ignoring request for help.", 0.5185185670852661], ["MKX is the better MK11\r\n\r\nThe Kombat is fluid and meshes well with the kombo system\r\n\r\nAll of the characters feel fantastic to play, even some of the ones I don't like, like Kotal Khan or Xenomorph.\r\n\r\nThe single player options are weaker though, even compared to a game like MK1", 0.5098039507865906], ["Took me a long time to realize that i should use D-PAD instead of joystick for combos for mortal combat games", 0.5], ["I like MK X better than MK 11 simply because the changed the look of my favorite characters and some of the voice actresses weren't brought back for 11. Still a fun game even though it's old.", 0.5], ["PEAK MK WITH PEAK FIGHTING!\r\n\r\n 1) MKX has far better gameplay than MK1 and even MK11 in my opinion.I really missed the fast paced kombat style. RATING (100/10)\r\n2) The story was ok but main problem is that the entire story is kinda short :(   RATING (8.7/10)\r\n3) The characters and their drip in the entire roster is perfect including dlc characters. RATING (10/10)\r\n4) If you want to play this game online with different players around the world then DON'T buy this but still I know that any of u guys watching this review knows that this game is DEAD :( \r\n\r\nBONUS TIP : If you want to seriously enjoy this game then you should learn how to do kombos instead of button mashing, otherwise you will know that u won the fight but you can't get the satisfaction of beating your opponent's butt by your own commands.\r\n\r\nGIVING THIS GAME A RATING OF SOLID 9.6/10      \r\nBTW JASON IS MY FAV ;)", 0.5], ["not my favorite entry in the series but a good game nonetheless.", 0.5], ["Trying out MK1 and not liking it much made me want to revisit this game. Safe to say this is still the best Mortal Kombat to date. Incredible game that just makes me happier whenever I play.", 0.5], ["The game won't even launch & MK11's online gaming crashes almost every match. Will never purchase another MK game until they fix the ones I've already spent money on.", 0.5], ["Personally, THE best MK game since after MK9, doesn't even compare to newer ones both terms of gameplay and character design. Flawless.", 0.5], ["Game is very good, the gameplay is good, online mode is where its at, the story is good, characters are good especially the guest characters they are so cool, get this game if you can because its worth it.\r\n", 0.5], ["after the game shutting down almost all my browser based apps and giving me 5 BSODs at once i finally get to play it , 10/10 worth smashing my pc over", 0.5], ["good game, simple to learn kombat and lovely krossovers", 0.5], ["Got this game for 7 dollars canadian, knowing it'd be good. Did not dissapoint. I have a low budget laptop, so though a bit laggy, this game had great graphics options.", 0.5], ["Top 5 best fighting games of all time, very fast phased and hard to master, yet insanely fun and rewarding. Moreover, each character has 3 variations, each one completly unique from one another so you´ll have A LOT of characters to try and mess around with. Peak.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/307780/header.jpg?t=1745535169", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/307780/capsule_231x87.jpg?t=1745535169", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/307780/capsule_184x69.jpg?t=1745535169"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.mortalkombat.com"}, "developer": "NetherRealm Studios, QLOC", "owners": "2,000,000 .. 5,000,000", "tags": ["Fighting", "Gore", "Action", "Multiplayer", "Violent", "Blood", "Mature", "Local Multiplayer", "2D Fighter", "Competitive", "Atmospheric", "Singleplayer", "Arcade", "Great Soundtrack", "Online Co-Op", "2.5D", "Fantasy", "Third Person", "Horror", "Female Protagonist"], "languages": ["English", " French", " Italian", " Spanish - Spain", " Polish", " Portuguese - Brazil", " Russian", " German"], "concurrent_plays": 440, "number_of_achievements": 73, "categories": ["Single-player", "Multi-player", "PvP", "Shared/Split Screen PvP", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Steam Leaderboards", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Action"], "short_description": "Experience the Next Generation of the #1 Fighting Franchise. Mortal Kombat X combines unparalleled, cinematic presentation with all new gameplay.", "long_description": null}