{"name": "Call of Duty®: Black Ops III", "app_id": 311210, "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£44.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 95283, "negative_reviews": 10775, "reviews": [["I'll say this, the only reason why I'm giving this a negative review is because of what happened to this game and it's lack of security, If you're a singleplayer guy and want to experience the workshop content, play this game offline. Want to play with others? use t7patch. Activision doesn't want to support this game? Want us to play their ass Warzone and all? Vote with your time and money, they took down the BOIII client and they choose to not support this game, and now the servers are sold to China, so, this game is super unsafe to play stock. I hate Activision for having official tools but they choose to let this game rot just for Warzone.", 0.8397223949432373], ["The best Call of Duty Zombies of all time. A near flawless map roster, great mechanics, and the inclusion of the Steam Workshop gives the game endless replay ability. This game is worth the full price just for the Zombies alone. Revelations is the only \"weak\" map I would say but given the sheer amount of wonder weapons and things to do on that map, once you start a game and get into it, it can be very fun too. This truly was the peak of Zombies in my opinion.\n\nThe Campaign, not so much.", 0.8056203722953796], ["Zombies:\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond (if u play it with mods)\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Bugs? (I dont even know what is that mean)\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n☐ 11", 0.7662691473960876], ["Id rate this game when in term of fun 10/10. But for story mode, probably 6/10 because it doesnt have any connection/relation with previous black ops series but its still fun regardless. Zombies, 10/10 as well but they are separate from main game so you should get the DLC as its packed/bundled with previous black ops zombies series.\r\n\r\nThe reason why i called this game \"fun\" because you are free to mods everything inside in this game. You can play, modify, create and customize the way you want to be. Thanks for the workshop feature but keep in mind that achievements / xp will be disabled when turning on mods. Overall, you should get this game even if you were late to party. By the time this review was made in 2025, the game is still hella fun and you can customize everything you want to be inside of Black Ops 3.", 0.7035399675369263], ["This is by far the best COD for zombies. Especially if you play on PC, beacuse of mod tools. The fact that there's thousands of custom zombies maps and mods for this game, make it the best by default. There's so many cutsom maps that are just out of this world. I'd say some are even Treyarch-level maps.", 0.6000000238418579], ["This is my favorite game & my favorite CoD of all time. I have played competitively on console for over 5k hours and if I could play another 5000 — I would in a heartbeat. Late night GBs & wagers with my friends is a 10/10 experience that I often look back on.\n\nThe only downside was the ddos’ing issue when playing competitive, but I’d reset my router 1000 times before playing the new COD games we have today.\n\nLong live the M8A7 with Red Dot, Long Barrel & Stock o7", 0.5928155779838562], ["This game is the best of all the COD tittles.\n\n1. Mod support with an active community keeping it alive\n2. Playable offline (With certain mods you can play mp with bots too)\n3. Split-screen\n\nHonestly worth buying.", 0.5648755431175232], ["5 star - Graphics and gameplay. \n4 star - Story campaign - It was ok and bit of drag after 50%. \n2 star - The selection of guns was super clunky and restricted. None of the guns felt satisfactory. Hardly used its Core upgrade features. Mostly the core feature that shows enemies on pressing 3 was very useful. The weapon load out, gun design features appeared to be a system to make players grind for basic upgrades. The secondary weapon was never used.", 0.5454545617103577], ["Still one of the most consistent and enjoyable zombie experiences. With a plethora of official maps, there is quite a bit of content to sink your teeth into without even taking into account all the custom/modded maps and content the community has been building for years. All around one of the most complete packages for a zombies experience today (since that's what most people would be buying this title for years after release).", 0.5406360626220703], ["Bought this just for the zombie mods. There are hundreds of them to try with winabble endings. Its my staple afterwork funtime now.\r\nBe prepared to use a LOT of HD space tho.", 0.523809552192688], ["This game is awesome, but is nothing like its counterpart on console so many aspects have been altered and changed, for example on pc version certain weapons do less or more damage, there are also surprisingly more bugs on pc than console which is really disappointing due to pc version supposedly being \"better\" I have over 1000+ hours on console so you can imagine how annoying it is to upgrade for a \"better\" experience and have it be way worse than the older version, regardless i still had a fun time playing on modded maps probably its only redeeming quality, i do recommend this game but with caution, this should not be purchased if you have only played on console it is not the same game. 7/10", 0.523809552192688], ["Hands down the best COD zombies experience. Modded maps are absolutely amazing and not to mention that the maps released with the game + DLCs are incredible and the story line + easter eggs is so goooood.", 0.523809552192688], ["I mainly got this game for the zombies mode and trust me it did not disappoint.  The maps, wonder weapons, and the gobble gun system were amazing.  But sadly this gets dragged down by the sad state the game is rn with hackers running rampant, often booting you out of matches to even trying to ddos you for simply playing the funny zombies mode.\nGoated game that was left to rot sadly, at least I got to experience a bit of it", 0.52173912525177], ["the custom zombies is the best thing about this game on pc so good wish multiplayer worked but zombies is so fun", 0.5079365372657776], ["The servers are down. Multiplayer is unplayable. No reason to get this other than Zombies", 0.5051124691963196], ["Gotta install a patch just so you don't get hacked while playing, and zombies is a convoluted mess. overwhelming the zombies with tons of abilities, weapons, and random shit. first time playing, loaded into a map, had no clue what was going on, everyone was doing stuff without me, and i just felt out of place. don't plan on playing ever again", 0.5011135935783386], ["The gameplay is great. Zombies and Multiplayer against the bots are great for not only testing your survival skills, but also being adaptable to different environments", 0.5], ["Zombies on this game is so much fun debatably peak zombies and the fact the pc version has a workshop with almost endless amounts of custom maps is crazy. Being a zombies fan since bo1 this game was worth every penny. Downfall is trying to play multiplayer is risky because activison doesn’t care  about there old ips but there’s workarounds.", 0.5], ["I’m a matcha nigga now. I like this shit, it’s cooler, it’s smoother, it’s matcha nigga! You coffee niggas is too fucking crazy.", 0.5], ["this is my favoite game and my name is big jojo and i love tthis game its so fun big jojo was here uwu", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/311210/header.jpg?t=1646763462", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/311210/capsule_231x87.jpg?t=1646763462", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/311210/capsule_184x69.jpg?t=1646763462"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.callofduty.com/blackops3"}, "developer": "Treyarch, Aspyr (Mac)", "owners": "5,000,000 .. 10,000,000", "tags": ["Multiplayer", "Zombies", "FPS", "Shooter", "Action", "First-Person", "Singleplayer", "Co-op", "Futuristic", "Illuminati", "Hero Shooter", "Robots", "Sci-fi", "Gore", "Great Soundtrack", "Story Rich", "Atmospheric", "Parkour", "Quick-Time Events", "Simulation"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Simplified Chinese", " Traditional Chinese", " Japanese", " Polish", " Portuguese - Brazil", " Russian"], "concurrent_plays": 2859, "number_of_achievements": 98, "categories": ["Single-player", "Multi-player", "Co-op", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Workshop", "Valve Anti-Cheat enabled", "Steam Leaderboards", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "Call of Duty®: Black Ops III Zombies Chronicles Edition includes the full base game plus the Zombies Chronicles content expansion.", "long_description": null}