{"name": "Geometry Dash", "app_id": "322170", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£4.29", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 167454, "negative_reviews": 11349, "reviews": [["ive played for two years, made over 50+ levels. but still i dont have a rate, and i died at 69 percent on bloodbath, very fun and good game indeed.", 0.8004288673400879], ["---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☑ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10\n☐ 11\n☐ 12\n☐ 1525\n☐ 73848237402730\n☑ 99999999999999999999999999999999999999999999999999999999999999999", 0.6889707446098328], ["Play game\r\nPlay tidal wave\r\nmad i cant beat tidal wave\r\nplay ultra paracosm\r\nBeat ultra paracosm\r\ngo back to tidal wave\r\nmad i cant beat tidal wave\r\n10/10", 0.5833333134651184], ["Without a doubt a 10/10 Game. \n\nGeometry Dash is one of those rare games that hooks you instantly and keeps you coming back for \"just one more try.\" It combines fast-paced platforming with an energetic soundtrack to create a highly addictive, rewarding experience.\n\nAt its core, the gameplay is simple: tap to jump and avoid obstacles. But what makes Geometry Dash shine is how it turns that simplicity into something thrilling. Every level is synced to music, so your movements feel like they’re part of the beat. The better you get, the more it feels like you’re playing the music, not just reacting to it. \n\nThe visuals are bright, clean, and stylish, and each level has its own vibe.\n\nIf you enjoy rhythm games, satisfying challenge, or creative level design, Geometry Dash is a must-play. It’s fun, fast, and full of energy — a modern classic that truly earns its fanbase.\n\n\n", 0.5833333134651184], ["Geometry dash is a great,fun, and long lasting game. i have been on here for 125 hours and still not board because there is so many different levels to explore and beat. And there is making your own level where you can express your creativity and make into a level. And that's not all as there's so many different aspects to the game. You could play for weeks straight and still not have tried everything. And the best thing is there is always room to improve. You could go from not being able to make a easy jump to beating some of the hardest levels. This is why geometry dash is one of my favorite games", 0.5796178579330444], ["I love this game this game so fun! And you can make your own levels and play other people levels.", 0.6094062924385071], ["BEST RAGE GAME EVER CREATED. Stereo Madness is easy, Back On Track too, Polargeist is easy. Bloodbath too.", 0.523809552192688], ["pretty fun game but the editor is kinda hard to use if you have never used it before but besides that 8/10", 0.5041322708129883], ["This game is really fun and helps your reaction time. ........ it also has chicken jockey", 0.5], ["too fun(why is this worth 5 dollars it is probably worth 20 times more) it forms habits tho", 0.5], ["game good. community solid, updates sometimes late but never dissapoint.", 0.5], ["Trust me, it only takes a couple hours to get better and start beating levels, personally I've nearly beat dry out in only three hours so if you don't rage quit then you'll get good. And this game is very fun so I think it's definately worth the 4 pounds", 0.5], ["this game is freaking butt... butt hehe see what I did there butt? okay anyways, I'll play it again when I feel like it. which is probably never. okay. thank u.", 0.5], ["Even if I don't play it as much as I did a few months ago, Geometry Dash is a great game for the cost. You get a level editor, millions of community-made levels, and basically endless content to play with, all for only 5 dollars! The player-made levels are what really drives this game forwards, and for the cost YOU SHOULD GET IT!", 0.5], ["very good and very nice and very fun and not boring", 0.5], ["Veyr fun and enjoyable gameplay to last forever", 0.5], ["game is sooo bad, couldnt even beat stereo madness after 351 smh", 0.5], ["Best game ever. Can be very easy and very hard. There are so many levels that you cant run out.", 0.5], ["I LOVE this game. It's only $5, it's got a whole bunch of content, and you can build your own levels. If you get the Geode hack by Googling up \"geode\", going to the official Geode website (it should be the first page) and downloading the EXE file, then you can install hacks for the game such as speedhacks (which slows your game down so you can process each click) and noclip (which basically means you can't crash into anything). But I have been playing this game for almost a year and I really like it (again). I would recommend this game. I really like the fact you can build your own levels (if you get the game check out my level Death Moon Rebirth 2 on my account, BloomyMania). The only thing I don't like about the game is that there are incredibly long download times for the songs, but thanks to Speed Hack, that's taken care of.", 0.5], ["This game is amazing! There's so much to do and explore! I really recommend this gam!", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/322170/header.jpg?t=1703006148", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/322170/capsule_231x87.jpg?t=1703006148", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/322170/capsule_184x69.jpg?t=1703006148"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "RobTop Games", "owners": "5,000,000 .. 10,000,000", "tags": ["Difficult", "Music", "Level Editor", "Great Soundtrack", "Precision Platformer", "2D", "Rhythm", "Singleplayer", "Colorful", "Platformer", "Character Customization", "Indie", "Arcade", "Side Scroller", "Family Friendly", "Action", "Funny", "Casual", "Strategy", "Adventure"], "languages": ["English"], "concurrent_plays": 31894, "number_of_achievements": 120, "categories": ["Single-player", "Steam Achievements", "Steam Trading Cards", "Partial Controller Support", "Includes level editor", "Remote Play on Phone", "Remote Play on Tablet", "Family Sharing"], "genres": ["Action", "Indie"], "short_description": "Jump and fly your way through danger in this rhythm-based action platformer!", "long_description": null}