{"name": "Don't Starve Together", "app_id": "322330", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£10.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 73861, "negative_reviews": 3298, "reviews": [["The goal of Don't Starve Together is to find and fight all ~ 26 boss monsters, a lot of which can be more or less hidden.\n\nTwo of these bosses are considered \"final bosses\" in the sense that killing them is the big accomplishment of two separate journeys with many different steps, one taking you deep in horribly dangerous underground dungeons and one taking you all around the sea.\nAfter each of these 2 bosses, new content is added in the form of new \"post game\" world modifications that each gives new bosses, new mechanics, new weapons, armor and technologies to use.\n\nI wanted to start by describing that because DST looks deceptively more simple than it truly is when you first take a look a it, when in truth it actually is quite complex, rich and intricate!\n\n\n\nIn this game, surviving is tough and difficult and requires you to understand a lot of different specific steps, and understand how many resources are tied together.\nAt first, it feels like learning to stay alive during each of the 4 seasons is the game, and it won't necessarily make you feel like it's super deep because it is actually only the first step. It's supposed to be simple and slow because surviving is just step 1 out of 15. Sure, you can survive without too much trouble in a kind of baren base with not so much stuff at your disposal. But that's not the goal ; it may work, but that crappy base will give you none of the tools you need to accomplish anything!\nBecause if surviving is step 1 and meant to be simple, learning how to thrive is where the complexity starts.\n\nThere are lots of different resources you can take from the world and bring back home, creatures who'se homes you can move, beneficial structures you can acquire, all kinds of things that are meant to saturate you in food, tools, weapons and armors so that you can get out there and explore the world, fight those bosses, make those journeys\n\nBut the game never holds your hand through any of it at all. Learning can be really unclear and counter-intuitive (who would think that butterflies are the most basic and most essential source of food early game? No one, at first!) and every step of the way can make you think \"is that it?\" just because you will fail to see the link between things, or how you are meant to abuse the heck out of them, or how they are just stepping stones towards something bigger.\nIt's a game that you just won't be able to enjoy if you can't challenge yourself, throw yourself out there, be active, be looking to learn and practice survival techniques and get busy trying to do things on a grander scale, or even just set out specific goals for yourself.\nKnowledge is difficult to acquire and everything is very challenging, so there may be a whole of \"now what?\" moments until you understand what the next steps can be. And if you don't know, you'll likely feel stuck and lost. And you'll become passive, and you'll become bored because you're nowhere near having completed all there is to complete, but you may not understand how and how to learn.\n\n\n\nAll in all, I recommend this game with all of my heart with the knowledge that it really may not be for anybody, especially if you tend to be too passive or can't bother with putting too much effort into stuff. It's my own favorite survival game out there specifically because it gives survival so much purpose and so many steps, because of how much effort you can put into learning and how rewarding it can be.\nThere's a lot of ways to achieve the same things. Tons of different knowledge, a bunch of different mechanics that you will likely gloss over for a couple hundred hours until you start using them and start realizing \"why have I never bothered doing this awesome thing before\" (like taming and riding big cows to become the ultimate war machine) \nThere's fun in joining random worlds and seeing how you can contribute, fun in starting over and doing things better and quicker or in different order, fun in practicing the same skills because they're tough and it pays to practice, fun in seeing how everyone's lack of knowledge can create so many shenanigans due to lack of preparation, lack of resources, lack of having made enough structures in time, and fun in modding the game and tweaking the little things along the way.\n\nAnd it's *awesome*.", 0.8256686329841614], ["This game has always been a bit of a struggle for me. Over the years, I've started many games of Don't Starve Together with friends, and during these playthroughs there's been many things I enjoyed, and I can see reasons why people enjoy this game, but every single one of these games eventually ended in disappointment, and I just haven't been able to figure out what it is that allows people to enjoy this game enough to play it for hours on end.\n\nThis game provides a familiar survival experience, as you start the game in the middle of a procedurally generated world and must immediately start collecting resources and crafting gear. However, this game is much more punishing than most survival games and you're immediately racing against the clock to make sure you collect things so that you can feed yourself and have enough light to survive the night. Making it past this first night is only the beginning of your troubles though, as you'll face many more challenges, such as managing your sanity, finding renewable sources of food, and surviving the challenges of later seasons, such as the cold of winter or the heat of summer.\n\nThe largest problem I encountered while playing this game is that the game doesn't really explain anything. You're thrown into the game with a massive (and somewhat hard to understand) crafting menu and very unintuitive inventory system, and you're expected to figure out what things you need to collect and craft with no prompts from the game. This game is also pretty strange, with many different enemies to fight and items to collect, which makes the game very fun, as it makes discovering new things very exciting, but it also makes the game fairly frustrating, as it's hard to know what you need to do to survive, and exploring or experimenting with things can be pretty punishing, as there's many things that can very rapidly kill you.\n\nThis wouldn't necessarily be a problem if it wasn't for the way death works in this game. There are some difficulty options that can be configured to make things easier, but by default, you become a ghost when you die, can only respawn with certain items or objects, and the world will reset if everyone dies and no one respawns within a certain time limit. This means that one unfortunate encounter with a poorly understood enemy can force you to start from scratch, and constant restarts seems to be the intended way to play this game, which I found extremely tedious. Even on easier difficulties, where respawning is much more forgiving and is always available, you can still end up in a state where you're stuck dying at the respawn point over and over because you don't have the necessary items to survive and can't collect them before you perish.\n\nIt's worth mentioning that the game is still getting frequent updates, and I think some of the more recent updates have made some progress on making this feel better. The upgrade trees they've been adding for each character are cool, and the compendium they added which has every item and enemy in the game in it makes learning about various things in the game substantially easier. So far this hasn't been able to keep our games from feeling extremely difficult to learn, punishing, and unfair, but hopefully they'll continue to work on making the game easier for beginners and I can one day change this review to a positive one, because I do really want to like this game.\n\nThe art style of this game is extremely good, and is very iconic. The game ran very well, and I don't recall running into any major bugs.\n\n[b]TL;DR[/b] This survival game has a fantastic art style, runs well, has a unique world which is fun to explore and experiment in, and is still getting updates after many years. However, the game is extremely hard to learn and is very punishing, which makes it often feel very frustrating and unfair. As such, I wouldn't recommend it, unless you're really into survival games, are willing to invest lots of time to learn the game, and are willing to frequently look things up online.", 0.6451696157455444], ["The iconic probably one of the hardest survival game, now together! What can be better than starving to death, getting ganged by a pack of wolves for no reason or just watching a kind Deerclops rampaging in your camp. Now you can do it with friends! :D", 0.5652173757553101], ["Certainly does not deserve its rating. It's okay at best, I'd assume it's high rating is due to its charm rather than it's mechanical functionality. Don't be fooled by its reviews it'd be equivalent to an 80% rating at best, its either a hit or a miss no in-between.", 0.523809552192688], ["Feels more like doing chores than playing a game. Definitely the kind of game you're going to have to wiki surf to get a solid grasp of since nothing is really explained to you. \n\nI exclusively played with some more experienced friends on endless mode, so perma-death wasn't a thing. Even so, many deaths felt like they were out of my control and were super demotivating. Combat feels unintuitive and clunky, especially when you're dealing with more than one enemy and you just have to kite them around while you slowly rack up hits. I definitely feel like I would have returned the game had I only played by myself without the guidance of friends.\n\nWhen you aren't in combat, it's just a constant slog of collecting resources to survive another night just to do it all over again in the morning. There wasn't ever any real payoff or sense of accomplishment, just boredom mixed with occasional frustration. Without any real goals aside from surviving, the game feels empty. I know it ISN'T empty, but damn, I just don't care enough to sit through hours and hours of gathering resources to get to the other things it potentially has to offer.\n\nGameplay aside, it's got a nice art style, the 2.5D layout of the game is unique and easy to navigate.\n\nIf you enjoy punishing gameplay, learning through trial and error, setting your own goals, and have no qualms with learning game mechanics primarily through outside sources, this is the game for you. Just not my cup of tea.", 0.507025420665741], ["This game is actually so boring bro ima be so honest bro. my friend simko recommended this game to me and i trusted his judgement, boy was i wrong. This game has brought me no enjoyment at all literal snooze fest. DO NOT get this game.", 0.5052631497383118], ["Super fun to play wether alone or with freinds. Plenty of things to do and learn as the game is pretty challenging for a beginner but there is plenty of content out there to learn from. Definetly recommend", 0.5], ["Not sure how to win this game without dying\n\nYou either spend hundrets of hour to master the game or just look on youtube how to do it.\n\nI don't like such playstlyes because I get frustrated.\n\nNot the game fault I guess", 0.5], ["this game would be fun BUT I always die before fighting ANY bosses so it trash. BUT AGAIN THERE IS A GAMBLING MACHINE SO ITS THE BEST GAME OF ALL TIME.", 0.5], ["lots of fun with friends but gets very confusing with progression sometimes", 0.5], ["Good game and updates are consistent,not that difficult after you get the hang of it.\r\nPro tip: Don't get mad at your friends that only started playing recently and keep dying to tallbirds.", 0.5], ["This is a great game. It's not for everyone, but it might still be for you. If you can be patient, you'll realize how good the game is. It's actually really fun once you learn. Sometimes you'll wish you were a noob again once you've gotten good enough, but it's still very fun. Wortox best character", 0.5], ["24 hours running from a terrorbeak because 0 sanity, awful game experience. \r\nnow i have to run from a terrorbeak in real life.", 0.5], ["It's really challenging, but really fun with friends \n", 0.5], ["Very fun with friends, also you are able to play \"Don't Starve Together\" alone lmao", 0.5], ["this game is really fine if you have friends to play with, but also kind of fun alone since there is alot of mods to try out.", 0.5], ["I used to hate this game but the  skill trees and mods make it more fun.", 0.5], ["After 3 hours of playing, game updated the binary (Intel Mac) and game now crashes on startup (OSX can't even run the binary anymore, reporting that it is corrupted).\r\nSteam File Integrity checker reports 100% correct.\r\nI tried reinstalling it twice, but same issue repeats.", 0.5], ["The game is good, but kinda hard, so it pisses me off sometimes. I've never made it through the winter...", 0.5], ["Nice athmosphere, interesting characters. High replayablility!", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/322330/c74982e70b76b5bec159242263cb394e4190f93f/header_alt_assets_48.jpg?t=1745529883", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/322330/c37f2d69487eb1bf5db17f8f4a7948485489aba6/capsule_231x87_alt_assets_48.jpg?t=1745529883", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/322330/c37f2d69487eb1bf5db17f8f4a7948485489aba6/capsule_184x69_alt_assets_48.jpg?t=1745529883"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.dontstarvegame.com"}, "developer": "Klei Entertainment", "owners": "20,000,000 .. 50,000,000", "tags": ["Survival", "Open World Survival Craft", "Multiplayer", "Co-op", "Open World", "Adventure", "Crafting", "Online Co-Op", "Sandbox", "Difficult", "Indie", "2D", "Atmospheric", "Funny", "Survival Horror", "Strategy", "Horror", "Singleplayer", "Action", "Rogue-like"], "languages": ["English", " Simplified Chinese", " French", " Italian", " German", " Japanese", " Korean", " Polish", " Portuguese - Portugal", " Russian", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 57022, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "LAN PvP", "Co-op", "Online Co-op", "LAN Co-op", "Full controller support", "Steam Trading Cards", "Steam Workshop", "In-App Purchases", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG", "Simulation", "Strategy"], "short_description": "Fight, Farm, Build and Explore Together in the standalone multiplayer expansion to the uncompromising wilderness survival game, Don't Starve.", "long_description": null}