{"name": "Grand Theft Auto V Enhanced", "app_id": 3240220, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "£29.99", "final_price": "£14.99", "discount_percent": 50, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 9414, "negative_reviews": 6275, "reviews": [["Game still has 5 year old game breaking glitches and can just negate hour(s) of prep work in an instant. The only addition this game has over legacy is RTX which adds spectacular reflections at the cost of everything else looking fuzzy and awful. Recent online grind is absolutely unreasonably insane now, too.\n\nEdit 03/28/25:\nSince TinyGhost reminded me, the update also added an awful anti-cheat that makes the game impossible to play online if you're using a Linux-based OS. That means you can no longer play the game online on the Steam Deck. Thanks Rockstar!", 0.8853479623794556], ["\r\n[h2]Rockstar’s Final Act: A Triumph of Blunders[/h2]\r\n\r\nThe multiplayer was once the crown jewel of online gaming—before Rockstar sullied it with their obsession over pay-to-win schemes, reducing the experience to a shallow money-grab. For years, cheaters roamed unchecked, as if Rockstar couldn’t be bothered to lift a finger to address the chaos.\r\n\r\nNow, as the game stumbles into irrelevance, they’ve finally added anti-cheat. But not as a saving grace—oh no. Instead, this belated patch breaks Linux compatibility, alienating a loyal faction of players who stood by them despite the game’s spiralling quality.\r\n\r\nAnd here’s the pièce de résistance: Why now? This late-stage attempt reeks not of redemption, but of sheer indifference or, perhaps worse, deliberate sabotage. It’s the kind of decision that could only be dreamt up by a committee of apple polishers desperate to appear productive while ensuring their efforts accomplish nothing meaningful.\r\n\r\nIf Rockstar set out to exemplify mismanagement disguised as innovation, they’ve succeeded with flying colours. Bravo to the maestros of misstep for orchestrating such a symphony of disappointment.", 0.8736757040023804], ["Big F you rockstar... have to be online for single player, takes forever to load... I miss the ps2 era just plug and play this is some ubisoft BS...", 0.8576650619506836], ["Enhanced version runs great, game looks stunning with the added ray tracing. Been playing this game every once in a blue moon since day 1 (2013) very nostalgic revisiting this game in 2025 :)", 0.6938665509223938], ["What can I say? it's GTA 5\n\nHowever it is not without its problems. Why for the love of all that it is holy that in 2025 this game STILL does not have basic accessibility features. A HUD scale? the ability to change map icon colours? Basic things that have been added to far less immersive games yet this one still does not have.\n\nI have played this almost exclusively on my Lenovo Legion Go, and believe me, the UI is too small even on its 9 inch screen - I hate to think what other handhelds experience.", 0.6495298743247986], ["Exactly the same as the Legacy Version, runs 5% better and the graphics are the same.\nThey removed Text chat, you have to be online for story mode now and they added a subscription service now.\nAt last they also added an awful anticheat with does nothing exept to stop linux or steam deck users from playing the game, since it doesnt work for Linux.\n\nAwesome update, Thanks Rockstar", 0.6283180117607117], ["Playing Grand Theft Auto V for over eight years has never felt dull, especially with the help of mods that breathe new life into the game, expanding and enhancing the experience far beyond its original scope. The singleplayer world becomes more immersive and replayable, offering endless fun through creativity and community driven content. On the flip side, GTA Online has unfortunately become a playground for cheaters, often making the experience frustrating and unbalanced. For a more enjoyable and stable multiplayer experience, I highly recommend exploring FiveM roleplay communities a much more controlled, player-friendly environment outside of Rockstar’s servers.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2760058157\nhttps://www.youtube.com/watch?v=QycYnXI_qcI\n\n🔘 - 🌇 𝗚𝗿𝗮𝗽𝗵𝗶𝗰𝘀\n✅ Realism\n☐ Beautiful\n☐ Decent\n☐ Could be better\n☐ 8-bit Gaming\n\n🔘 - 📜 𝗦𝘁𝗼𝗿𝘆/𝗖𝗮𝗺𝗽𝗮𝗶𝗴𝗻\n☐ Lore to its story\n✅ Compelling story\n☐ Decent story\n☐ What was I doing again??\n☐ No Story here\n\n🔘 - 💢 𝗗𝗶𝗳𝗳𝗶𝗰𝘂𝗹𝘁𝘆\n☐ Effortless\n☐ Easy\n✅ Light\n☐ Moderate\n☐ Hard\n☐ Crushing\n\n🔘 - 🕐 𝗚𝗮𝗺𝗲𝗽𝗹𝗮𝘆 𝗧𝗶𝗺𝗲\n☐ Quick\n☐ Short\n☐ Average\n☐ Long\n✅ Time flies when you're having fun!\n\n🔘 - 🦾 𝗚𝗮𝗺𝗲𝗽𝗹𝗮𝘆 upgrade system\n✅ No Grind here\n☐ Upgrades go by Mission/Chapter\n☐ Upgrade system is fun for the gameplay\n☐ Much Grind needed to thrive\n☐ Might as well live in this game\n\n🔘 - 🌐 𝗢𝗻𝗹𝗶𝗻𝗲\n☐Competitive Ranks\n\n🔘 - 🕹️ 𝗣𝗖 𝗥𝗲𝗾𝘂𝗶𝗿𝗲𝗺𝗲𝗻𝘁𝘀\n☐ Potato PC worthy\n✅ basic requirements\n☐decently Optimized\n☐ Super PC\n☐ Have fun running it\n\n🔘 - 👾 𝗕𝘂𝗴𝘀\n✅ You don't see that every day\n☐ minimal bugs nothing to worry about\n☐ noticeable bugs and glitches\n☐ Gets in the way of game-play\n☐ A Potluck of bugs and glitches", 0.6095103025436401], ["I don't care about multiplayer, but the game now requires the installation of an invasive rootkit in order to launch properly. No game should require kernel-level access. I hope Microsoft ends up prohibiting it, at least it would prevent this kind of behaviour from studios...", 0.5652173757553101], ["\"Enhanced\" is a fucking joke. The same problems that plagued the game 10 years ago go unchanged. The community never got better, it's still as cancerous as ever. Not only that, but even shittier updates (aka \"DLC\" we used to call it), and does Rockstar give a fuck? Hell no, they don't. I don't disrecommend playing, since GTA 5's story is still good to this day, but GTA Online is a cesspool, and is a shell of its former self from pre next-gen (PS4/XBone). Honestly? The original 5 heists, the \"Ill-Gotten Gains Part 1 & 2\" was the last good update in my unpopular opinion.", 0.5604395866394043], ["Exactly the same game but with less fps and more bugs\nEdit : Literally full of bugs just did a car heist and the car is nowhere no be found\nAlso many blackscreens while loading into business, really trash", 0.5570469498634338], ["After playing this game for years, I am no longer able to play unless I log in through Windows. I'm a Linux user and am now kicked from every online session that I try to join, simply because I'm not running on Windows. Beware Steam Deck users, you also run on Linux and not WIndows.", 0.5497367978096008], ["Could be a good update, but I'll never know because Rockstar Support is trash. Haven't played a Rockstar game in 5+ years, so the email address used by the R* account is no longer valid. After spending 30+ minutes talking to support, they refuse to update the email address because I can't remember the exact date 5+ years ago when my Steam account was linked. \n\n0/10 for customer service, Rockstar.", 0.5495495200157166], ["No, Its impossible to coordinate heists or a simple mission since the removal of text chat. if they bring it back ill change this to a thumbs up.", 0.5461346507072449], ["still old ass GTA5 with raytracing, slower load times, no text chat and shittier online\n\nthe most unforgivable thing is that the strippers still have PS3 boobs texture from 2013, so sad!", 0.5454545617103577], ["stopped playing gta altogether because after the enhanced released, i simply couldn't migrate my 1300hr character over to the new version :)\nthis is probably due to a fact that i've been playing in public lobbies for several years and in almost each and every one of them you would get at least one cheater that could randomly teleport you and start spamming money/rp.\nand even those few seconds that you spend going to the menu to change lobbies might be enough to get your account to a \"non-eligible for migration\" status.\nalso not being able to use text chat in a multiplayer game on PC is insane\namazing work, rockstar", 0.5454545617103577], ["PLAYED ON STEAM-DECK\nContrary to the steam page. This game is actually playable on Steam Deck, Single player runs great, 4+ hours guaranteed on OLED models. However this isn't the definitive way to play this game.\nPROS:\n+GTA 5 itself is a good game\n+Graphics are updated so if you play on a beefy computer, the game is guaranteed to look good (Not great like modded but still good)\n+GTA Online content previously exclusive to PS5/Xbox Series X consoles is now on PC which includes free roam animals and extra cars.\nCONS:\n-Mandatory battle eye anti cheat which is really invasive and you need to install it if you ever plan to play GTA Online\n-Mandatory third party account requirement (Social club to be specific) IN A SINGLEPLAYER game\n-Mandatory periodic internet requirement to check the validity of the game license (Requires internet for singleplayer)\n-Due to battleeye requirement, GTA online is now unplayable on Linux so you are essentially forced to use Windows to play the game\n-Rockstar game launcher is required because apparently the game can't run without yet another bloatware.\n-GTA Online in this version of the game is heavily castrated as they removed global chat which was the only good thing about playing this game on PC. Guess it was cheaper than hiring moderators to monitor the ingame chat \n-Character transfer is random as people who hacked could transfer it meanwhile people who were harassed by modders dropping moneybags got denied so they were forced to start fresh or stay on original version of this game\n\nTLDR:This game version sucks and I only got it for free because I had the original version. I'll still play it for the singleplayer on steam deck but I'd stick with console version which doesn't require social club, internet to check the validity of my game license and literal spyware just so I can play online and get murdered by a modder who got accepted or a kid who stole his mom's credit card and bought shark cards using his college funds. Play this game on console or use emulated PS3 version if you want the authentic singleplayer 2013 experience. Both are marginably better than PC version. Unfortunately for us handheld gaming fans, this is the only way to enjoy GTA 5 portably. All hope lies on Switch getting GTA 5 port", 0.5424836277961731], ["Be me\n\n-make a new character\n-start a nighclub and do the prep for it\n-after prep, get automatically put into a online session\n-do a VIP mission\n-get attacked by a low life with the Xx_ (iykyk)\n-kill him and keep moving product\n-cheater bombs the whole server again and again and again\n-cant even leave cause when you die, it closes the menu\n-cheater doesnt get banned and keeps doing it for a very long time\n-Alt-f4 the game\n-uninstall", 0.5419847369194031], ["Just downloaded and have over 800 hours grinding on my old account and it wont let me migrate. Messed up to not let your player base transfer their hours of work over on your billion dollar game.", 0.5416666865348816], ["It loads and runs better. Don't care about the RTX and stuff.", 0.5904664993286133], ["尽管在2016年的时候我被外挂刷钱误封了一次，让我对R星的运营非常地反感，给了原版差评，但是在这个时间节点——GTA5增强版上线并且可能永远不再更新以及GTA6即将发布的时候，我最后决定还是给GTA5一个好评，毕竟它承载了我跨越几乎10年的欢乐时光。\n\n如果你看到了这篇评论，请记得，千万不要去公开战局，打开游戏请务必先进入故事模式，再去好友或者邀请战局。做完任务卡黑屏后，大概率会在公开战局，如果是的话立即切换到好友或者邀请战局。现在的外挂太厉害了，不仅可以修改你的金钱，还能修改你的等级。据说外挂厉害到可以通过查找别人的ID甚至修改主机版的账号，所以请不要轻易透露自己的ID！！！\n\n还记得2015年GTA5终于登录了PC版，那一天早上，我和大学几个舍友6点起来打开电脑等待解压，甚至连课都没有上，可是当时的笔记本还是机械硬盘，几十G的大小解压到了12点都没有玩上。到了下午解压完毕后，我和我大学最好的朋友之一阿童木便直接进入了在线模式，跳过了教程的我们漫无目的地瞎逛。我们拿着小手枪去打劫小卖部、去打帮派（地图上的红圈），才获得几百元，死了还掉钱，可以说是颗粒无收。解锁了竞速比赛以后，我们就用路上抢来的车去跑图，一直跑到解锁了小差事，才你开一局、我开一局地有目标的玩起来。因为等级低，武器差，前期的差事也非常难做，有些甚至简单难度（2条命）都比较难，甚至有时候手枪子弹都打空了。尽管预购送了几十万，但是我们还是省吃俭用，没有乱花。直到12级接到了莱斯特的电话，我才在佩罗买了第一套抢劫公寓，开始了抢劫，过了全福银行，他买了防弹骷髅马，我们才度过了新手村。接下来，便是新手村的噩梦，越狱分红。\n为了过越狱分红，我叫来了曾经一起玩战地系列的网友们，教他们如何开飞机和直升机。不知道换了多少组人，不知道尝试了几次才终于通关。期间也有各种各样的坑逼之处，比如美杜莎接到人后前面有一辆警车挡住，美杜莎到了黄点后因为有人网卡导致无法消星，跳伞时因为开伞太慢被摔死，上直升机时碰到后螺旋桨被绞死，因为地图加载慢直升机碰到电塔被撞死等等。当然了，最令人意外的玩法是，阿童木他发现，他可以开直升机在监狱周围发射导弹攻击监狱里的敌人帮地面组开路，而我只需要开着美杜莎跟着天煞的屁股无伤过关。还有一位玩家发现，衣服店里的套装——重型战斗服在抢劫任务里穿上以后非常耐打。之后，游玩的日子便平平淡淡地慢慢过去了，游戏群越来越热闹，大家互助，都渐渐地买了桑托劳（当时最好的跑车）、小鸟（当时任务最好用的直升机）或者其他喜欢的东西。直到有一天我逛贴吧发现，有个叫犯罪首脑的成就可以赚1000万！\n于是，我把阿童木、屁股猫、viva三个人叫上，便开始了首脑的征程。经过了三四天的战斗，中间拔了两次网线，我们终于通关了。在赚取了1200万以后，他们疯狂地买买买，买了九头蛇、女武神等等，甚至买了一些奇奇怪怪的东西，而我也激动地写下了详细的攻略发到贴吧，还一直给网友解答，直到半夜3点才睡下。那篇帖子，在当时应该是首脑攻略贴前5吧，几乎没什么人写。所以那一贴也有大概几百个留言。可也从那以后，GTA5的热度渐渐地褪去了。不仅是阿童木、屁股猫、viva，游戏群里的其他人也慢慢地不上了。过了大概一年以后，GTA5才迎来了第一次大更新，办公室和运货，我才再重新打开这个游戏，也正是那时候，我被外挂刷钱误封（两次，第一次是10天，解封后我不信邪又去了公开战局就挨永久了），留下了一条差评就再也不玩了。\n后来，我到了外地工作，过上了5+2的生活（周末回家），因为家里没有电脑，我买了一台PS4，当我不知道玩什么的时候，GTA5又重新进入到我的视野。仅需120多元，就可以把游戏+800万鲨鱼卡拿到手。这一次我起步非常快，到了大概80级左右，我遇到了最好的网友anqi。在外地工作1年以后，我回到家所在的城市继续工作了。PS4可以玩得更加频繁，虽然PC拿回来了，但是GTA5让我陷入PS4也无法自拔（PS4也同时玩着独占游戏）。就在随口一问的情况下，我再次踏上了犯罪首脑成就的征程。这次，我带着anqi、萝卜和阿迪一起冲，不过这一次远没有第一次那样充满激情。但同样的，萝卜和阿迪在完成首脑之后，就几乎再也没有上线了，只有anqi和我玩到现在。\n再后来，玩完了PS4的大表哥2后，PC的大表哥2也上线了，anqi买了PC，我们又就在PC上再重新玩了一次GTA5和大表哥2。我把原来的R星账号取消了重新注册一个并关联到GTA5，尽管一切从头开始，但是随着犯罪新手包和大白鲨卡合集的加入，GTA5相比2015年那会真的太好太好了。\n现在，只要GTA5一更新，我和anqi都会第一时间去体验，但也大概是一周的时间体验完几乎所有的内容后，我们又去玩别的游戏了。\n\n说完了我自己的经历和感慨，也不得不吐槽一下GTA5真实存在的缺点：\n战斗平衡严重缺失。游戏角色血量是和等级挂钩的，等级低的时候敌人两三枪就把你打死了，但就算是100级，也承受不了多久。而且敌人的枪法非常准，哪怕你开着直升机也有可能被拿着手枪的敌人打死。防弹衣的耐久度也是非常可怜，哪怕是最高级的防弹衣也最多能顶两三枪。在没有骷髅马或者更好的载具的时候，往往是不停地吃药和吃甲，在那种小差事里，甚至可能入不敷出（购买零食、护甲、弹药的总开销大于任务报酬）。从任务机制上看，敌人刷出的数量多且无脑，玩家抢一个割炬之类的东西竟然要动用直升机（如果玩家开飞行载具）？越到后期（从老抢劫任务开始），玩家的攻击手段越强越丰富，敌人刷新的数量和规模就越离谱，基本上就是纯步战没法玩。在人物控制方面，尽管有贴掩体功能，但是却没有切换掩体功能（例如幽灵行动和全境封锁），人物傻傻的出了掩体跑到下一个掩体还要被打。在遇到没有掩体的时候更是灾难，甚至没有蹲下或者趴下的选项（听说以前是有的后来被删掉了），希望GTA6的蹲下和趴下不要被删。手柄的操作体验也是分化很严重，全辅助瞄准非常爽，在中近距离用非狙击枪，瞄准就直接黏在敌人胸口，右摇杆轻推就能轻松爆头，特别是在末日抢劫机库关灯那一关，你甚至可以不用戴上夜视，凭手感就能一一爆头。但是在驾驶车辆和使用狙击枪时，自由瞄准是灾难性的，基本上只能被敌人吊打。视角基本是角色右侧越肩视角，无法切换到角色左侧，所以在对付一些右侧转角的 敌人时往往比较被动，除非换成第一人称。有些时候进入掩体丢手雷会反弹到自己脚边，有时候出掩体使用火箭筒会直接打到掩体炸死自己。第一人称优化不够好，虽然开车代入感十足，但撞车了也是真头晕，而且开枪视角受限。\nUI界面非常不人性化。随着时间的推移，衣服店里的衣服越来越多，玩家购买的枪和车越来越多，但UI的逻辑还是线性的。比如说任务里选车，只有左右选，而且你不知道你要往左还是往右、按几下才能选到自己想用的车。应该把UI化成二维菜单，像田字格一样既可以左右还可以上下，并且给一个缩略图和文字，最好还能分类（就像买车界面一样）。同时推出像武器库一样屏蔽功能，再把屏蔽功能做得完善一点（任务里也能屏蔽）。同样的，购买衣服时也有图片预览，像看门狗那样一眼能看到衣服的颜色和款式，省得一个个地上下翻。\n职业奖励没有层次感。增强版推出了职业系统，每个系列都有四个阶级的奖励，但大多数的奖励令人唏嘘，只有其中几个比如给小鸟、给一辆超跑比较有用——但完成那个奖励的时候，我自己都可以买了。依靠那个职业奖励，还不如去玩蠢人帮的任务，即送一个赚钱工具致幻实验室，还送一辆超跑。\n无论怎么说，GTA5在我心中仍然是游玩首选，一旦更新，别的游戏都放一放。如果让我推荐一款游戏，那必定是GTA5。\n\n最后再补充一下线上的攻略吧。无论你是单人还是和好友一起玩（多人游玩会轻松很多），基本路线是一样的。如果你有手柄，稍微练习一下上述的爆头手感会轻松很多，并在开车和使用狙击枪时无缝切换键鼠游玩。\n首先是完成蠢人帮（达克斯）的任务线，在地图中间那个湖的南边有一个黄色的R字母，去了以后开启第一个任务，记住这个任务最后交付的仓库地点，以后会在这里（城市地区东北角跑马场、赌场的南方）出现一个像白色房子带黄色字母D的图标，继续往下做。一直做到拿到一个大卡车后，就可以用这个大卡车（致幻实验室）挣钱了。此时，可以通过手机打电话给达克斯请求差事，做完10个就可以升级大卡车设备（别的和摩托车都不需要升级）。升级完毕后，在大卡车内购买原材料，并且每天（现实时间下午4点以后）在大卡车内加速制作一次。当库存满以后，按M键——服务载具——致幻实验室——产品名称可以修改，稍微增加产品价值后再卖掉。出货的过程非常简单，一个人就可以完成。这个资产会一直陪伴着你，注意经常关注原材料和库存的进度！接着你可以继续做蠢人帮的差事，全部完成后会得到一辆名叫美德的电动跑车，这辆跑车的综合性能不在前10也有前20吧。\n然后，到城市地区的中间靠西位置有个黄色的V字母，开启当当钟抢劫。大概40-50分钟全部做完，队长有50万的收入，队员收入却很少。所以，你以队员身份完成一次终章获得25万（成就奖励）后就别再参加了。这个系列任务你想做多少次都可以，但是在完成终章后要过现实的48分钟（游戏内一天）才能再开启。\n接着就是攒钱买虎鲸，在手机网站的军火大亨里购买，购买以后就可以开启佩岛抢劫了。网上有不少攻略视频，建议是找个好友互相开。因为多人做完分红要过48分钟才能再次开启，而单人要等144分钟，不划算。第一次做完后建议攒钱买虎鲸配套的麻雀，不仅方便上下虎鲸做佩岛前置，还可以在其他任务里直接呼叫在旁边刷新，非常方便。从此刻开始，佩岛抢劫是首要的，在冷却时间可以做当当钟或者致幻实验室出货，这也是你今后挣钱的首要手段。\n此时，你已经过了新手村，之后可以根据每周的打折情况购买相应的资产游玩新的内容。个人建议是先购买服装厂或者夜店（看资产价格高低），然后购买恐霸并做5个恐霸的任务来解锁暴君MK2的批发价，购买了暴君MK2以后，所有的游玩体验都会有飞速提升。在无法使用暴君MK2的任务里可以继续使用之前的美德，也可以攒钱买综合性能更好、性价比更高的武装伊格纳斯。武装伊格纳斯还可以开到车友会（城市地区靠东南方向LS字母图标）进行改装，进一步提升性能。\n再然后，可以考虑买回收站或改装铺，但非必须。回收站每周会有三个偷车任务，每个只能做一次，有暴君MK2的情况下，单人半小时左右可以完成一个，有20-40万左右的收入。改装铺则主要是依靠联合储蓄合约，有暴君MK2的情况下大约半小时的可以获得27万左右的收入，但是在完成之后有48分钟的冷却时间，并且要在完成所有合约后才能解锁取消当前合约并刷新合约的功能。无论哪一个，尽管总体所花的时间都是比当当钟要低，收入也相应更低一些，但是这个用时放在等待下一次佩岛抢劫的48分钟里，是要比当当钟更好的——当然这个得看你具体游玩的时间安排。\n最后就是养老产业发展。建议根据每周资产打折情况，逐步购买地堡（有一个免费的先领取，有钱了再买单人出货必选的农舍地堡）、夜总会（地点无所谓，出货想快一点的选好莱坞附近2个）、摩托车帮会所加除大麻和伪证工厂外的其他三种工厂（地点无所谓）、机库（推荐军事基地）或者办公室加货物仓库（办公室有一个免费送的，在办公室里买货物仓库）。地堡和夜总会升级购买与货物有关的，其他资产可以不升级。具体的地堡和夜总会的出货和设置搭配可以看网上攻略。自此，你进入了挂机赚钱的阶段。只需要打开游戏，画质和分辨率设置到最低，时不时去地堡和致幻实验室进货，等到地堡、致幻实验室和夜总会商品满了再出即可，并不需要辛辛苦苦地去佩岛。如果选择手动去佩岛，也别忘了时不时看看地堡、致幻实验室和夜总会。\n再往后，就是看一看其他打折的资产（事务所、保金办公室等、载具仓库、设施、游戏厅等）买来玩一玩对应的任务和抢劫任务，做一些地图上其他黄色字母的系列任务，到ESC——线上——差事里看看隐藏地很深的小任务、防守战等，还有手机联系人里各种请求的差事、各类PVP模式（不推荐和不认识的玩家玩小心外挂）等，或者尝试做一下各种职业任务和奖章挑战，比如犯罪首脑。这些基本就是所有的游戏内容了。\n\n最后的最后，祝你游戏愉快！", 0.5399239659309387]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3240220/header.jpg?t=1741381848", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3240220/a318bd9affe8eee32984b18794b273c256e9b2d6/capsule_231x87.jpg?t=1741381848", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3240220/a318bd9affe8eee32984b18794b273c256e9b2d6/capsule_184x69.jpg?t=1741381848"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.rockstargames.com/V/"}, "developer": "Rockstar North", "owners": "0 .. 20,000", "tags": ["Action", "Open World", "Multiplayer", "Crime", "Mature", "Third Person", "Automobile Sim", "First-Person", "Shooter", "Adventure", "Racing", "Third-Person Shooter", "Sandbox", "Atmospheric", "Comedy", "Funny", "PvP", "Moddable", "Sexual Content", "Co-op"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 69488, "number_of_achievements": 77, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action", "Adventure", "Racing"], "short_description": "Experience entertainment blockbusters Grand Theft Auto V and Grand Theft Auto Online — now upgraded for a new generation with stunning visuals, faster loading, 3D audio, and more, plus exclusive content for GTA Online players.", "long_description": null}