{"name": "ARK: Survival Evolved", "app_id": "346110", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£12.79", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 198401, "negative_reviews": 45963, "reviews": [["Ya it is a great game and will consume many many hours of your life. Even with the official servers gone it is still a blast to play single player.", 0.7725756168365479], ["[h1]ARK: Survival Evolved – A Love-Hate Relationship[/h1]\r\n\r\n[hr][/hr]\r\n\r\n[h2]🦖 My Experience After 53 Hours[/h2]\r\n[i]ARK: Survival Evolved[/i] is one of those games that can give you some of the best gaming moments—and some of the most frustrating ones. I’ve spent over 50 hours in this world, and I still have mixed feelings. It’s an ambitious, immersive survival game, but it’s also riddled with issues that can make it a headache to play.\r\n\r\n[hr][/hr]\r\n\r\n[h2]🌎 The World and Exploration[/h2]\r\n[b]🏝 Stunning Environments[/b] – The world of ARK is gorgeous. Whether you’re exploring lush jungles, snowy mountains, or deep caves, the sense of discovery is amazing. The game does a great job of making you feel like a true survivor.\r\n\r\n[b]🦖 Taming Dinosaurs[/b] – The ability to tame, breed, and ride dinosaurs is hands down the best part of the game. Nothing beats the feeling of finally taming a T-Rex after hours of effort, only to have it get killed by an alpha raptor five minutes later.\r\n\r\n[hr][/hr]\r\n\r\n[h2]⚒ Survival and Gameplay[/h2]\r\n[b]🥩 Harsh Survival Mechanics[/b] – If you enjoy grinding for resources, managing hunger/thirst, and crafting everything from spears to full-on bases, you’ll have a great time. However, the grind can be excessive, especially solo.\r\n\r\n[b]🛠 Base Building[/b] – The building system is solid but can be frustrating. Snapping pieces together doesn’t always work as intended, and a poorly placed foundation can throw off an entire build.\r\n\r\n[b]⚔ Combat[/b] – Combat is clunky. Melee fights feel awkward, and hit registration can be unreliable. Gunplay improves things, but let’s be honest—most fights are just you getting mauled by a raptor when you least expect it.\r\n\r\n[hr][/hr]\r\n\r\n[h2]🔁 Replayability and Frustrations[/h2]\r\n[b]🌍 Tons of Content[/b] – ARK has a ton to do. From exploring caves and fighting bosses to breeding an army of dinos, the game offers hundreds of hours of potential gameplay.\r\n\r\n[b]🤬 Bugs, Performance, and Grind[/b] – Here’s where things fall apart. The game is notoriously buggy, with frequent crashes, lag, and weird physics glitches. If you don’t tweak settings or play on a good server, performance can be a nightmare. Also, the grind for resources, especially on official servers, can be ridiculous.\r\n\r\n[hr][/hr]\r\n\r\n[h2]✅ Final Verdict[/h2]\r\n[i]ARK: Survival Evolved[/i] is a game that demands patience. When it works, it’s an incredible experience full of adventure, danger, and unforgettable moments. But the bugs, clunky mechanics, and brutal grind can turn it into a frustrating slog. If you have friends to play with, it’s much more enjoyable. If you’re playing solo, be prepared for a tough ride.\r\n\r\n⭐ [b]Score: 7/10[/b] – Fun but flawed.", 0.698215901851654], ["ARK: Survival Evolved – Where the Strongest Predator is the Server Lag\n\nLet me just start by saying: DINOSAURS.\nYou can ride dinosaurs. That alone should sell the game. But thankfully, ARK brings a lot more to the table than just prehistoric Uber rides.\n\nThere’s legit fun to be had here—especially with friends. Base building is satisfying, the world is beautiful (still holds up years later), and the crafting/resource gathering system actually has depth. Using specific dinos to farm certain materials instead of just your tools makes progression feel clever, not just grindy. Each map brings a new vibe, new challenges, and some terrifying world bosses that make you feel both hyped and deeply unprepared.\n\nBut oh man… the grind.\n\nYou will lose everything. Frequently. Sometimes to other players, sometimes to server crashes, and sometimes to an angry pack of raptors that decided today was the day you die screaming. The PvP community? Rough. Like “rage-quit and uninstall” levels of toxic, especially if you're on official servers. And while the jank has been cleaned up a bit over the years, the ghost of ARK bugs past still haunts the game from time to time.\n\nThe learning curve? Imagine getting slapped by a T-Rex, thrown into lava, and then being told to read a wiki to figure out why it happened. The game tells you almost nothing—especially when it comes to the late-game boss fights. You’ll 100% be Googling strategies while trying not to get eaten by a giga.\n\nFinal Thoughts:\nARK is chaotic, punishing, and sometimes infuriating. But it’s also epic, unique, and incredibly fun—if you have the patience, or a group of friends to suffer with.\n\nThumbs up. 8.5/10. Would die to a raptor ambush again.", 0.630482017993927], ["game too easy without primal fear. primal fear too hard. change settings to be easier. too easy. add godzilla mod", 0.5715524554252625], ["it's a good game, most fun with friends. has a \"small\" learning curve, a lot of frustration blood and tears aside, it's one of my favorite games. highly recommend it", 0.5419847369194031], ["Honestly, ARK is such a vibe when you're playing with friends. The world is gorgeous, the dinos are adorable (even the scary ones ngl 😅), and there's always something fun to do together — whether it's building your cute little base or running from a T-Rex in your undies 😂\n\nBut heads up: the game doesn’t explain much at first, so watching a few YouTube guides helps a lot. Also, MODS. Omg the mods take the game to a whole new level — better UI, more dinos, even some ✨aesthetic✨ stuff for your base. Highly recommend!\n\nJust be ready to invest some time and maybe scream a little when a raptor jumps you outta nowhere 🫠\n\nRating: 9/10\n(with mods: 11/10 💅)", 0.5305832028388977], ["Would I recommend this game? Hell, you bet I do! Unfortunately I'm enjoying its successor right now, so you'll get the extended review on ASA. But some of many arguments would be: gigomantic sized world on many maps, rich and vast gameplay content, sandbox galore and peak survival mechanics, dated but still fantastic graphics, singleplayer and multiplayer, as well as first person and third person gameplay, and the most important part, it doesn't end there. You get to pull even more fun out of it with the help of high quantity and quality mods.\n\nThe concept of the ARKs alone opens so many possibilities for content creation, it's basically like a lot of games I've played in the past have been embedded into those many ARKs(maps). Technically the lore doesn't end with simply \"hunting and taming Dinos\"-for win. There are mods, and in return ARKs, that don't even feature Dinos. Technically the DevKit would allow for a complete recreation of Skyrim, Fallout 4, or Starfield on a dedicated ARK, with most, if not all the original gameplay included and potentially even outperforming Bethesda in that regard.\n\nIf that community would just be a tiny bit bigger for both games, we might be able to never need to go the stars at all, we'd just bring them to Earth, on one of the ARKs.", 0.5230125188827515], ["It has its issues, but it's genuinely an addicting and good game in spite of them. The creativeness of the community when it comes to the workshop is also one of its strongest points.", 0.5204603672027588], ["Garbage development team cant even fix bugs from many years ago hey definitely don't deserve more money for a newer game with all the same bugs!", 0.5125554203987122], ["I'm a 63 year old retired grandmother who is totally submersed in this game! I've been playing since September 2024 and have 1286 hours total...so far lol. \r\nThis is my stress relief from the everyday mundane day to day where most just go about their merry way \"existing\" yet don't bother to actually take time for just themselves even if it was to just play a game or 2, or even just read a book. \r\nI chose Ark Survival Evolved for the multiplayer PVE aspect to play with friendos who also had the game, now we're a Tribe of our own & have a blast. Dont get me wrong in this game you are going to DIE..TRUST me, at some point it will happen, but I've also learned how to do so many things such as crafting People food & drinks, dino taming kibble,clothes & structures. \r\nI give this game a %100 thumbs up!!", 0.5600000023841858], ["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☑ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☑ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10", 0.506355345249176], ["this is probably the best game I've ever played, can't wait for ARK II", 0.5], ["greatest game ever, you can do almost anything, definitely my fav game of all times, its a shame they closed official servers and launched the disgusting Ark: survival ascended, worst game ever.", 0.5], ["spawn\r\nget resources\r\nkill\r\nmake base\r\nget tame \r\nget good gear and good time like rex\r\nfight bosses\r\ngo to every island\r\nend game", 0.5], ["Terrible, works first time around then crashes on startup for literally no reason, waste of pc storage space and my time", 0.5], ["well i have 4 hours on the game and actually havent played the game yet w game i love modding", 0.5], ["I like the game play farming goods to build or to grow plants for food the maps are large and has lots to explore and find", 0.5], ["Do you like slavery, animal abuse, and grinding for an outrageous amount of materials ? Well boy do I have the game for you.....", 0.5], ["NEW PC PLAYERS READ\r\n\r\nIt says 3 hours. That would be incorrect.\r\nI have thousands of hours on PC as well as Console.\r\n\r\nThis is directed towards players who's journey started on console, but are unsure about the transition to PC. \r\n\r\nI suggest buying the game, but i do not think ascended is worth it.\r\n\r\nI bought a high powered pc back in 2008, years later I switched to console because it was cheaper, (you get it) and now have transitioned back because i have money to spend.\r\n\r\nHey my name's ryan and my life is pretty crazy.\r\n\r\nI could have spent my money on oblivion remastered, but i bought the old version like three weeks ago and im way too angry about it.\r\n\r\nIll invest in whatever the team from skyblivion is doing just to spite bethesda.\r\n\r\nAnyway, i suggest just buying this, its worth it, trust me.\r\n", 0.5], ["First of all, I know it says I only have 24 hours on this game. But that is only on STEAM I have over 1000 hours on Xbox. I think this is the best game ever. No other game could get as perfect as this game. It combines survival with dinosaurs and tech. It is awesome.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/346110/header.jpg?t=1709879597", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/346110/capsule_231x87.jpg?t=1709879597", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/346110/capsule_184x69.jpg?t=1709879597"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.playark.com"}, "developer": "Studio Wildcard, Instinct Games, Efecto Studios, Virtual Basement LLC", "owners": "20,000,000 .. 50,000,000", "tags": ["Open World Survival Craft", "Survival", "Multiplayer", "Open World", "Dinosaurs", "Crafting", "Building", "Adventure", "Base-Building", "Co-op", "Action", "First-Person", "Sandbox", "Massively Multiplayer", "Singleplayer", "Early Access", "RPG", "Dragons", "Sci-fi", "Indie"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Russian", " Portuguese - Brazil", " Simplified Chinese", " Czech", " Danish", " Dutch", " Hungarian", " Polish", " Swedish", " Thai", " Traditional Chinese", " Turkish", " Ukrainian", " Finnish", " Japanese", " Korean"], "concurrent_plays": 34132, "number_of_achievements": 32, "categories": ["Single-player", "Multi-player", "MMO", "Co-op", "Steam Achievements", "Full controller support", "Steam Workshop", "Steam Cloud", "Valve Anti-Cheat enabled", "Includes level editor", "Remote Play on Tablet", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "Massively Multiplayer", "RPG"], "short_description": "Stranded on the shores of a mysterious island, you must learn to survive. Use your cunning to kill or tame the primeval creatures roaming the land, and encounter other players to survive, dominate... and escape!", "long_description": null}