{"name": "Tom Clancy's Rainbow Six® Siege", "app_id": "359550", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£17.99", "final_price": "£7.19", "discount_percent": 60, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 502865, "negative_reviews": 91500, "reviews": [["I get railed in the ass every game, it sucks, but its addicting asf. 5 stars", 0.8571603298187256], ["Shit ass pisspoor excuse a fucking game, i queue against a 5 stack of champs with absolute burgers on my team. I'll go like 7-5 just to get absolutely shafted by some degen that I should NOT be queuing against. Then to top this whole fucking circus act off, I attempt to re-queue, my game crashes, and I get an abandon penalty. And you would think that submitting a ticket to their website would do something (because I have \"connection issues\" when in reality this game randomly crashes) but fuck no, there is nobody but some vegetable troglodyte sub human mass of lard behind running the customer service. Gimme ranked 1.0 back", 0.8086066842079163], ["One of the worst matchmaking systems of any game I've ever played. Make sure you never have a decent game and win because if you do you will get into the most one sided 0-4 ranked game of your life the very next game. One of the worst experiences I've had gaming. I cannot wait to reinstall it and play it again later.", 0.801456093788147], ["my buddy kept getting this bug where the game kicks him from a ranked game or crashes and doesn't let him rejoin and then bans him, he is banned for a week. This bug has existed for 7 years. Actually awful", 0.6898642778396606], ["Hate this game with a passion but somehow always going back to it.\n10/10\nWould not recommend.", 0.6334248781204224], ["https://tenor.com/fi/view/rainbow-six-gif-22023569\n\n\nHave you guys seen this gif from that sad seal who was forced to play Tom Clancy's Rainbow Six Siege?\n\nI saw the gif and also i played the game. Now i understand the fear and suffering on that seal's big and sad eyes.  That game is horrifying and now i have ptsd (post-traumatic stress disorder).\n\nI think i am going to start fundraiser for that seal and get therapy for myself. So think twice before you start playing!\n\nThanks for reading, GOODBYE!", 0.5875312685966492], ["The Community is trash everyone in your team is bad at the game and everyone in enemy team is good at the game no matter u get high kills or nothing u will lose until u r lucky enough to get a good team.\r\nGarbage Game And Community Dont Ever Try it", 0.5835244059562683], ["If you have low sanity and zero self worth then this game is perfect for you!", 0.598540186882019], ["Game with year 1-2 operators were perfect. Now with all the LGBT special forces characters, game is so unbalanced you don't feel like you are playing a FPS game.", 0.5599187612533569], ["Somehow I have played for 125 hours despite being pretty sure I have only played 20. The game gets better, understanding deeper and learning curve higher somehow. Love it, worthy spend of time.", 0.5569325685501099], ["this game makes me literally want to die. everytime i am in a gunfight someone drop shots me and i get absolutely fucked in the asscrack. dont buy this game.", 0.551586925983429], ["any thing u type in chat, It is considered as a offensive talk and reduce ur chance to get more maney in game \r\ni recommend this game to parents that want their kids be polite", 0.5456790924072266], ["I like this game, I don't like the developers. Also the hitreg is somehow worse than any first person shooter game that I have ever played. Halo 3 at launch had better hitreg than this game and that was not something anybody enjoyed.", 0.5381385087966919], ["gettins 3 hour bans in standard play is laughable...cant for whatever reason fix the cheating issue which is huge btw, but you can sure ban folks for leaving a game in standard playlist mind you when theyre pc decides to not recognize a controller randomly and i have to restart my pc to fix it... Disgusting.", 0.5283018946647644], ["Packet lost > disconnected > try to reconnect > \"you has been removed from game section\" > can't reconnect > got penalty from it\r\n\r\nfrustrating game \r\n\r\nthe issue has been there for years according to some reddit users", 0.523809552192688], ["this game reminds me of when the one time i was raped by 13 ginormous black men. I lowkey enjoyed that but to other people it would look bad. this game is worse i would rather be raped by marquese and them i loved it <3", 0.523809552192688], ["My name is Likely and I am a Binge Addict. I come before you to implore that you do not spend your money on this addiction enabling video game. When you're having fun it is the best. But then you get teammates that were birthed from the womb of a mentally challenged sheep and a hillbilly who couldn't keep it in his pants. So now I'm forever cursed to que a game with their offspring. How is it possible to go 0 and 8? Perhaps we'll never know, maybe just maybe it is one of the seven wonders of the Universe. What a funny thing the Universe, because one day youre heading to the pro leagues. Then there's a switch in the universe, a flip on the time line and now you're one of the acursed offsprings I mentioned before. As a consequence you're looking at your desk trying to figure out if you can afford the rage building up inside you. So I implore you, don't. Just don't.", 0.523809552192688], ["i didnt have an account i sign up with myy email and try to play but it sayys my account is banned games retarded fix it now\r\n", 0.523809552192688], ["Lovely bug that will boot you out of a ranked game and doesn’t allow reconnect, restarted steam, Uplay and even my WIFI just to be safe and still doesn’t allow you to come back and unfortunately this isn’t a once off issue for myself so I get a lovely 2 hour ban, thank you ubi", 0.523809552192688], ["Bad balance, Bad Network code, Cant reconnect to ranked games because of server error and much more. This game 10 years old and this french people still cant do games.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/359550/header.jpg?t=1742315874", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/359550/capsule_231x87.jpg?t=1742315874", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/359550/capsule_184x69.jpg?t=1742315874"}, "support": {"support_website": null, "support_email": null, "game_website": "http://rainbow6.ubi.com/"}, "developer": "Ubisoft Montreal", "owners": "20,000,000 .. 50,000,000", "tags": ["FPS", "PvP", "e-sports", "Multiplayer", "Tactical", "Shooter", "Competitive", "Online Co-Op", "Action", "Hero Shooter", "Team-Based", "Military", "Strategy", "First-Person", "Co-op", "War", "Realistic", "Destruction", "Difficult", "3D"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Czech", " Dutch", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Traditional Chinese", " Simplified Chinese", " Turkish", " Thai"], "concurrent_plays": 72130, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Full controller support", "Steam Trading Cards", "In-App Purchases", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action"], "short_description": "Tom Clancy's Rainbow Six® Siege is an elite, tactical team-based shooter where superior planning and execution triumph.", "long_description": null}