{"name": "Hollow Knight", "app_id": "367520", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "CAD", "original_price": "", "final_price": "CDN$ 19.49", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 125718, "negative_reviews": 3641, "reviews": [["A game full of bugs. Real bugs🐛🐞🐝🦗🦋\r\nBought the game because of its reputation, it lived up to that reputation implied. \r\nI was lost at first because the game doesn't tell you where to go or what to do, no map at the initial stage. Was super confused so I just jumped around, fought a few bugs, collected badges, learnt a new skill, next time I noticed the clock was 2am. What's wrong with me.\r\n\r\nIf you explore the game thoroughly you can sink hundreds of hours into it. Lots of secrets, NPCs, badges, skills and enemies to collect and discover (I love that). You can see the devs have put a lot of effort into making this game by its astonishing content.\r\nIt's a steal even buying it at full price💲. I feel sorry (well not that sorry) I bought it at 50% off.\r\n\r\nPS. Parkour in this game is freaking hard, imo harder than boss fight.\r\nPPS. 🎉🎉Heard that Silksong is coming in 2025. Hype me up.🥂", 0.856758177280426], ["300 hours. All achievements. These numbers don't even begin to scratch the surface of my experience with Hollow Knight. This wasn't just a game I played; it was a world I inhabited, a journey I poured my heart into. From the moment I stepped into Hallownest's melancholic beauty, I was captivated.\r\n\r\nThe sheer artistry is breathtaking. Every pixel, every animation, every haunting melody breathes life into this decaying kingdom. The atmosphere is thick with mystery, a palpable sense of loss and wonder that pulls you deeper with each step. But it's not just pretty; it's challenging, rewarding, and deeply, deeply satisfying.\r\n\r\nThe combat is a dance of precise timing and skillful parrying. Each boss battle felt like a personal triumph, a testament to my patience and dedication. The exploration is unparalleled; every hidden nook and cranny holds a secret, a treasure, a piece of the puzzle that is Hallownest's tragic history. I found myself constantly losing myself in its intricate map, always discovering something new, something breathtaking.\r\n\r\nMore than just a game, Hollow Knight is an experience. It's a testament to the power of atmosphere, the thrill of challenge, and the beauty of exploration. It's a game that has stayed with me long after I 'completed' it, a world I still revisit in my thoughts. If you're looking for a game that will challenge you, move you, and leave a lasting impression, look no further. This is a masterpiece, and I wholeheartedly recommend it.", 0.7886433601379395], ["One of the BEST GAMES I HAVE EVER PLAYED!! It is my first game in this genre and i loved it still playing, the music is soo good and the visuals is also very nice and yeah i loved it still playing the game have to GIT GUD!!!", 0.6848528981208801], ["9/10 – Must-play as it probably is the best metroidvania souls-like out there.\n\nPros:\n- Good and challenging combat\n- Good visuals and art\n- Amazing soundtrack\n- Deep lore\n- Tons of hidden places and secrets\n- Great boss design\n- A lot of customization with charms\n- Huge map with lots to explore\n\nCons:\n- Too much backtracking\n- Confusing and hard to know where you should go(yes, even for a souls-like)\n", 0.734565794467926], ["I’ve never been much of a platformer fan, to be honest—but Hollow Knight is a rare exception. Though it may be a 2D game, it carries more depth than many big-budget 3D titles. If you have an adventurous spirit, enjoy a good challenge, are looking for an emotional story, find satisfaction in patterns, and love getting lost in beautifully crafted worlds (not to mention skulking through shadowy corridors XD), this is an experience you shouldn’t miss. I often find myself wishing I could discover it all over again—for the very first time. Ah well - guess it's time to start another playthrough. :p", 0.5790650248527527], ["Fun game where you get lost for multiple hours on end unless you have a specific charm 10/10", 0.5626187920570374], ["Probably the best metroidvania out there. The combat is super satisfying and the games aesthetic is too clean. At its price point its an absolute steal. Can't wait for Silksong.", 0.559174120426178], ["After 44 hours and dozens of tries on P5, I completed every achievement in this great game — the best 2D game of all time\r\n\r\n", 0.557722806930542], ["I recommend the game but it's just not for me, so I encourage you to get it, you can always refund it if you don't like, I waited a bit to long for that so i wasted 15 dollars lol", 0.5334439277648926], ["Beautiful game! I loved the graphics, story, and characters. A bit difficult to navigate first time so don't be afraid to look at guides online :) 10/10 definitely one of my favourite games", 0.523809552192688], ["Probably one of the best and my favorite metroidvania of all time.\nThe sound design is amazing\nThe visuals and art style are so good!\nThe bosses are honestly the best part of this game!\nAlthough it did have a slow start at first but as you kept on playing and getting more and more abilities traversing in this game becomes so much more better and worthwhile!\nIf you haven't already played this game, now would probably be the best time to get into it with silksong right around the corner.\nThis has been one of the best indie games I've ever played.", 0.523809552192688], ["This game drove me into a mentally ill state after several hours straight on the fittingly named, \"Path of Pain.\" Other than that the game is peak!11!!1!!!111!!1!!1!", 0.523809552192688], ["it's pretty cool but there is a decent amount of walking from point A to point B (average metroidvania) and deaths or mistakes can sometimes feel REALLY punishing (like me losing 1000ish geos by dying after I already died...) Also DO NOT USE THE BANK THE BANKER WILL STEAL YOUR MONEYYYY AAAAAAAAAAAAAAAAAAAAAAA\r\noverall great experience", 0.523809552192688], ["very good and fun game (dont try path of pain) very hard game but very fun i definitely did not break my mouse on the second boss", 0.523809552192688], ["One of the best games of all time, totally worth the money ESPECIALLY on sale. Incredible value, lets hope silksong comes out this year LOL.", 0.523809552192688], ["one of the best games u can buy, and for freaking 3 dollars thats a steal.\r\n\r\n i 100% achievements this game and i still feel like i wanna play it again .  10/10", 0.523809552192688], ["I‘m complete garbage at wall climbing stages but still volunteer to waste my time dying to my own skill issues just to get another new ability that I die of. Definitely worth it. BUY THIS", 0.523809552192688], ["Turning into one of my favorites. Definitely best game you could play on the steam deck", 0.523809552192688], ["This game is a masterpiece. Of both storytelling, gameplay, exploration... Bosses feel hard but rewarding and it's always fun to play a new game.", 0.523809552192688], ["I have heard about this game for years and always thought of it as something I'd like to play because I was a big fan of Symphony of the Night and Metroid Dread.  This is absolutely a super fun game that I would recommend to any fan of Metroidvania style games AS LONG AS you're ready for a REALLY tough challenge.  There are some challenges towards the end of the game that will REALLY test your patience but as long as you're persistent, you'll find the right means of dealing with the obstacles and bosses that you'll face.  \n\nDefinitely lives up to the hype in terms of super tight gameplay and very well done visuals that have a timeless look about it that will most certainly age well over time.  I'm also not the usual type of person to go for games this hard but it was fun enough of a game that it was worth getting to the finish line in the main game with the ending that required the most work.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/367520/header.jpg?t=1695270428", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/367520/capsule_231x87.jpg?t=1695270428", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/367520/capsule_184x69.jpg?t=1695270428"}, "support": {"support_website": null, "support_email": null, "game_website": "http://hollowknight.com"}, "developer": "Team Cherry", "owners": "10,000,000 .. 20,000,000", "tags": ["Metroidvania", "Souls-like", "Platformer", "Great Soundtrack", "2D", "Difficult", "Indie", "Singleplayer", "Atmospheric", "Exploration", "Adventure", "Story Rich", "Hand-drawn", "Multiple Endings", "Action", "Dark Fantasy", "Open World", "Cute", "Controller", "Side Scroller"], "languages": ["English", " French", " German", " Spanish - Spain", " Korean", " Simplified Chinese", " Italian", " Portuguese - Brazil", " Russian", " Japanese"], "concurrent_plays": 10960, "number_of_achievements": 63, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure", "Indie"], "short_description": "Forge your own path in Hollow Knight! An epic action adventure through a vast ruined kingdom of insects and heroes. Explore twisting caverns, battle tainted creatures and befriend bizarre bugs, all in a classic, hand-drawn 2D style.", "long_description": null}