{"name": "Fallout 4", "app_id": "377160", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£15.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 137016, "negative_reviews": 27388, "reviews": [["After so many years of fun and +1000 hours playing, just realizing not having left a positive review for this masterpiece.\n\nBest game ever!\n\nI´m 55 and  my first game was Defender of the Crown on a C64 in 1986.\nI played thousands of games since then. But FA4 is my benchmark for good games.\n\nBest game ever!", 0.8482552766799927], ["One the best Fallout games. Love coming back to it and playing again and again", 0.6223800182342529], ["Recommended ⭐⭐⭐⭐⭐ (150+ hours played)\r\n\r\nFallout 4 is a game that pulls you in and doesn't let go. With 150+ hours in, I can confidently say that it's an immersive, addicting, and sometimes overwhelming experience.\r\n\r\n✅ Pros:\r\n\r\nExploration is top-tier. The world is massive, detailed, and full of hidden stories. Every abandoned building has a tale to tell.\r\n\r\nModding potential is insane. If vanilla isn’t enough, the modding community has turned this game into an endless playground.\r\n\r\nCombat feels smooth. Gunplay is way better than previous Fallout games, and V.A.T.S. is still satisfying.\r\n\r\nSettlement building is addictive. You either love it or ignore it, but if you get hooked, say goodbye to your free time.\r\n\r\nCompanions are actually interesting. Nick Valentine and Piper alone make the game worth playing.\r\n\r\n❌ Cons:\r\n\r\nDialogue system is weak. Compared to New Vegas, choices feel limited.\r\n\r\nBugs and glitches. It’s a Bethesda game—expect some weird (and sometimes hilarious) issues.\r\n\r\nRPG mechanics are simplified. It leans more into action than deep roleplaying.\r\n\r\nOverall, Fallout 4 is a great game if you enjoy exploration, combat, and world-building. The story may not be the strongest, but the journey makes up for it. If you're on the fence, grab it on sale—and mod the hell out of it.\r\n\r\n⭐ 9/10 - War never changes, but my sleep schedule sure did.", 0.5867098569869995], ["I played the snot out of Fallout 3/NV, and have beaten 1 and 2.  I did not enjoy this.  The game interface just felt really convoluted and I despised the settlement building.  The armor system felt like it needed a complete UI overhaul.  I did not have fun, and getting a set of power armor and minigun and facing off against a deathclaw in the first mission was...dumb.  Oh, and I encountered multiple major graphical glitches in less than 4 hours of playtime.", 0.5546987652778625], ["In it's vanilla form this is one of the best games I've ever played. I've played this on multiple platforms and IMO this should be the model for similar game for decades. \n\nWhat really makes it though is the MODS MODS MODS! The modding community for this game, and most Bethesda games in general, is amazing.", 0.5476171374320984], ["a really fun base/city building game with some minor story, action and rpg", 0.5399558544158936], ["best.......game......ever.......i miss games like this, all we get now is some under developed, half planned games with no story and growth, just what crap can we throw out that will make a quick buck!", 0.5889423489570618], ["Bethesda left this game in its rearview mirror to work on other projects for years. All of a sudden they hear about a fan project that's looking to mod in a whole area with fleshed out quests, monsters, NPCs, and things for free. What does Bethesda decide to do? Update the game \"for the next-gen\" immediately to try and kill the mod.\n\nSame thing with Skyblivion. Massive fan project to give players something carefully crafted with love, and what does Bethesda feel the need to do? They return to a game they hadn't touched in nearly 20yrs JUST to make sure they can make a buck off the remake, spitting in the face of the Skyblivion mod team. \n\nThese cretins will not touch a game without profit incentive. They will not finish the game either, as you can see from the hundreds of negative comments already posted here.", 0.5355191230773926], ["So many gooner mods lmao but besides that the game is still great pick it up on sale. I’m still hating Sean to this day! 8/10", 0.5282145738601685], ["It's beyond boring, the skill system sucks it's basically \"choose this to do 5% more damage\" instead of the more creative perks from 3 and NV. The characters are boring and this game is nothing more than a looter shooter", 0.5246800780296326], ["Greatest fallout game in my opinion first one i started on and was the best so far i have played all the other games but they just dont feel the same", 0.523809552192688], ["288 hours and still haven't finished it. Got it on Xbox then on PC and still haven't finished it. Got every DLC and STILL HAVNT FINISHED IT. This game is worth it, a buggy but fun mess.", 0.523809552192688], ["After spending around 120 hours in the wasteland, Fallout 4 still feels like an unforgettable dive into a raw, post-apocalyptic adventure. The open world brims with intricate details and endless choices that shape your story, even when the occasional glitch reminds you it’s a work in progress. Every journey, every encounter, and every hidden secret makes the hours fly by. It's a rugged, immersive experience that still commands respect and keeps you coming back.", 0.5116039514541626], ["Fun at first but honestly the world looks very bleak (which is fitting for a post-apocalyptic setting) and the gameplay gets kind of boring after a while. I liked Cyberpunk 2077 more", 0.5088967680931091], ["its a really fun game you can get lost in mentally and physically lol i get lost a lot", 0.5065789818763733], ["Runs terrible and the load times are atrocious (especially on \"fetch quests\"....)\r\nBut it has the baddie Paladin Danse so it's okay I guess! :0", 0.5060951113700867], ["This goes for every single Bethesda game (only half for Doom because there are no bad bugs) There should be 0 tolerance from anyone that any Triple A game company can not only release but have a game be out for 10 years be this riddled with game breaking and unavoidable bugs and crashes to where you need to download hundreds of mods just to even make the game playable for more than 10 minutes. Also you need to have a separate account from steam to even play their games which comes with more unavoidable bugs that cannot be fixed with mods being progress not being  saved and most importantly achievements being bugged so its literally impossible to get someone if they didn't move to steam properly. Insane to me how these games are so positively revived yet only being able to play after spending $20 and 10 hours babysitting the developers and fixing their game for them. I believe bethesda is the worst gaming developers even worse than EA because atleast you can actually load their games.", 0.502196192741394], ["Easily one of the best games ive played. The base game has so much content and the dlc adds so much more. Dont forget the endless mods that are free to download. The story is fine as long as you dont compare it to games like rdr2. Graphics are in my opinion fine in 2025. The gameplay is like a better version of the older fallout games but i hate how they removed features like karma and weapon durability. Gunplay is a big step up with features like equipping grenades with main weapon. The game feels more polished and more modern. Crafting, modding and settlements is really good and adds another 100 hours to your game. I wish however for the next fallout game that they make the game feel less one dimentional and maybe add veichles which i by the way not understand att all why it hasnt appeared in previous titles. Proning, Tactical reloading, ledge grabbing and mantling, Better water physics and swimming animations, enemy stealth takedowns like in far cry, and more explorable buildings, actually flying vertibirds yourself instead of a slower fast travel with a minigun, More control as a high ranking faction member. there is a ton of potential for fallout 4 which modders help with but i still feel like bethesda needs to implement new feautures like these instead of just slightly improving graphics like they did with fallout 76.", 0.5], ["Very fun! You can keep playing as long as you want!\r\nThere's a mod community that helps with the small performance issues you may run into but other than that I'd say its a good game.", 0.5], ["Absolutely love this game. It has its flaws, but there is just so much to do in this game. The gameplay is fun, the power armor is just awesome, weapon customization is great, base building is fun, and the game's just got this special charm to it. \n\nNot to even mention the thousands of mods that make the game even better. This game is really a PC game staple imo.\nLove Fallout to bits and pieces... remaster the old ones now!", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/377160/header.jpg?t=1726758475", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/377160/capsule_231x87.jpg?t=1726758475", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/377160/capsule_184x69.jpg?t=1726758475"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.fallout4.com"}, "developer": "Bethesda Game Studios", "owners": "10,000,000 .. 20,000,000", "tags": ["Open World", "Post-apocalyptic", "Singleplayer", "Exploration", "RPG", "Adventure", "Atmospheric", "Shooter", "First-Person", "Story Rich", "Action", "Sci-fi", "FPS", "Action RPG", "Sandbox", "Great Soundtrack", "Survival", "Third Person", "Third-Person Shooter", "Character Customization"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Polish", " Portuguese - Brazil", " Russian", " Traditional Chinese", " Japanese"], "concurrent_plays": 15164, "number_of_achievements": 84, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["RPG"], "short_description": "Bethesda Game Studios, the award-winning creators of Fallout 3 and The Elder Scrolls V: Skyrim, welcome you to the world of Fallout 4 – their most ambitious game ever, and the next generation of open-world gaming.", "long_description": null}