{"name": "Dead by Daylight", "app_id": "381210", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£14.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 175218, "negative_reviews": 42154, "reviews": [["[h2]I'm writing this review not to criticise the game's mechanics or bugs, but rather to speak about the community. Sadly, my experience with it has reached a point where I can no longer recommend the game. Here's why:[/h2]\n\nRecently, I played a match as killer. I was up against a premade with both console and PC players. I’ll admit, I let my ego take over and played a sweaty match. In the end, I got a clean 4K, and not a single gen was completed. But I didn’t tunnel or camp. I played fair, took chases as they came, and didn’t give them much room to breathe.\n\nAfter the game, I found out one of the survivors was a small Twitch streamer. So I thought I’d check her out, curious to see the match from her POV.\n\nWhat I found was disheartening...\n\nThe two PC players were in her live chat insulting her, saying she was terrible and shouldn't be streaming at all. But in truth, she and her friend (the other console player) actually performed better than the ones throwing insults. she gave me more of a chase, lasted longer, and were clearly putting effort into the match. But they treated her horribly.\n\nI felt bad after that, so I followed her channel and joined the live chat. I let her know that I was the killer in that game and said sorry if I played a bit too hard. To my surprise, she was really friendly and thanked me for the match. She said she had fun, and you could tell she meant it. She had such a kind and cheerful vibe, and even though she lost, she stayed positive.\n\nWhat really got to me was how she dealt with everything. Even while they were insulting her, she stayed calm, kind, and kept a positive attitude. She didn’t get angry or fight back. You could tell she was just trying to have fun and enjoy the game with her friend. She didn’t deserve to be treated like that at all.\n\nIt was honestly upsetting to see. She seemed like a young scouse girl, maybe 16 or 17 years old, just streaming for a bit of fun. She only had 39 followers and two people watching, and yet even in that small space, she was getting hate for no good reason. It felt really unfair, and it stuck with me.\n\nI take full responsibility for playing a tough match. But I didn’t tunnel. I didn’t camp. I played as fairly as I could. What wasn’t fair was the way she was treated by those PC players.\n\nI’ve been playing Dead by Daylight since it first came out. My Steam profile only shows 69 hours, but I’ve spent a lot more time on console. Over the years, I’ve seen both the good and bad sides of the community. There have been some really nice, positive moments. But there have also been times like this, where someone kind ends up getting hurt for no real reason.\n\nIf you’re going to play, it’s best to team up with friends. But if you’re playing alone, just be careful out there.", 0.8198419213294983], ["Genuinely impressive this game has survived for a decade on just generators, pallets and windows while developing the most toxic and sad community in gaming.", 0.8150039315223694], ["So... in the last two years, I have spent nearly 900 hours in Dead by Daylight. That's 37 days of my life. Several full Netflix series binges. A small vacation. Time I could have spent learning another language, mastering an instrument or re-learning the violin, or even developing meaningful human relationships. Instead, I chose to run in circles around pallets while being tunneled by 14-year-olds.\n\nWhy? Because I stream, and apparently, some people in my chat would like to see me suffer. This game is like a toxic ex. You know it's bad for you. Your friends tell you it's bad for you. But then the matchmaking ends, and suddenly you're back in the fog, crouching inside a bush while a Huntress moonwalks past me, like the ghost of Michael Jackson possessing a lag switch.\n\nFantastic idea to add Ken, by the way. Being bitten through walls is brilliant! He really likes the crunch of it all. The amount of times I run into bugs has definitely decreased over these past two years, too. I'm never randomly unable to use one of my perks or stuck in one animation for no reason whatsoever (that's sarcasm). Once, a hacker floated away with me like on a hot air balloon. I guess that counts as exciting and new.\n\nI also love getting toxic messages in the endgame chat, especially in a language I, and many others, don't speak. Get everyone as a killer? Tryhard. Get looped? GG ez. Teammate doesn't unhook you? That's just your average Feng. Just a few days ago, my teammate left me at the altar and got replaced by a bot, who then promptly decided to teabag in front of me and run off without healing me. I think they've done a pretty good job so far in recreating the average DBD player.\n\nAnd yet, here I am, playing this game with my trusty +1 that got me into this mess in the first place. At least he makes up for his sins by dying on hook for me. And sometimes, just sometimes, we even get a cool match, where Wesker stays with me in bed in Ormond, or we gather by the fireplace and do a little dance to appease the entity. Or survivors don't try to flashbang me every five seconds.\n\nWould I recommend this game?\nNo.\nWill I play another 100 hours?\nYes.\nDo I need help?\nPlease.\n\nThanks for coming this far. You'll see me in the queue in 7 minutes.", 0.6548749208450317], ["I enjoy playing this game and I'm satisfied with the huge variety of skins of survivors and killers The graphics are awesome and provide smooth gameplay throughout the game and I could easily say that it is successful in reflecting the atmosphere. But there isn't anything new in terms of gameplay. Instead, errors are getting frequent; the new killer Kaneki, is way too powerful to hunt survivors. Even the worst Kaneki player could kill a survivor easily. There should be some kind of disadvantage. He is able to go faster using his kagune and that's ok, but its' frequency/waiting time should be longer since survivors already can't run as fast as killers (yeah, without kagune) and he could bite survivors easily and that's also ok, but he shouldn't be able to bite from that far...Besides this certain killer, recently added latest survivors are also a bit problematic: Their perks are way too useless to make them worth buying. If you want players to buy some kind of new survivor, at least make their perks worth buying. Not just their physical and skin look. (I have nothing to say about their physical look and their skin, they look sickly awesome) Other than that, please don't misunderstand. I really enjoy playing this game with my friends but the base game itself is still open for development and there are lots of stuff to fix.", 0.6399337649345398], ["this game is like a toxic relationship i keep coming back and getting hurt but i cant get enough of it", 0.6350365281105042], ["An absolutely godawful, unbalanced mess that gets worse with each update and added killers. The game blatantly favors the killer by buffing all of their perks while nerfing all of the survivors perks. Though the worst part by is that there is absolutely no punishment for exclusively going after one survivor while deliberately ignoring the others (Tunneling). The player base on both the survivor and killer side are completely toxic and generally unpleasant.\n\nEven if these issues are at some point fixed i still wouldn't recommend this game as the developers would probably find a different way to ruin it.", 0.6297599673271179], ["This game has wrecked my soul. New players beware of the harsh learning curve required to survive. This community is one of the most toxic communities ever. Give it a try tho", 0.6244205236434937], ["New killer is unbalanced as everything in this game, gg\nNew blood moon kaneki event is even worse xDDD", 0.6053029298782349], ["This game is horribly balanced due to the incompetent developers not knowing how to design fair gameplay. Kaneki is the latest example of this trend. They give him an overloaded kit that makes near impossible to outrun: 2 leaps that cover insane distance, a point-click hit-scan move that can hit through WALLS and OBJECTS and empowers you to get EVEN MORE mobility. I thought Blight was bad, but this new killer is even worse. At least with killers with high mobility like wesker, you can attempt to outplay by dodging his dash, but since BEhavior decided to give Ghoul an overloaded kit that deludes his playerbase into thinking they're good at the game. I'm just waiting till BEhavior nerfs this garbage and the Ghoul mains realize they are not good at the game and will drop Kaneki the moment more than 2 brain cells will be required to pilot him.", 0.5734888315200806], ["This game is 100% pain and 0% fun, will be replaying", 0.5708712935447693], ["Its 4am at night and I need to get this thing of my chest. I don't usually write books in my reviews but bare with me for a moment.\r\n\r\nI've played so many games with some of most toxic most hated most degenerate people in the so called \"Gaming Universe\". We know that 100% of competitive games will have built-in mechanics to make people feel emotional at times. In this case it's me playing the nurse. \r\n\r\nI also want to mention that the newly released \"Ghoul\" is not on nurse's lvl. However I do think he is more beginner friendly and stronger than the rest of the killers. Moving on.\r\n\r\nAs a p20 myers main that has quickly learned to how play the strongest killer in the game, it is verbally impossible to get away from having insults thrown at you after every post-game lobby as the nurse. Truth be told not everyone can pilot her correctly, having said that, she is still the strongest and always will be. \r\n\r\nI started playing her 24/7 since the start of the newly released \"Blood Moon\" event. Which btw is still better than the regular dbd gamemode, how do you people keep playing that all the time? w.e\r\n\r\nThe purpose of me busting out the nurse every game is to make sure I speedrun my way to prestige 1 on all of my characters. By \"speedrunning\" I DO NOT mean tunneling. Like it or not I am always playing for 4 kills. Having said that if you blind me 3 times in a row, then I have an excuse. ALSO why are we making up words to sh*t on killers? \"restarted slugger\" \"cringe slugging tw*t\". Is a killer supposed to ignore the two flashlight holding survivors (with sprint burst) that are waiting for you to pick up the downed survivor, instead of going for them directly? Like what are we even doing? Yeah let me just pretend you're not there, lol.\r\n\r\nEnough yapping from my side. Why am I even typing this in the first place? To tell you that these people not only privately insult me on my only social media platform, they also find out who my family members are and harass them too. Like how terrible of a person do you have to be? \r\n\r\nWill happily stay away from this community for a while. Game itself as a killer is fine, solo queue as a survivor is mental torture. 4/10", 0.5697017312049866], ["its good, but its ass, it will eat ur mentalhealth and it is highly addictive. 10/10", 0.568965494632721], ["It seems the developers don't play their own game any longer to know what's good for it, nor able to listen to those who still care...", 0.5668767094612122], ["Dead by Daylight is a textbook example of how to ruin a game with massive potential by leaning fully into FOMO-driven monetization. Everything revolves around time-limited events, battle passes, and endless cosmetics. You’re constantly pushed to log in “right now” or risk missing out — and the devs know it. Fixing bugs? Balancing perks? Improving matchmaking? Nah. Better to drop another skin.\n\nAnd that matchmaking? Pure chaos. As killer, you often get thrown against full SWF sweat squads while you're running beginner perks. Playing survivor? Either you get a coordinated team — or three randoms who think the game is a bunny skin fashion show.\n\nThe community is unbelievably toxic. Play killer fairly? You'll get teabagged at every pallet. Play seriously? Suddenly you’re a “dirty camper” and you’ve got hate messages in your inbox like you just committed a war crime. And solo queue as survivor? Actual hell. Half your teammates can’t hit skill checks if their life depended on it, crouch in corners the whole match, and ignore hook rescues because they’re too busy looting chests. No communication, no coordination — and if you somehow manage to survive, you’ll still get blamed in endgame chat for “not helping the team.” You just can’t win, no matter who you play.\n\nDead by Daylight isn’t a horror game — it’s a stress simulator with a horror skin. And as long as monetization is prioritized over actual gameplay quality, nothing’s going to change.\nRecommended only for masochists and those who enjoy being constantly disappointed.", 0.5656625032424927], ["Just stay away from this dog shit game. Killers just gonna hit you through walls with power and Behavior dog ass wont fix cause \"oh mr kenkai lemme suck ur dick mr tokyo ghoul fandom.\"\n", 0.5652778744697571], ["Im tired of this game. Every new patch the killer is always broken. Why do PTB even exist then??? Not only does he CONSISTENTLY get hits like this with no LOS and zero wind-up (the mouth icon appeared on my body AFTER the hit already registered) But he can even hit you through vaults and pallets you have cleared by several feet while he is still on the other side of it. If this is a projectile attack, make it actually look like one and give it a wind-up so survivors don’t feel constantly cheated playing against him. If it’s not, then these hitboxes need to GO.\r\nBut noy only that... the weird portion of the community that only want to ruin the experience for others and that strong killers and coordinated SWF will always ruin perks and mechanics for everyone else. as long as the top 10% exists, the game will never feel balanced for the rest of the population.", 0.5546558499336243], ["Dead by Daylight is an absolute disaster. The matchmaking is a joke, putting you in games with people who are way better or worse than you, making everything feel unfair. The servers are trash constant lag, crashes, and disconnects make the game nearly unplayable. The devs only care about adding overpriced skins instead of fixing the broken perks, bugs, and major balance issues that make the game frustrating. The community is toxic, and the devs don’t seem to do anything about it. The game is a mess, and it’s clear they don’t give a damn about improving it.", 0.5487076044082642], ["Addicting, toxic, extremly questionable developers, amazing core game design but so many terrible game design choices ontop of it and predatory marketing. However, pretty fun, especially with friends. Hating dbd is a core part of playing dbd. it is what it is.", 0.5484889149665833], ["this game only have bugs, bad hitbox and false situations. I HATE IT!\nsometimes is funny", 0.547407865524292], ["dbd does this weird thing where it makes you think you like it, but really it's ass and it makes you want to pull your hair out and scratch your skin off. it's because the idea of the game is cool, and you want to like the game, but it's just so, so, so poorly executed. i get it. i was there too. i wanted to like the game. but here i am now. i regret 95% of my playtime in this game.\n\ndon't make the same mistake i did", 0.5438361167907715]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/381210/header.jpg?t=1744310903", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/381210/capsule_231x87.jpg?t=1744310903", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/381210/capsule_184x69.jpg?t=1744310903"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.deadbydaylight.com"}, "developer": "Behaviour Interactive Inc.", "owners": "20,000,000 .. 50,000,000", "tags": ["Horror", "Multiplayer", "Survival Horror", "Online Co-Op", "Co-op", "Survival", "Gore", "Team-Based", "Blood", "Third Person", "Stealth", "Violent", "First-Person", "Psychological Horror", "Action", "Atmospheric", "Strategy", "Comedy", "Mature", "Difficult"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Russian", " Simplified Chinese", " Portuguese - Brazil", " Thai", " Traditional Chinese", " Japanese", " Korean", " Polish", " Spanish - Latin America", " Turkish"], "concurrent_plays": 57151, "number_of_achievements": 273, "categories": ["Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action"], "short_description": "Trapped forever in a realm of eldritch evil where even death is not an escape, four determined Survivors face a bloodthirsty Killer in a vicious game of nerve and wits. Pick a side and step into a world of tension and terror with horror gaming's best asymmetrical multiplayer.", "long_description": null}