{"name": "Rise of the Tomb Raider™", "app_id": 391220, "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£24.99", "final_price": "£3.74", "discount_percent": 85, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 25353, "negative_reviews": 2075, "reviews": [["Okay so first thing first... I'm totally biased towards the game, the \"Tomb Raider\" series has to be my favourite game series of all time. So we will talk about the pros first and of course there are few cons too, just one or two.\n\nPROS: This game's atmosphere is stunning you know things are serious when everything is dark and serious kind of tone. The world building is amazing, when the game starts we are in Syria exploring a tomb which was perfect and then the snowy mountains where it became even better, the swimming into shallow waters and drowning the enemy was perfect. The gun-play became more better and the tomb puzzles became even tougher and the puzzles were very well curated, this time the dev's gave us more freedom with the weapons customization, the weapon upgrade system and the crafting was well detailed. The combat was engaging and the side characters were fascinating, the voice acting was fabulous and the cinematic cut-scenes were amazing because the graphics was better in this game compared to the last one. The story is also very well written and the progression feels smoother and not rushed. The villain in this game had a better story and background and felt stronger compared to the last one who was just a \"cultist\". Overall the game was fantastic and so enjoyable you would love every moment in the game because the world is so gorgeous it's worth exploring. And the dlc \"Baba Yaga\" was a chef's kiss, perfect dlc. \n\nCONS: Last game \"Tomb Raider 2013\" you would have instantly felt an attachment toward Lara and would enjoy the emotions the character brings forward but in this game, I've played more than 40 hrs and still didn't feel the same attachment towards the character as I felt instantly in the previous game.. now that maybe subjective, but while everything around Lara changed and became more better and compelling she on the other hand remained same,, there was no character growth overall. What actually happened was that she lost more of her emotions, like in first game Lara cried, showed frustration which made her character show more depth but in this game it's very shallow, maybe because she became more strong with time, with the losses she overcame but seeing Lara all serious and show so little emotions just didn't feel right. Now this is all subjective and maybe it's all in my head but yeah that was all. \nGreat game 10/10.", 0.7871782183647156], ["---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☑ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☑ One and done\n☑ Maybe after a year\n☐ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☐ None\n☑ Only cosmetics\n☐ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☑ 8\n☐ 9\n☐ 10", 0.5774679183959961], ["I wish there was something in between thumbs up and thumbs down. This game has some good points to it but it's downfall are the semi-open world areas. They are too big and aren't really full of anything interesting. The cutscenes are long and the trinity leader's voice acting is terrible. \n\nIn addition, there are some late game enemies that should be far more difficult than anything you've faced before based on the lore of the game......Well, they aren't. \n\nThe shop is dumb, too. I have no idea why that was shoehorned into the game, as if some enemy guy would setup a shop to sell things to the random locals who found him... and somehow he only takes payment in ancient coins. Stupid.\n\nAlso the side missions suck.\n\nGame looks great and the mechanics are good, i just can't recommend it cause it's not really fun at times.", 0.5640084743499756], ["Pretty good. Plays nice, and it's not bloated. Very reasonable length, it's focused and it delivers. Graphically it shows that it's not the newest game but gameplay-wise it's really good.", 0.523809552192688], ["Nothing more to say other then I love this game. The story is better then the last and the visuals are amazing.", 0.5135135054588318], ["It's good storywise, game mechanics are also good but there are bugs in some puzzle areas. I've lost my mind spending hours for buggy puzzles, can't keep it up more.", 0.5], ["kinda average at everything it do but still very fun gameplay", 0.5], ["amazing graphics, amazing story and amazing details in the game. Can not wait to finish it!!", 0.5], ["Yes Indeed, I DEFINITELY RECOMMEND this Game!!\r\nI bought all (3) Games On Sale, but I'm Playing them 'Out of Order' : I started with Shadow of the Tomb Raider, then moved onto Tomb Raider & now finally I'm playing 'Rise of the Tomb Raider'. This game is Action packed & Thrilling as the other (2) with a Rich backstory!!\r\n", 0.5], ["great game and was honeslty a great  upgrade from the first one in everything. Some of it was pretty cluncky but other than that it was a enjoyable and I will do everything at some point lol.", 0.5], ["8/10\nGreat game, good story and it's got Lara...what's not to like.\nNOT recommended for the Steam Deck, this game's visual style and graphics need a proper monitor or a TV screen to come to life. \n\nI played at 45 FPS on Steam Deck which was easily is achievable by tinkering a few graphical settings.", 0.5], ["um jogo sólido, uma continuação digna para o remake de 2013 mas também nada muito excepcional, especial ou algum  tipo de destaque.", 0.5], ["Really good game. \r\nPlayed on hardest and the only difference I notice is how annoying it is to be back in campfire every time you die", 0.5], ["Rise of the Tomb Raider is an amazing game, best of the franchsie with thrilling experience, story, puzzles, visuals, it has everything. It's a must play for sure !", 0.5], ["Great game, as good as I remember.  Replaying it on the steam deck.", 0.5], ["Great game! I really liked the gameplay, the graphics and the story. I instantly wishlisted Shadow of the Tomb Raider after finishing this.", 0.5], ["Rise of the Tomb Raider is a confident and refined sequel that builds on the reboot’s foundation while reintroducing more of the series’ classic exploration and tomb raiding. With deeper mechanics, larger hub areas, and a more balanced tone, it’s arguably the best entry in the modern trilogy.\n\nPros:\n\nLara’s growth: Lara is no longer just surviving—she’s becoming the Tomb Raider. Her character is more confident and capable, yet still human. The story explores her obsession with legacy and truth in a believable way.\n\nSemi-open world design: Large hub areas encourage exploration, with optional tombs, puzzles, hidden relics, challenges, and side quests. It feels much more like a “real” archaeological adventure.\n\nBeautiful visuals and atmosphere: From snowy Siberian peaks to underground ruins, the environments are diverse and stunning. Weather effects and lighting create a strong sense of place.\n\nImproved tombs and puzzles: Optional challenge tombs are more frequent and better designed than in the 2013 game. They feel clever and rewarding.\n\nSolid gameplay variety: Stealth, combat, traversal, crafting, and survival blend together smoothly. There’s a lot of freedom in how you approach situations.\n\nUpgrades and gear progression: Skill trees, weapons, outfits, and resource crafting offer more depth and customization than before.\n\nCons:\n\nStory still plays it safe: While better than in the first game, the main plot follows familiar beats (ancient artifact, secret cult, family drama). It’s serviceable, but not groundbreaking.\n\nCombat pacing: Combat is generally well-executed, but some encounters feel a bit too game-y or repetitive in later sections.\n\nSide content can feel checklist-y: Some of the collectibles and challenges start to blur together if you're going for 100%.\n\nConclusion:\n\nRise of the Tomb Raider strikes an excellent balance between cinematic storytelling and gameplay freedom. It refines nearly every aspect of the reboot and adds more meaningful exploration, making it feel like a true evolution of the franchise. For fans of adventure, mystery, and exploration, it’s a must-play.", 0.5], ["Always have been fan of the franchise, great game - always seen as \"like uncharted\" but I like to think that it is almost at the same level as the uncharted series and has its own personality as a franchise", 0.5], ["Don't know why took me this long to play the game. Have only completed 15% so far but it is so thrilling! Loved every second of it!", 0.5], ["amazing gameplay and story . puzzles and mechanics are gripping too", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/391220/header.jpg?t=1729011444", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/391220/capsule_231x87.jpg?t=1729011444", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/391220/capsule_184x69.jpg?t=1729011444"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.tombraider.com/us/"}, "developer": "Crystal Dynamics, Eidos-Montréal, Feral Interactive (Mac), Feral Interactive (Linux), Nixxes", "owners": "5,000,000 .. 10,000,000", "tags": ["Adventure", "Action", "Female Protagonist", "Singleplayer", "Third Person", "Exploration", "Open World", "Action-Adventure", "Story Rich", "Survival", "Puzzle", "Stealth", "Atmospheric", "Third-Person Shooter", "Parkour", "Shooter", "RPG", "Multiplayer", "Great Soundtrack", "Quick-Time Events"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Dutch", " Polish", " Portuguese - Brazil", " Russian", " Japanese", " Simplified Chinese", " Traditional Chinese", " Korean", " Arabic"], "concurrent_plays": 2157, "number_of_achievements": 143, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Tracked Controller Support", "VR Supported", "Steam Trading Cards", "Steam Cloud", "Steam Leaderboards", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "Rise of the Tomb Raider: 20 Year Celebration includes the base game and Season Pass featuring all-new content. Explore Croft Manor in the new “Blood Ties” story, then defend it against a zombie invasion in “Lara’s Nightmare”.", "long_description": null}