{"name": "Call of Duty®: Modern Warfare® Remastered (2017)", "app_id": 393080, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£34.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 4, "review_decription": "Mostly Negative", "positive_reviews": 2278, "negative_reviews": 3498, "reviews": [["Have to reconfigure the in game settings by booting your PC in safe mode, just to get it to launch..\nLoad times are minutes long..\nWon't even load a level passed Charlie don't surf..\n\nEight years on the store and it still doesn't work", 0.6422921419143677], ["My perspective and review for this game won't be a CRAZY in-depth or complex review this time. But anyways, THIS title is without a doubt, definitely and personally one of my FAVORITE and most CHERISHED video games, of all time. (As with tens of millions of others I bet) This game in particular, I cherish very closely similar to its original. (nearly two decades ago now, in 2007) Call of Duty 4: Modern Warfare in 2007 obviously and factually set a new revolutionary standard for both the FPS genre and online multiplayer industry simultaneously. Also, the notable Call of Duty titles ranging from 2005-2015, had taught me a multitude of things I went on to understand and develop decades later, and even still utilize today, to a degree. Now, I won't be nerding out any further on the MEMORABLE, and ICONIC campaign/multiplayer, as it's unfortunately redundant in this case, sorry. (As much as I'd typically love to) Fortunately, Modern Warfare: Remastered ran nearly PERFECTLY fine for me. However, I had eventually experienced a somewhat of a known bug within THIS version of the game, so I had disabled the \"shader pre-load\" option. Oh, and HEY! DON'T give your money to Activision, UNLESS the game's are on SALE, which they ALL do go on occasionally but MOSTLY periodically! (Selective holidays, Steam sales, or events, etc.) Lastly, I love this game and it breaks the tens of millions of us that we may never live the moments of playing our FAVORITE Call of Duty titles in their prime again. ANYHOW, remain vigilant when dealing with ANY older Call of Duty titles multiplayer such as this. Enjoy the campaign and timeless classic of a game, cheers! \n\n10/10 - RoniiBoi", 0.5935748219490051], ["I think this is a good remaster But i recomend turning shader preload OFF in the advanced video options i think it makes the game Crash less and the game looks Amazing note. There is a hidden Desert Eagle in the First Level", 0.5384314060211182], ["My playtime speaks differently to the verdict given by this review, but unfortunately something has changed that has also changed my stance on this game. I used to be able to run the game just fine, but for some reason it stopped working today and will no longer start properly, even though the game was running fine just the day prior. It boggles my mind how Activision, with all their resources, can't properly optimize a game to work. A shame too, as this was one of my favorite ways to play the original Modern Warfare campaign. Hopefully this is somehow fixed soon, whether by a dedicated fan who has more time on their hands or more unlikely, Activision themselves.", 0.5277303457260132], ["The worst call of duty i ever played i couldn't complete the campaing cuz it was crashing on a fucking loading screen do not buy it is not worth it", 0.523809552192688], ["The remaster looks and feels great—classic campaign, upgraded visuals, and tight gameplay. But the experience is dragged down by serious technical issues.\n\nCampaign missions take forever to load, killing the momentum. Even worse, multiplayer often won’t load shaders, making it completely unplayable for many. For a remaster of such a legendary game, these problems are hard to ignore.", 0.5222607254981995], ["Game looks good as a remaster. Nostalgia made me complete it on veteran.\r\n\r\nUnfortunately i cannot recommend this game due to a video memory bug where the game wont launch. Had to do my own research and use a random file downloaded from the internet could fix it.\r\n\r\nThen on the second to last mission another video memory bug which caused the game to keep crashing until caching shadow maps was disabled.\r\n\r\nHow can a million dollar company leave these bugs in their game....\r\n\r\n8/10 if you're willing to overlook these bugs. Otherwise I wouldn't buy.", 0.5205128192901611], ["game wont even launch. googled all possible fixes and no resolve. waste of money just to relive old times.", 0.5078979134559631], ["Completed 24 April, 2025\r\n\r\nAt first I only picked up this game for the nostalgia, I remember back when one of my friends recommended me the original modern warfare 2 and that's how I got into call of duty in the first place. Usually most games when they try to make graphics look \"good\" loose their personality, like how everything from modern warfare 2019 to black ops 6 looks almost the same, meanwhile when you compare the older games like modern warfare 2 to black ops 3 it looks and feels so much more different than the more recent titles, this game however manages to visually look great and not loose its personality. I lowkey forgot how short the story is, the game had me so hooked it kinda didn't matter how short it was. Glad I got back to this game after so many years.\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☑ Short\r\n☐ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10", 0.5], ["Sound design blows chunks. you can't hear dogs until they are inside your bum, you can't hear footsteps of enemies, you can't hear a helicopter while its 20 feet away. The definitive deaf person experience.", 0.5], ["the game has good story design, good character design, good design in general, what the hell happened to call of duty? this original story and series with the original team was so awesome, now, the original team is gone, we have DEI and LGBT bullshit taking over the game studios and now the new games suck and arent as cool, old games are the best", 0.4870014786720276], ["Technical Nightmare. Can't reccomend. Just play the original.\n", 0.5307167172431946], ["The lighting/shadows show as glitches. It was unplayable and I know they are not going to fix it. \nGPU: RX 9070 XT\nCPU: AMD 9800 X3D", 0.5787110924720764], ["Just the right amount of gore. Plenty of weapons. Like the spawning. Good stress reliever.\r\n", 0.5], ["Um clássico, um dos melhores cod's já feitos, tanto em campanha quanto em multiplayer, uma pena que esse remaster na época foi só pra tampar o buraco dá mal recepção do Infinite Warfare e acabou sendo meio negativo pra ele, mas mesmo assim é um excelente remastered, espero que um dia lance o mw2 Remastered na Steam tbm!", 0.5], ["If you're coming to the review section and curious if the Crashing Problems have been resolved as of April 15th, 2025, the answer is no. I can't even load into the third mission without GPU drivers failing. This is shamelessly poor quality from a AAA company and Steam should be refunding.", 0.6369130611419678], ["not worth the nostalgia, maybe if it was a lot cheaper", 0.5252419710159302], ["Amazing as always. There were few spots that I thougth I could not pass as \"Charlie don't surf\", \"Hunted\", \"One shot, one kill\", \"Heat\", \"No fighting in the war room\", and \"Mile high club\", but these spots turned out to be a lot easier when one remains calm has the persevierance to push trough a couple of savespots with some cheese involved. \r\nAfter I got 50/50 it all seemed easier than when I faced it. Loved the experience, loved the game, now and then.\r\nHave to leave a like.", 0.5], ["great pickup if you can catch it on sale for 20 or under", 0.5], ["Obviously Modern Warfare is a cinematic masterpiece and singlehandedly spawned some of the best shooters of all time that being said the game wears its age the flinch when you get shot is crazy and the gun sights are a bit iffy especially the holo sight all of this was improved in the sequels but thats not why i give this a thumbs down cos for 2007 this game plays brilliantly compared to other unwieldy shooters of the era like medal of honour and homefront. I give this a negative cos it runs like garbage its not even worth trying to explain why its just awful requiring safe mode and to diasable shader loading not to mention its making my gpu cry despite being on medium settings, while it looks pretty just play the original one id bet that runs better or play this on a console i had 0 issues on Xbox 8 or so years ago. the multiplayer is bad as well even when it came out it was bad.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/393080/header.jpg?t=1678298772", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/393080/capsule_231x87.jpg?t=1678298772", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/393080/capsule_184x69.jpg?t=1678298772"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.callofduty.com/modern-warfare-remastered"}, "developer": "Raven Software, Beenox", "owners": "500,000 .. 1,000,000", "tags": ["FPS", "Singleplayer", "Shooter", "Action", "Multiplayer", "War", "Military", "First-Person", "Controller", "Violent", "Story Rich", "Remake", "Co-op", "Classic", "Stealth", "Gore", "Casual", "World War II", "Zombies", "Atmospheric"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 116, "number_of_achievements": 50, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Family Sharing"], "genres": ["Action"], "short_description": "One of the most critically-acclaimed games in history, Call of Duty: Modern Warfare is back, remastered in true high-definition, featuring improved textures, physically based rendering, high-dynamic range lighting and much more.", "long_description": null}