{"name": "Garry's Mod", "app_id": "4000", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£6.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 480113, "negative_reviews": 14740, "reviews": [["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☑ Don‘t look too long at it\n☐ Bad\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\nLike to pet the cat\n　　　　　 　____\n　　　　　／＞　　フ\n　　　　　| 　_　 _ l\n　 　　　／` ミ＿^ノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿ヽ)__) __)\n　＼二つ\n", 0.8580647706985474], ["Only limited by your imagination.\n\nBeen playing this game since 2015, you do everything from playing prop hunt with friends to playing as a Detective in 1980s New York.\n\nAnd if something does not exist in Gmod, you can make it yourself.", 0.7314411401748657], ["Garry’s Mod is the game that answers the question: What if you could play with absolutely everything and completely ruin it for everyone else?\n\nImagine a world where you can build things, break things, and make even the simplest of tasks somehow end in disaster. Want to build a car? Great! Now, let's launch it into space by accident! Think you can create an epic roller coaster? Nope, it’s now a death trap that’s definitely not OSHA-approved.\n\nThe physics engine is a glorious mess—characters' limbs defy the laws of physics, and objects will float, bounce, or explode with no warning whatsoever. The AI? If you want to see your NPCs walk into walls or perform complex dances of incompetence, Garry’s Mod has you covered.\n\nAnd don't even get me started on multiplayer. Sure, you can try to work together with friends on building something cool, but you’ll inevitably spend hours messing around with each other’s creations. That one friend who decides to fill an entire map with explosive barrels? Yeah, that’s probably you.\n\nGarry’s Mod is the epitome of chaos and creativity. If you’ve ever wondered, What happens if I put a tank on top of a flying car? then this game will answer that question for you… and probably destroy your PC in the process.\n\n10/10, would accidentally break everything again.", 0.6808072328567505], ["Finally got the game and the first thing i did was make a shlong out of barrels and swing it around", 0.5833333134651184], ["One of the best games ive ever played, you can play forever without getting bored.", 0.5652173757553101], ["I have like 90 counts of Griefing, Minging, RDM, Prop block, and Prop kill...\nStill my favourite game to play, mainly due to the interactions I have with people.\n\n10/10", 0.6150320768356323], ["such a fun sandbox game you can download a lot of mods and it just fun", 0.523809552192688], ["After years and years of being out, this is still one of the best games ever to exist", 0.523809552192688], ["this game is awsom and you can play with your friends too. my favorit map in the five nights at freddys one", 0.523809552192688], ["Garry’s Mod is good for those who love the play maps/mods from workshop, and a lot of other thing u can do with this game, even messing around in this game is fun, 100% Recommended", 0.523809552192688], ["Everything an anything best game I've ever played an mods make it even more amazing", 0.523809552192688], ["Idk what to say but this game is pretty fun, the steam workshop was effectively made for this game overall W game. :steam_happy:", 0.523809552192688], ["i really got tired of playing this game but i still like its fun but somtimes i just play it for to long so i would recemnd gmod to other people out there", 0.523809552192688], ["Garry's Mod is the ultimate sandbox experience—pure, unrestricted creativity mixed with chaotic fun. With over 1000 hours in the game, I’ve seen everything from hilarious DarkRP shenanigans to mind-blowing custom game modes that push the Source engine to its limits.\n\nThe best part of Gmod is its modding community. Whether it was building on OG servers like CancerRP or running wild in TTT-Fun DarkRP, there was always something fresh to dive into. Lua scripting allowed for nearly limitless customization, making every server feel unique.\n\nOf course, Gmod isn’t without flaws. The physics can be janky, and loading into certain servers can take forever thanks to massive addon lists. But despite that, it still holds up as one of the best multiplayer sandbox games ever made.\n\nEven after 1000+ hours, it never truly gets old.", 0.52173912525177], ["I like this game so much\n\nA classic game that every generations has heard or love\n\nhope this stills", 0.5199999809265137], ["i got rapedby fnaf animatronics good  game for new born babys", 0.5185185670852661], ["Gmod sick mi bredda, pure madness an fredom. Build, mash up, do anything yuh want. Real sandbox vibes, 10/10 mi cant stop play", 0.5652173757553101], ["this is an amazing game it is such a fun sandbox game multiplayer,wepons,mods,endless fun you should buy Garry's mod if you are the type to mess around blow things up and kill npc and relax", 0.5], ["really goofy game, lots of high quality mods. my only issue is it is difficult to join a friend in game but an easy fix is right clicking their profile when in a lobby and pressing join and that will put you in their lobby, other than that i have no issues with the game.", 0.5], ["This game is dead in 2025 and beyond—don't buy it. Roleplay is cringe, filled with no-social-skills losers or RDM wannabe Bub games youtubers. If you want to suffer, just end it and let your family pay for the funeral.\r\n\r\n", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/4000/header.jpg?t=1736937068", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/4000/2e52d9b905feebfdaaf2db6ad7afece10991d504/capsule_231x87.jpg?t=1736937068", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/4000/2e52d9b905feebfdaaf2db6ad7afece10991d504/capsule_184x69.jpg?t=1736937068"}, "support": {"support_website": null, "support_email": null, "game_website": "https://gmod.facepunch.com"}, "developer": "Facepunch Studios", "owners": "20,000,000 .. 50,000,000", "tags": ["Sandbox", "Moddable", "Multiplayer", "Physics", "Building", "Casual", "Funny", "First-Person", "Singleplayer", "FPS", "Simulation", "Comedy", "Shooter", "Online Co-Op", "Co-op", "Action", "Indie", "PvP", "Realistic", "Exploration"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Bulgarian", " Czech", " Danish", " Dutch", " Finnish", " Greek", " Hungarian", " Japanese", " Korean", " Norwegian", " Polish", " Portuguese - Portugal", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Swedish", " Thai", " Traditional Chinese", " Turkish", " Ukrainian"], "concurrent_plays": 25578, "number_of_achievements": 29, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "LAN PvP", "Co-op", "Online Co-op", "LAN Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Steam Trading Cards", "Captions available", "Steam Workshop", "Steam Cloud", "Valve Anti-Cheat enabled", "Includes level editor", "Includes Source SDK", "Remote Play on Tablet", "Family Sharing"], "genres": ["Casual", "Indie", "Simulation"], "short_description": "Garry's Mod is a physics sandbox. There aren't any predefined aims or goals. We give you the tools and leave you to play.", "long_description": null}