{"name": "Stardew Valley", "app_id": "413150", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "KRW", "original_price": "", "final_price": "₩ 16,000", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 344452, "negative_reviews": 3785, "reviews": [["⭐ 10,000+ hours later... my crops are still thriving and so is my soul ⭐\n\nThere’s something magical about Stardew Valley.\n\nI bought it thinking, “Eh, I’ll play for a weekend and move on.”\nThat was 7 years ago. I now have a farm more organized than my real life, a digital wife who loves me unconditionally, and a shed filled with 300 jars of ancient fruit wine. I don't know what day of the week it is in real life, but I can tell you exactly when the traveling cart shows up in the Valley.\n\nThis game isn’t just about farming. It’s about healing.\n\nYou start in the chaos of modern life, burned out and tired. Then you inherit your grandfather’s farm and escape to the gentle rhythms of nature. The music calms you. The villagers surprise you. The world breathes with life. And before you know it, you're fishing at 2AM, debating whether to plant cauliflower or parsnips next season, and attending the Flower Dance hoping someone—anyone—will finally accept your invitation.\n\n🌾 The pixel art is charming.\n🎵 The soundtrack is soothing.\n💌 The stories are deeper than you expect.\n🎣 The content updates? FREE. And HUGE.\n🛠️ The modding community? God-tier.\n💖 ConcernedApe? A one-man miracle.\n\nThis isn’t just a game. It’s therapy. It’s a warm blanket. It’s home.\n\nIf you’re sad, anxious, tired, or just need a place to breathe—Stardew Valley will be here for you.\nRain or shine. Winter or Spring.\n\nThanks for everything, Grandpa. 🌻", 0.8490390777587891], ["I just want to share some good memories I have with this game. \nIt was 2023 when I was introduced to this game by my ex girlfriend and we played together. She hosted the game. It was honestly one of the best gaming moments for me ever, and till now I still remember all sweet things in the past: Her, the game, and playing the game with her. We were all noobies and barely know how to progress or make money, and we kept getting hungry and exhausted 🤣. After letting our crops die in summer and dying in the cave multiple times ourselves 🤣, we slowly learned how to play, making just enough to get by, upgrade tools and the farmhouse. Then we divided the roles and tasks... me being Noel the miner/fisher who did the caving and Ginger Island and her being the cutie farmer girl that she was, raising animals, harvesting crops and socializing/helping the villagers with their requests. The game was so happy, funny and relaxing. It was progressing at a steady slow pace, but that only means more quality time for us two goofballs to spend together... All the precious memories which I will hold dear in my heart forever.\nSadly, all good things come to an end. Through time, we progressed and achieved almost everything in the game, Almost. It was only an \"Almost\". We broke up, fortunately on good terms. We still talk occasionally, maybe just wanting to check out on each other. The game remains incomplete, unfinished and so does our love story. Now, everytime I just want to be reminiscing, I will play Stardew for a while...\nSometimes it's just really hard to keep yourself together when the music of this game seems to just wanting to shatter you with nostalgia..., so I pour myself a bittersweet cup of coffee, gaze through my window and think about my once dearest, most beloved/cherished girl and the first farm which we built together alongside with the memories, both of which I used to hold close to my heart, now far gone, lying beyond the horizon...", 0.8240971565246582], ["Stardew Valley is a game I always come back to. The concept is simple—taking over a farm and making it thrive, but there’s a lot of depth in how you go about it. You can farm, fish, mine, and build relationships with the townspeople, and the game gives you a lot of freedom in how to spend your time. The art is simple but nice, and the music adds to the relaxing atmosphere. That said, the time system can sometimes stress me out, especially when I’m trying to fit everything in before the day ends. Despite that, it’s easy to get lost in, and I always find myself coming back for more, whether it's to relax or work on the next big project.", 0.6824192404747009], ["This game is an incredibly relaxing and addictive game—perfect for unwinding, farming, and building your dream life in a charming little town.", 0.6453021168708801], ["One of the best games at what it does. The game is amazing and feels very welcoming on a first time playthrough and is even more fun on subsequent playthroughs. This game can offer one of the most stressful experiences with several tabs open at once, or a relaxing laid back fun little farming game depending on how you play it with no pressure for either route and I find that really valuable in a game. No play style or approach feels forced, no matter what you do, you are bound to progress but it also doesn't just hand it to you. Every single character feels real and unique, and the story is implemented so well. You can completely ignore the story and still get everything out of the game. I mean it when I say absolutely nothing feels forced aside from some fishing quests though there are some fun ways to cheese these and they're nothing intense anyway. There really is not anything negative I can say about this game except for how addicted I get to this game. The game does slow down and you lose much to do after perfection however this takes 10s-100s of hours so I find it a little silly to count it as a con, you are getting far more than you paid for at $15. Doesn't even matter if it is on sale, it is an instant buy from me.", 0.6217264533042908], ["this game will ruin your life, thanks to my addiction to this game, my GF left me, I lost my job, and I now live in an old van, selling plasma and delivering pizzas.", 0.5395303964614868], ["its really fun and addicting at first but got repetitive and boring shortly after", 0.5388026833534241], ["Stardew Valley is a farming RPG that is fun in concept, but in my experience unfortunately not in actual gameplay.\n\nThis is one of the instances where I wish I could give a mixed review, however as my experience has been more negative than positive, this will have to do.\n\nThe game is fun for the first couple of hours, but as a game mainly consisting of routine, it gets rather repetitive as time goes on. You wake up, are able to do the same three things every single day before the day is over, and then it just starts all over again.\n\nThis leads me to the point of the time management and day cycles being just short of horrible. As the days are over too quickly to get much done, the days end up being foo fast paced while the overall progress is too slow paced. It takes too long to achieve anything at all, and it’s therefore too much of a grind for me.\n\nHaving to watch the stamina bar, health bar and the time at almost all times turns a game mainly advertised as cozy into quite the stressful experience.\n\nAnother issue I personally have within the game are the eye straining graphics & coloring. I’m aware that the game has its own stylistic elements, however I can’t play the game for more than roughly two hours at a time before the headache sets in.\n\nA lot of these issues can be fixed through the use of mods, however I’m not a fan of having to use mods in order to deem a game as playable while ignoring the flawed aspects of the game.\n\nI can sort of understand how Stardew Valley might be fun and fulfilling to some, especially if they have a lot of time on their hands, but for me, the game is just too stressful and unrewarding to actually have fun.\n\nThe NPCs and the concept of the dating sim were what had initially awakened my interest in the game, and as far as the NPCs’ designs go, I can’t complain. However, all of them have fairly limited dialogue and interaction options. This gets noticeable after just a quite short time of playing and only adds onto the repetitive aspect of the game.\n\nI might pick the game up again in the future in order to try to 100% complete a farm, but that would probably take a while as I would just lose motivation over and over again.\n\nFor the price, I feel it’s worth to give Stardew Valley a try and see whether the game is suitable for you or not, however in my case, this game ended up not being as fun as advertised.", 0.5350445508956909], ["Stardew Valley has so much shit to do and is built just right where i want to min/max every second. But combine this with the stupid fast day timer, the energy mechanic, friendships (that deteriorate over time), slow movement speed, and the fucking community center, it feels like this game is made to be stressful, not relaxing (at least for me). Half of my playtime is me planning out what to do on the wiki while having the game paused. It's like a worse second life.", 0.5277145504951477], ["Very chill game which can become an adiction. My go-to chill game when I don't wan't to play FPS games.", 0.523809552192688], ["I always come back to this game and I can't wait for yet another game from ConcernedApe <3", 0.523809552192688], ["Sincerely my favorite thing ever. I played it to death on Switch, then PC, then I added a ton of mods and it feels like the first time all over again. Just an incredible piece of art with super interesting characters, a stunning art style, and the most passionate creator I've ever witnessed.\r\n\r\nI seriously love every single aspect of this game, especially the combat, which was pretty shocking to me. I typically despise combat, even when it's super easy, since I just get super stressed and upset even if I win. it never feels satisfying to me, except in Stardew. it's not super complex, but I love the amount of strategy that you can put into it, preparing foods with buffs, special weapons, or wearing better rings or boots. combat isn't even mandatory, mind you, I just find it surprisingly enjoyable.\r\n\r\nThe best part of Stardew is that it can be whatever you want. I really enjoy minmaxxing every aspect of the game (prioritizing efficiency and maximizing profit), but I've also had playthroughs where I only farm or fish or interact with characters and it's just as fun, if not more for the sake of variety. This is seriously the ideal game for perfectionists, though. The official wiki is insanely detailed and the in-game menu tabs have neatly organized collections with all the information you could want.\r\n\r\nAs someone who has over 1500 hours between PC and Switch, has beaten the game to Perfection twice, and listens to the soundtrack on a daily basis: please play this game. Once you do, please also look into the developer of the game, Eric Barone. He is my idol and I desperately need more people to know and support him. <333", 0.523809552192688], ["an immersive yet cozy game that's hard not to adore. with or without mods, there's much to see and explore. easily one of the best games to come out in the 2010s in my opinion.", 0.523809552192688], ["After 100 hours of playing together with my best friend, he divorced me and went on the next day to marry another woman and have a child with her in OUR house.\n", 0.523809552192688], ["The game drew inspiration from Terraria, and offers a farming experience, on the surface. While playing, you discover a multitude of different things you can do, that include gaining new tools, and getting to explore more and more of the game. Literally.\r\n\r\nGreat game, I would recommend. If you are a fan of a farmer turned jack of all trades, with lore sprinkled throughout the game, and hints about anything that is needed to reach 100% completion, you should enjoy this game too.", 0.523809552192688], ["I just got this game 3 days ago and have already put in many hours. The game is very enjoyable and relaxing to play. There's a ton to do in each game day and you won't feel that things are repetitive as there's always challenges to work towards. Overall great game and 10/10 recommend.", 0.523809552192688], ["I'm still at the beginning of my journey in the Valley but I already love it to bits! It's a relaxing game that really lets you immerse yourself into the world of Stardew Valley. I play it whenever I have a bit of time and my progress is slow, but it is extremely wholesome. The mods make it even better however as you can add little perks to the game and even to the characters. Stardew Valley really unwinds me whenever I feel a little bit deflated from life", 0.523809552192688], ["total playability and fullness of content", 0.523809552192688], ["super cute farming sim that's \"relaxing\" and fun. Grow crops, raise animals, and enjoy the cute graphics!! Highly Recommend!!", 0.523809552192688], ["Stardew valley is probably one of the best games that I have ever played, I will always have a spot in my heart for Stardew, It has so much to do compared to a lot of games and you can play it in any way you want", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/413150/header.jpg?t=1711128146", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/413150/capsule_231x87.jpg?t=1711128146", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/413150/capsule_184x69.jpg?t=1711128146"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.stardewvalley.net"}, "developer": "ConcernedApe", "owners": "20,000,000 .. 50,000,000", "tags": ["Farming Sim", "Pixel Graphics", "Multiplayer", "Life Sim", "RPG", "Relaxing", "Agriculture", "Simulation", "Crafting", "Sandbox", "Indie", "Building", "Casual", "Singleplayer", "Open World", "2D", "Cute", "Dating Sim", "Great Soundtrack", "Fishing"], "languages": ["English", " German", " Spanish - Spain", " Japanese", " Portuguese - Brazil", " Russian", " Simplified Chinese", " French", " Italian", " Hungarian", " Korean", " Turkish"], "concurrent_plays": 95466, "number_of_achievements": 49, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "LAN Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play Together", "Family Sharing"], "genres": ["Indie", "RPG", "Simulation"], "short_description": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home?", "long_description": null}