{"name": "Who's Your Daddy?!", "app_id": 427730, "platforms": {"windows": true, "mac": true, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£5.89", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 13335, "negative_reviews": 2903, "reviews": [["i love it its so fun and funny also challenging easy to pick up and play if you just want a game to play just to laugh and take a break from life this is the game!", 0.5597484707832336], ["i like drinking laundry detergent and sticking forks in outlets. if you do too, get this game", 0.523809552192688], ["this game is sooo good i have played 4.8 hour on 25 march 2025 and i really enjoyed playing all the gamemodes and if you want the old one you can play the old one the classic.\r\ngrapchis:9.5/10\r\ngameplay:10/10 \r\nfun:10/10 (with friends)\r\ngamemodes:10/10\r\nclassic whos your daddy:9.5/10 (i saw experience some glitches but its very rare)\r\noverall rating:9.8/10", 0.5181159377098083], ["This game is broken in so many ways it's basically unplayable. It's a pain to get friends into your lobby, the controls are fucked and the \"legacy\" (old) version's menus are also unusable.\n\nAnd don't get me started on the audio design that's just straight-up terrible and way too loud and inconsistent.", 0.5], ["Actually cannot believe the absolute dog shit quality of this game, buggy mess, horrible game play, every time you mute the incredibly loud music you have to redo it every time a round starts. this game is horrible, i cannot believe they have the gull to charge money for this flaming pile of garbage. Do not buy", 0.5], ["great game, i would like to play this with others but i got no-one to play with :( but it still great", 0.5], ["This game is very funny and I liking it very muchings. Very reccomendations!", 0.5], ["This game is one of those cheap, stupid games that is just very fun with friends. The best part about this game is how many fun and creative ways there are to kill your child, and it’s a great way to learn how to kill yourself from a young age. You can cook your kid, beat them to death, throw them in front of a car, and really do whatever your sick mind can think of.\n\nYou should probably try to win and actually save your kid, but that part is overrated. As the kid, you can drink something you don’t even know what it is, eat way too much, take a ride in the washing machine, or drown. The opportunities are endless unless you plan on leaving the street. I guess that car was a great purchase since he hasn’t been seen using it since 2015.\n\n10/10 would kill my child again.", 0.5], ["funny game. you can goof off with your friends on this game for quite some time. this game is super silly lol", 0.48022598028182983], ["worst parenting tutorial ever won't do it again but a good game", 0.6283783912658691], ["its good all right also subscribe to thinknoodles and use star code noodles in roblox", 0.4582210183143616], ["Me and my dad would play this and we had lots of fun and laughs", 0.5], ["Fucking Shit Game like OMG i fucking hate it so so much I dont understand what to do and its literally about killing a child like what the fuck", 0.33673468232154846], ["Fast rounds, plenty of variety, tonnes of fun.", 0.5], ["ONE OF THE BEST GAMES EVER! A little glitchy though, BUT I DON'T CARE!!!!!! :D", 0.5], ["If you like torturing your child. This is the game!! i like men and women not just loopy ones\n", 0.5], ["This was the most inspiring game I've ever played. Misleading title though 😭", 0.523809552192688], ["Good game! love it a lot! Great job!\n", 0.5], ["best game ever. it turned me gay", 0.5], ["Hilarious game to play with friends.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/427730/header.jpg?t=1738384540", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/427730/capsule_231x87.jpg?t=1738384540", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/427730/capsule_184x69.jpg?t=1738384540"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.eviltortillagames.com"}, "developer": "Evil Tortilla Games", "owners": "2,000,000 .. 5,000,000", "tags": ["Funny", "Multiplayer", "First-Person", "Comedy", "Simulation", "Online Co-Op", "Strategy", "Dark Humor", "Co-op", "Casual", "Indie", "Split Screen", "Action", "Early Access", "Difficult", "Sandbox", "Survival", "Third Person", "Adventure", "Singleplayer"], "languages": ["English", " Simplified Chinese", " French", " German", " Spanish - Spain", " Danish", " Polish", " Portuguese - Portugal", " Russian", " Traditional Chinese", " Ukrainian"], "concurrent_plays": 125, "number_of_achievements": 36, "categories": ["Multi-player", "PvP", "Online PvP", "Shared/Split Screen PvP", "Shared/Split Screen", "Cross-Platform Multiplayer", "Steam Achievements", "Steam Trading Cards", "Partial Controller Support", "Remote Play Together", "Family Sharing"], "genres": ["Action", "Casual", "Indie"], "short_description": "Who's Your Daddy is a casual multiplayer game featuring a clueless father attempting to prevent his infant son from certain death. Play with up to 7 of your friends, and test your parenting skills in a competitive setup with wacky physics and over 69 potentially ominous household items.", "long_description": null}