{"name": "Wallpaper Engine", "app_id": "431960", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "EUR", "original_price": "", "final_price": "4,99€", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 200774, "negative_reviews": 3680, "reviews": [["100% worth buying. highly recommended. tips, immediately mark this game as private once you get it. and if you decide to download certain wallpapers do not under any circumstance add them to favorites as they will be in your profile activity permanently. you might also want to keep your account on private should you download certain wallpapers, as your downloads can be seen by others within your subscriptions within the workshop if the game is not private or your account is not private. learn from my mistakes. and have a good day.", 0.9300156235694885], ["Way more worth it than I expected. Tons of variety, runs smoothly, barely uses any resources, and you can customize pretty much everything.\n\nRight now, my main wallpaper is a lava lamp, stare at it long enough and you forget about everything.\nHonestly, some wild ADHD activity, I’m telling you.\n\n\n- M ♡", 0.7505382299423218], ["Great product for a great price, gets continuous updates and dev is active in the community. \r\n\r\nIf you want to have a massive selection of wallpaper/ screen savers, if you want to be able to make your own, if you want community created content, then this is the program for you.\r\n\r\nBuy it, you wont regret it.", 0.609375], ["i liked the app, it has a lot of futures, freaking great wallpapers, it deserve the price i paid, just 10/10 rating from me", 0.5454545617103577], ["its good but if u play game in the background it  might slow down your processor if u play hard graphic video games.", 0.5454545617103577], ["Not really linux friendly    uncool...   BUT you can get it to work eventualy with \"wallpaper engine for KDE\"", 0.52173912525177], ["Listen, I’m just gonna say it—Wallpaper Engine is the greatest game of all time, and yes, I know it’s not even a game. But hear me out. It doesn’t crash, doesn’t ask me to grind for skins, and it never queues me into a match with someone who thinks they’re the next esports prodigy. Meanwhile, Overwatch out here giving me emotional damage and five DPS players pretending to be team players. Wallpaper Engine just vibes. 10/10. Game of the year forever.", 0.5416666865348816], ["100% utilization across various GPUs I've used with this program. Wallpapers are entirely dependent on the community and are mostly just anime, porn, cars, nothing really good in my opinion.", 0.5134228467941284], ["Excellent application , it´s essential for anyone who wants a great wallpaper.", 0.5], ["Looks cool, but not great options for dual monitors", 0.5], ["Outstanding!, wasn't sure if I would even used this and purchased it on a whim. Just a fun app and the community support is great.", 0.5], ["I guess I should also write a review for wallpaper engine\r\n\r\nThree words that describe it best: Easy to use\r\n\r\nSo for those who are not very good at, not in to or just don't have time for programming or to study the complex inner workings of wallpaper engine ( Yes it also has that level of depth ) you can still have your fun and create some good looking fun wallpapers with animations, music and other cool effects. \r\n\r\nThankfully a lot of the complex things are already ready to use IN the wallpaper engine or can be easily found on the workshop ( such as audio-visualizers ). \r\n\r\nOne critique I have is not of wallpaper engine itself but...other things on the workshop...I don't understand why so much of the community is just anime titty wallpapers like dudes please come up with something else, we don't need the 500th wallpaper of half-naked Re:Zero characters PLEASE. \r\n\r\nBuuuut since the app is so easy to use itself you can just ignore the weird ass community and make whatever wallpapers you want yourself in honestly even about 30-40 mins.", 0.5], ["lots of options for backgrounds and they are all very customizable.", 0.5], ["Wallpaper Engine is a fantastic way to personalize your desktop and bring it to life. With an impressive library of animated and interactive wallpapers, the customization options are endless. Whether you’re into calming landscapes, dynamic animations, or just want to showcase your favorite game or movie, there’s a wallpaper for every taste.\r\n\r\nThe software runs smoothly and is easy to use. You can create your own wallpapers or browse through the massive selection available in the workshop. The ability to adjust the wallpaper to your preferences, including sound effects and interactivity, makes the experience feel truly personalized. Plus, it’s surprisingly lightweight and doesn’t hog system resources.\r\n\r\nWhether you want to set the mood with a relaxing scene or add a bit of excitement with something more dynamic, Wallpaper Engine lets you elevate your desktop experience in a way that feels both creative and functional. It’s a must-have for anyone who enjoys customizing their digital space.", 0.5], ["Really good collection of community made wallpapers available for everyone to use.", 0.5], ["its so good paired with rainmeter and translucent taskbar def recommend", 0.5], ["Its great for finding cool wallpapers on the fly. I use it on multiple machines and while \"paying for wallpapers\" might be lame for some, the effects you can get from the application are worth it in my opinion. Check some videos out on what you can do and give it a shot when possible.", 0.5], ["left it open for like 3 days and accidentally got 349 hours", 0.5], ["after the latest update the app just craps itsself and shows me a black screen everytime i open the app and i dont know why", 0.5], ["It is great for managing multi-monitor setups lke me. It has great management for each screen. Im not talking even animations.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/431960/header.jpg?t=1739211362", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/431960/capsule_231x87.jpg?t=1739211362", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/431960/capsule_184x69.jpg?t=1739211362"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.wallpaperengine.io"}, "developer": "Wallpaper Engine Team", "owners": "20,000,000 .. 50,000,000", "tags": ["Mature", "Utilities", "Anime", "Software", "Design & Illustration", "Animation & Modeling", "First-Person", "NSFW", "Indie", "Memes", "Cute", "Action", "Singleplayer", "Funny", "Early Access", "Photo Editing", "Sandbox", "Horror", "Gaming", "Game Development"], "languages": ["English", " German", " Simplified Chinese", " Polish", " Portuguese - Brazil", " French", " Italian", " Spanish - Spain", " Finnish", " Japanese", " Korean", " Swedish", " Thai", " Traditional Chinese", " Turkish", " Portuguese - Portugal", " Russian", " Danish", " Czech", " Arabic", " Ukrainian", " Indonesian", " Persian"], "concurrent_plays": 119048, "number_of_achievements": 17, "categories": ["Steam Achievements", "Steam Trading Cards", "Steam Workshop", "Steam Workshop", "Includes level editor"], "genres": ["Casual", "Indie", "Animation & Modeling", "Design & Illustration", "Photo Editing", "Utilities"], "short_description": "Use stunning live wallpapers on your desktop. Animate your own images to create new wallpapers or import videos/websites and share them on the Steam Workshop!", "long_description": null}