{"name": "VRChat", "app_id": 438100, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 92, "negative_reviews": 18, "reviews": [["This game could be good, if only:\n\n* Had a moderation team that did not target non G-rated content\n* Allow for age-locked rooms, to prevent children from joining and to allow adults to be adults\n* Allow for password-protected rooms to play with your friends\n\nThe number of times I've seen moderators ban people for next to nothing is likely going to prevent this game from actually becoming successful. It's unfortunate because the formula they have is actually pretty good.\n\nUPDATE: Shortly after the posting of this review, I found myself IP-banned from the game. Cannot even access their website. The VRChat video of the banning also was \"banned\" from their community page. \n\nTLDR of the video: Someone else's actions resulted in a mass-banning of the entire world. This is not the way to generate a fanbase.", 0.8548951745033264], ["developers ban normal users for having fun, while their friends get to virtually molest and curse at you while being on a whitelist that prevents you from blocking them...\n\nsteer clear of this, alternatives like altspacevr exist and are much better", 0.7550843954086304], ["I am having a VR setup since December and I have seen A LOT, that includes a ton of games, \"experiences\", demos. And also a bunch of social VR apps, incl. Altxxxxx, HiFi and some others. This one I have to say blows ALL these experiences out of the water - by miles!\n\nLet me see. Today, this Friday night...I have been in a giant show which was excellently done with anime dancers. I climbed about a mile up in the sky with some people and then we dropped down. I have been in some sort of anime/game forest. I have been in a bowling alley which appeared very real, complete with 50s music and disco light :) I have been in a bar with about 20 people and a bar tender busy running around and serving drinks. I have been in an abandoned prison with scary ghosts, traps and all kinds of stuff. We have played games like CTF and we've been in an old Western town where we were the Sherrifs and shot some bad Bandit dudes :)\n\nA lot of fun also with people showing off their insanely creative avatars. I took my headset off later on and realized that I \"experienced\" more things in one single night than a normal person could ever experience in \"real life\" in a night, uh..a week or a month even. This is just frickin' awesome beyond words.\n\nFrom a technical point of view, the avatars are excellent and VRchat even allows making and importing your own from Unity. Lip sync, eye tracking and all. Some of the best avatars I have ever seen. The entire system seems polished and runs smooth.\n\nVRChat must have hundreds of \"worlds\" including games etc. to choose from since you can browse them for an half an hour and still didn't see them all. This is crazy. Uh, that being said people can also design their own worlds and games and put them in there. Possibilites: Endless. MIND. BLOWN.\n\nAnd the people are ALL extremely friendly and supportive etc.\n\nThis is VR as good as it can get with TONS of fun and infinite things to do. Seriously it's mind-blowingly good.\n", 0.734745979309082], ["Got Banned faster than a pedophile in a playground. Not a bad game but has bad moderaters.", 0.6304353475570679], ["so  i thought it was pretty great. Talked with some great people. Until one day the \"host\" decided to get mad at me because someone in the room was speaking arabic so he banned me???? dont really know what that is about but whatever  I only recommend this game if you are willing to bow down to whoever is the current host or be banned. Im personally not one for putting up with some guy getting off to having a sense of authority.", 0.6676396727561951], ["So far i like this social VR platform the best, it has a lot of mechanics that i would like to see incorporated into future VR games, especially any that have multiplayer (especially MMO's, i can wish right?). But seeing a guy be an undead from world of warcraft just makes me want a VR MMO so much more :P", 0.5504038333892822], ["This is the best application for virtual reality, hands down. I have been a member of VRchat for over two years, and the community is what makes this place so special. Each \"room\" in VRchat is a direct upload of a scene in Unity (software used to create most VR experiences). This makes it very easy for community members to upload new rooms and content. The developers of VRchat are also making the games they have (Capture the Flag, Battle Discs, etc) available in the SDK. This means over the next few months anyone can adapt these games and create new versions of them!\n\nVRchat is a great way to gain exposure to Unity/development...but you can also just have fun and talk to others here. Other social VR apps don't even compare in that feeling of community you get when you log in. Our meetups are on Sundays, but since its public release there have been people logged in continuously. \n\nCome join our community, and see for yourself what makes this such a special place!", 0.5908529162406921], ["This was a blast. It's fun visiting all of the cool places with people. The only thing I would recommend for the devs is in the smooth locomotion mode to make it \"hand based\" orientation like Onward does it as opposed to \"head based\" turning. It makes me feel a bit off when I turn my head while moving forward and my direction changes. If dev is reading check out the difference in Arizona Sunshine's new locomotion update to see what I am talking about. I would also recommend slowing the forward locomotion down 20% or so.", 0.6370072960853577], ["Best VR experience I have had, super easy to meet new friends who you can speak to and play games with for hours!\n\nEDIT: Making custom avatars is super fun, if you are able to deal with the price of major depression trying to get them to work this game is made for you <3", 0.5864132046699524], ["Download it no questions asked! I was astounded when i opened this game was portaled in and greeted by devs and mods!  Really supportive and everything this is the future of gaming and wow just wow! Thanks for this experience now i really need a VR headset!", 0.5289666056632996], ["The social VR games have always been my favorite, and this one is the best in my opinion.  The dev's are always on and incredibly helpful to anyone with questions.  If you've got a VR headset just grab it.  It's free and its fun.", 0.5262027978897095], ["This is one of the most promising, brilliant, social apps out right now. It's as random as the internet and VR should be. It's got endless potential, has tons of random things to to and runs so bafflingly well I am shocked.\n\nSomeone wanted us to checkout his PT hallway world. There were like 60 people shoulder to shoulder and not a second of lag, or any framerate drops. I am baffled by it. The amount of customization they are offering and will offer in the future is crazy. It's free, everyone should be trying this out. Making stuff, turning it into the Second Life for VR we've been asking for for so long.", 0.5224295854568481], ["If you like 1984 or the saviours from the walking dead than VRchat is for you.\n\nSay any curse word or if the admin doesn't like you, you will be banned on the spot. \n\nplease make a G rating, M rating and A rating filter system similar to second life so this nanny state moderating can stop please.\n\nEDIT: 6/01/18 \n\nSince the game has Exploded with popularity The Ban happy modernation mentallity is now very rare and the game is actually enjoyable now", 0.5035489797592163], ["Good social game with a great potential. In my case I played without VR and was a bit lagged, but with VR should be a greater experience.", 0.5234042406082153], ["about time it came out on steam ,i have been running around V.R chat since 2015 it has progressed so much in that time so many worlds to explore awesome multiplayer V.R arena battles that awesome V.R show gunters universe and the V.R community just keeps getting bigger it really kicks ass i use to love ALT SPACE V.R but it just does not compare in any form or way to how much more better V.R chat is i can't reccommend V.R chat enough its fun without vr but just amazing in vr 10/10 https://youtu.be/ow751zmsMrA i just updated my review here are more vids https://youtu.be/WD314dWmdwg  https://youtu.be/kNiC0XLUXj0 https://youtu.be/gUJkz2gXAzA enjoy", 0.5199999809265137], ["I just recently started playing around with this VR experience or collection of games, or interactive application, it is hard to define really, but it is awesome.  This is now my new go to application to show off just how cool VR can be.  Not only does the communication with other uses work almost flawlessly (if both have good headsets and a microphone) but the app itself is beautifullly constructed with multiple \"Worlds\" on can visit.  Some of these worlds offer pretty fun competive multiplayer games, like capture the flag or gold with either laser pistols or six shooters (depending on the game) other experiences are in sight and sound, like multiple movie theater spots (where you can use your Youtube to play the content you desire), presentations rooms, etc.  There is so much to explore and/or create it is awesome.  Just last night I visited a moon base, not only was it beautiful and peaceful, I was surprised to see I could leave the moonbase and walk around the moon, jump in simulated low gravity and explore!   The avatars are full body and you can choose from a number of pre-created forms as well as upload your own.  I was standing next to Wolverine (with claws and everything) yesterday.    Definite a must have for any VR user.", 0.5191724300384521], ["The best of the social VR experiences around. Extremely customizable, lots of room for growth, and a very friendly community.", 0.5659302473068237], ["VRChat is a great social platform.\nI reccomend getting a VR headset Pref VIVE and have a Quadcore Cpu with 8gb ram and At least a 2GB Video Card.\nIt Can Play with a controller Although not as Good As Vive.\nYou cand download the SDK to create your own avatar aswell as set up voice and facial Recognition.\nIt really is a great Social Platform and i recommend it too.", 0.5156130790710449], ["The first game to really make me forget I was in my room. Stable and  fun games. Even without them the atmosphere is great.", 0.5614184737205505], ["This felt like the Second Life of VR, and if that is a good or bad thing depends on where they take the software. When I say that, it feels like the developers made an engine that could be used across multiple applications, and VR chat at this time is a demo for other people to take the engine and create a specific application. \n\nOr in another way, it feels like the second iteration of AltVR. \n\nNow it is free, and it is interesting to try out.. so on that it gets a YES on recommend. \nThat all said, it feels unpolished in the graphics, and the activities don't really grab me. After under an hour, I hopped back into the bright and happy world of Rec Room. \n\nThat all said.. I am going to follow this, and see how it grows. Gonna say, my other impression is that it looks like somebody wanted to transcribe EverQuest into VR.", 0.5114006400108337]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/438100/header.jpg?t=1733413042", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/438100/capsule_231x87.jpg?t=1733413042", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/438100/capsule_184x69.jpg?t=1733413042"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.vrchat.com"}, "developer": "VRChat Inc.", "owners": "10,000,000 .. 20,000,000", "tags": ["VR", "Free to Play", "Multiplayer", "Anime", "Memes", "Funny", "Massively Multiplayer", "First-Person", "Open World", "Early Access", "Simulation", "Casual", "Adventure", "MMORPG", "Comedy", "Sandbox", "Dating Sim", "Survival Horror", "Action", "Atmospheric"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 43784, "number_of_achievements": null, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Full controller support", "Tracked Controller Support", "VR Supported", "In-App Purchases"], "genres": ["Adventure", "Casual", "Massively Multiplayer", "Simulation", "Sports", "Free To Play", "Early Access"], "short_description": "Join our growing community as you explore, play, and help craft the future of social VR. Create worlds and custom avatars. Welcome to VRChat.", "long_description": null}