{"name": "Team Fortress 2", "app_id": "440", "platforms": {"windows": true, "mac": false, "linux": true, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 17865, "negative_reviews": 7112, "reviews": [["Great to play with friends, some people aren't the nicest but thats standard for online games. generally a good time.", 0.5614035129547119], ["ive wanted to play this game for awhile so i can check it off my list of games i played but now i cant stop playing this game, PLZ SEND HELP im gonna be in credit card debt bc of funny hats make funny glow things.", 0.5192307829856873], ["The 'Meet your Match' update proved even a 9 year old game will succumb to the trend of matchmaking and force players to only play on Publisher servers. \r\n\r\nInstead of encouraging the individual to host their own servers or join others, Valve chooses to take the bandwidth and discourage community servers by filtering traffic. \r\nWhere then players are greeted by bots, unbalanced teams or 10 minute matches that nobody gets to stay in after. The threat of bots is always alive as long as Valve continues to funnel the majority of tf2's playerbase into their own servers, where they do little to no moderation.\r\n\r\nValve should bring back the ability to select teams, in order to keep games balanced. Valve should also bring back the quickplay system. It kept both Valve servers and dedicated community servers populated. And matches within community servers are allowed to go on for hours, meaning you can play on the same map/gamemode to your heart's content.\r\n\r\nTf2, as a software, was developed by Valve, yes. But its very experience was developed by the community FOR the community. Don't let anyone tell you Valve can replicate it through their servers alone.", 0.5168573260307312], ["I wish I had gotten into this game earlier, really fun. THIS GAME IS NOT A HERO SHOOTER", 0.5], ["only bad thing about this game is that occasionally you run into a competent scout, 10/10", 0.5], ["A multiplayer game where you don't need to rely on your teammates unlike other multiplayer competitive games.", 0.5], ["its kinda fun but it mostly annoying, the matchmaking is crappy because it puts you in a ending match, a losing match thats about to end,a finished match, and takes long joining one. the contracts are also annoying with ridiculous objectives and when you're finally able to do it it doesn't register. Edit: this games matchmaking is ridiculously stupid I would not recommend this game because its literal torture to play with idiots when the game puts you mid to last round of the match and puts you with the losing team which is always full with idiots or literal brain dead losers that played longer that me ", 0.5], ["im not good at writing so im just going to list what i love about this game lol\r\n\r\nthe movement feels clean and responsive constantly (unless you get hit by the loose cannon or scorch shot LOL)\r\n\r\nthe projectiles are incredibly fun and rewarding to hit\r\n\r\nThe vast array of different weapons to choose from for each class makes this one of the most constantly fun class shooters of all time. I used to play overwatch a lot and although there were way more classes to choose from none of them fit exactly how i wanted to play.\r\n\r\nthe voice acting is amazing. this game alone inspired me to want to become a voice actor. R.I.P. Rick May, fly high you magnificent bastard.\r\n\r\nThe art is great too. I love the colors and how easy it is to tell the difference between friend and foe. the maps look awesome too!\r\n\r\nthere is so much more i could say about this game and how much it has affected me as a person. the Breaking Bad of video games lol", 0.5], ["\"Constantly updated with new game modes, maps, equipment, and most importantly, hats!\"\n\n...yeah ok (¬_¬)", 0.5], ["This is'nt Game Of The Year, but Game Of The CENTURY!!!\nThe story, the community, and the gameplay is the best.\nSad that there's no new update,\nbut its still fun.", 0.5], ["amazing community SUPER NICE gameplay AMAZING HATS and more\r\n", 0.5], ["Really cool game but poor f2p players cant even say that there's a spy\r\n", 0.5], ["Fenny Gaem where big fat guy shoot bellet and noob die 10/10 would recommend (Delete flamethrower guy Volvo, thenks)", 0.5], ["A great game at its core.\nJust needs a little love and attention to bring it back to its former glory.\n\n7/10\n", 0.5], ["Great game free to play and it's one of the best not only First person shooters but also one of the best class based shooters and also has a brilliant art style and most of its major issues have been ironed out and it still great game even after almost 20 years brilliant game recommend you play it", 0.5], ["Pootis + Racism = Funny. \n\nPlus I spent over $500 on cosmetics. So I have to write a review.", 0.5], ["fuck snipers, but its a part of the game\n", 0.5], ["FANTASTICALLY addicting game, I fear I may have a new hyperfixation. 10/10", 0.5], ["team Fortress 2 is a true classic FPS pvp gaming experience.\nIt may have its fair share of negatives, like bugs, and cheaters,\n\nBut the positives are that it is  the definitive experience of what gaming was like 18 years ago.\nIt was a gem back then and it's a diamond now.\nA true timeless classic that has aged like a fine wine.\n\neven if you somehow missed this masterpiece, it still has a STRONG 40,000 daily players, and for good reason, so give it a shot, \nand you'll see why this game from nearly 2 decades ago still outclasses most modern triple-A titles.", 0.5], ["Its distinct and memorable set of classes and their weaponry appealing to a wide range of playstyles across almost 200 maps with varied gamemodes makes it one of, if not the best multiplayer first-person shooter of all time, all for the price of free.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/440/header.jpg?t=1745368581", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/440/capsule_231x87.jpg?t=1745368581", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/440/capsule_184x69.jpg?t=1745368581"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.teamfortress.com/"}, "developer": "Valve", "owners": "20,000,000 .. 50,000,000", "tags": ["Free to Play", "Hero Shooter", "Multiplayer", "FPS", "Shooter", "Action", "Class-Based", "Team-Based", "Funny", "First-Person", "Online Co-Op", "Competitive", "Cartoony", "Trading", "Co-op", "Comedy", "Robots", "Tactical", "Cartoon", "Crafting"], "languages": ["English", " Danish", " Dutch", " Finnish", " French", " German", " Italian", " Japanese", " Norwegian", " Polish", " Portuguese - Portugal", " Russian", " Simplified Chinese", " Spanish - Spain", " Swedish", " Traditional Chinese", " Korean", " Czech", " Hungarian", " Portuguese - Brazil", " Turkish", " Greek", " Bulgarian", " Romanian", " Thai", " Ukrainian", " Spanish - Latin America"], "concurrent_plays": 50481, "number_of_achievements": 520, "categories": ["Для нескольких игроков", "Кросс-платформенный мультиплеер", "Достижения Steam", "Коллекционные карточки Steam", "Скрытые субтитры", "Мастерская Steam", "Внутриигровые покупки", "Частичная поддержка контроллеров", "Включён античит Valve", "Статистика", "С редактором уровней", "Поддержка комментариев", "Remote Play на телефоне", "Remote Play на планшете"], "genres": ["Экшены", "Бесплатные"], "short_description": "Девять принципиально различающихся классов дают простор для любых тактик и способностей. В игру постоянно добавляются новые игровые режимы, карты, снаряжение и, самое главное, шляпы!", "long_description": null}