{"name": "PICO PARK:Classic Edition", "app_id": 461040, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 19, "review_score": 7, "review_decription": "Positive", "positive_reviews": 16, "negative_reviews": 3, "reviews": [["This is an excellent co-op puzzle game for family/friends, parties and events.\n\nHere's why:\n* Supports 2-10 local players.\n* Simple controls.\n* Co-op puzzle.\n* Lots of new gameplay mechanics that you have to figure out together.\n* You can skip levels if you get stuck. (At least if you've beaten the game before)\n* Smartphone controller app if you don't have enough gamepads.\n\nI love this game! \nIt's the game I've hooked up the most at events like parties, afterwork hangouts, etc. with 8 gamepads and a projector/big TV. What makes it perfect for events is the cooperation and communication needed to pass the levels so it's a good ice breaker for players or an audience who don't know each other. Also the controls are simple enough for most non-gamers to get the hang of. (Left, Right and Jump)\n\nIf you've beaten the game the replay value is somewhat limited since you already know what to do to pass the levels but the cooperation can still be enjoyable. When I bring the game to a new group I try not to spoil what to do in the levels since that would ruin part of the fun.\n\nMy only complaint is that there seems to be a slight delay in the inputs that you need to compensate for in your timing.\n\nTip: Turn down or off the volume since although the song is kind of old-school catchy there is only one song and it loops indefinetely.\n\n(I bought this version before it was free and when the Nintendo Switch version was ported to Steam I instantly bought that one as well. Due to lock downs and stuff I haven't tested the new Pico Park version on a group yet.)\n\nIf you're interested in more games supporting more than 4 local players I recommend checking out the [url=https://store.steampowered.com/curator/11707935-More-Than-4-Local-Multiplayer/]More Than 4 Local Multiplayer[/url] curator.", 0.7244333624839783], ["Pico Park is a great example of cooperation in progress.\n\nA local only multiplayer where you have to work together to complete each of the 20 levels on offer. This may seem few but, throughout all the games I played & watched, non successfully completed all the levels, from start to finish, as cooperation was abit one sided! :D\n\nIt's a brilliant game for a starter at parties & at local 'local multiplayer' events. Easy to pick up and play with gamers & non gamers alike!\n\n...As well as being one of the most cutest games around :3 <3", 0.7328985929489136], ["While the game supports up to 10 players, I've only played it with 4.\n\nIt's great. Depending on who you play with, it can quickly turn hectic.\nEither through skill or desperation, teamwork is necessary to complete\nmost of the levels. The feeling you get when you've done so is wonderful.\nBut the feeling you get when you have 1 second left and your friend can't\nseem to go through the fkn door is equally wonderful in it's own way.\n\nPros:\n- Great value ($5 for a couple hours of fun for up to 10 people?!) \n- Very easy to play\n- Fun to just watch as well!\n\nCons:\n- No music/sounds (am I missing something here?)\n- Sometimes our phones would disconnect (but easy to fix)\n\nGreat job with the game. Add more levels!", 0.6143213510513306], ["I run a kind of pop-up local multiplayer arcade that I take to different events and run my own events. I'm constantly testing out local multiplayer games at these events and have seen a lot of different people try different games out. Without a doubt Pico park is my favourite game to show. It is a game you only really play through once with friends but is so worth it and is a shining example of games that can teach team building skills. It's the simplest game to play so anyone can pick it up. Every level is a different mechanic the team has to figure out and complete. I took it to a museum and projected it once and had a team of 8 people who didn't know each other try out one level for fifteen minutes while a crowd of a hundred cheered them on. Finally someone from the crowd started managing and giving a rhythm to the process and they completed it and everyone roared like it was their favourtie team winning a football match. I can't recommend this game enough.\n\nI'll be posting some video stuff about it soon on my channel if anyone is interested; https://tinyurl.com/y9bx3cxo", 0.5607843399047852], ["This game is an amazing little coop experience.  Actually the most fun I've had at a game night in recent memory with all the trolling that goes on.  Short but absolutely worth the price.  You are entertaining 10 people after all!  And you don't need 10 controllers, you can use phones with the app!", 0.5258620381355286], ["Fun little party game when you have friends over. The phone app works well on Android, but you can also use Steam or PS4 controllers. The puzzles are pretty inventive and fun to solve without too much frustration. And you can just jump to another if you fail, so the fun doesn't have to end abruptly.\n\nThanks TECOPARK! :)", 0.52173912525177], ["can i get a refund please, not because this is a bad game, just this game level too short to play with friends", 0.5163636207580566], ["I've played a LOT of local multiplayer games, and I think this is a little gem. \n\nAlmost every level introduces a new gameplay mechanic, which causes three things to happen. First: Utter chaos and confusion. Second: Some people figure out what's happening, and start yelling at everyone else. Third: A collective \"Aha!\" moment. \n\nBut after figuring out the puzzle, you still need to DO it. This is always harder than it looks, due to the madness caused by 5+ characters moving around. The most difficult levels demand a near-telepathic degree of synchronization. Winning those levels feels amazing. \n\n\nIt's a short game, but it barely repeats any ideas. The designer could have built 40 more levels by recycling stuff, but chose quality over quantity. (Actually, I'd happily play more levels which recycle the idea from level 13.)\n\n\nHighly recommended if you want a ridiculous teambuilding activity for 5 or more people. The world needs more games like this.", 0.5], ["Very simple, but fun experience for groups of 5 minimum. Worth the five $ for a fun night with friends.", 0.5], ["What an awesome little group coop game for friends.\nWe had 5 people running around on 360 controllers and it was a blast.\n\n10/10, would scream at friends again.", 0.5], ["For a long time, I've been looking for a game to play with a whole bunch of people. This one was perfect! It was easy to set up controllers because of the ability to use your phones. The levels are so fun that it gets all my friends screaming within a few seconds.", 0.49809888005256653], ["A great party game to pull out when everyone doesn't want to fight each other. Unique and effective controller system", 0.4767063856124878], ["About 20 minutes of gameplay and hasn't been updated with new levels since its release. Find a different product to purchase for your 5 dollars", 0.38968366384506226], ["Kinda fun, not much to it. Finished all the levels within about half hour and doubt i'll touch it again. More levels or modes might be cool.", 0.3729825019836426], ["i wasnt able to play got no one to play with locally sad", 0.31277358531951904], ["Brilliant yet simple, this adorable little party game is surprisingly much more fun than it looks. The only downside is that it has no online multiplayer (yet). Even if you have just one friend to play with, it is well worth the price.", 0.5], ["If you have 10 controllers, it's a rather unique game to play", 0.5], ["Lovely little game, I would love for it to have so many more levels than the few it has.", 0.5], ["Very entertaining little game. Had really fun playing this with friends.", 0.5518333911895752]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/461040/header.jpg?t=1740033165", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/461040/capsule_231x87.jpg?t=1740033165", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/461040/capsule_184x69.jpg?t=1740033165"}, "support": {"support_website": null, "support_email": null, "game_website": "http://picoparkgame.com/en/"}, "developer": "TECOPARK", "owners": "200,000 .. 500,000", "tags": ["Multiplayer", "Local Co-Op", "Free to Play", "Casual", "Online Co-Op", "Indie", "Action", "Co-op", "Local Multiplayer", "Psychological Horror", "Pixel Graphics", "Puzzle", "Cute", "Puzzle-Platformer", "Controller", "Adventure"], "languages": ["English"], "concurrent_plays": 21, "number_of_achievements": null, "categories": ["Multi-player", "Co-op", "Shared/Split Screen Co-op", "Full controller support", "Steam Trading Cards", "Remote Play on TV", "Remote Play Together"], "genres": ["Action", "Casual", "Indie"], "short_description": "PICO PARK:Classic Edition is a cooperative local multiplay action puzzle game for 2-10 players.", "long_description": null}