{"name": "Deceit", "app_id": 466240, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 498, "negative_reviews": 235, "reviews": [["Very very fun game. Ideal with a group of 6 friends. This is the only online mafia-style game that can simulate how mafia works, replacing reads on physical reactions and body movements with evaluation of their actions and position ingame. The primary complaint I have is that it is far too hard for Infected to win. This could be pretty easily fixed with less overpowered protective devices available or making Infected need less bloodbags to execute.", 0.7984021306037903], ["Deceit is a VERY underrated game.  The gameplay is such that you and your friends can totally mess with each other over in-game voice chatter and I think that's really the biggest attraction to this game.  \n\nThe maps are nice and well lit, and the art design is fantastic.  It creates a great atmosphere for the scenarios that transpire through the match with you and the other players with 2 (infected) trying to 'play innocent' with 5 other survivors.  It's a test of wits and cunning, and seeing if you can outsmart your buds.\n\nI don't know why the playerbase for this game sunk, there's not much wrong with it, and it deserves a way better fan base.  What a fresh and enjoyable idea and experience offered in this asymmetrical horror.  ... Remember, asymmetrical horror is still a new breed of game in the horror genre.  You guys & gals supporting titles such as this will only strengthen developers to keep making more.. and I truly, STRONGLY believe that we need more games, like THIS one.", 0.7790241241455078], ["Half the player base is really worked up about the rating system in the game and arent friendly to new players. One player stands out specifically. First couple games being Infected I didnt understand fully what to do. He was Infected with me and because \"I alone\" caused us to lose. Everytime I was thrown in a game with him, he'd non-stop tell me how trash I was over ingame chat and down me 24/7 making playing this game pointless for me. Reporting seems to have no real consequences seeing as myself as well as other players reported but Id get him in EVERY match.\n\nIf you can get a group of 6, play. If not the randoms are so unfriendly.", 0.7745152711868286], ["Deceit is an asymmetrical multiplayer first-person horror game.\nInnocents have to traverse three zones and escape through the safety hatch as the infected tries to kill them before they reach the end.\nIt was originally sold for 14,99€ and became free to play as the playerbase was really low.\nDeceit has not a really huge playerbase nowadays but it is more or less stable (around 1000 as peak a day).\nVoice chat is very important in this game, you need to convince people that you are innocent. Playing without a microphone puts you at a huge disadvantage, also you should be able to lie if you are the infected.\nDeceit is unique and different from most games, it provides fun for a good amount of hours and it is also a good free alternative to Dead by Daylight.\n\nSounds 7/10 \nGraphics 8/10\nGameplay 8/10\nAtmosphere 9/10\n\nIf you liked my review, please feel free to follow me and/or my curator group:\nhttp://steamcommunity.com/id/Ov3RT4K3R/myworkshopfiles/?section=guides\nhttps://steamcommunity.com/groups/Ov3RlusioN/curation\n\nAlso feel free to check out my YouTube Channel: \nhttps://www.youtube.com/channel/UC83DYCmrWfl9ttrhX54jmWA", 0.7428919076919556], ["The idea is ok, but the player base really makes it an unfun game. Unless you have 5 other people who actually wanna try and play and queue together than do not buy this game. You can try to solo queue up but usually you get ran into with groups of 3 or 4 that know whos infected and whos not and will basically screw you over so their friends can win.", 0.7241508364677429], ["This game is exactly what I've been looking for ever since \"The Thing\" on StarCraft. Very rough around the edges, but fun, nonetheless.\n\nPros:\n- So long as everyone is talking and has their poker face on, it's a really exciting game\n- Decent variety of items to investigate and survive\n- Decent balance of power between infected and innocent\n- Fast matchmaking and fast game-pace make this a great game for time crunches\n- Both roles are very fun, and challenge you to think outside the box to win more effectively\n\nCons:\n- If nobody talks or gets into the spirit of the game, you're gonna have a bad time\n- Graphics settings keep changing and the game lags really bad sometimes\n- Nothing is really explained, so you kinda just have to figure things out over the course of a few games\n- There are only two maps, and one of them (forest) lags quite badly\n- Trying to move to the next level can be tricky with the oxygen countdown and difficult-to-traverse maps\n\nOtherwise, it's been a fun couple of hours destroying trust between friends. After a few updates and fixes, this game is going to be a must-have. Unless you have a badass computer, you're going to have problems.", 0.7163878083229065], ["\n\n**SYNOPSIS** The Game Master has kidnapped six players and locked them away in a remote location. Two out of the six players are infected and must kill the innocent players before they escape. The innocent players must escape the Game Masters arena while simultaneously trying to figure who the two infected players are.\n\nThis type of game is a classic \"who is my enemy and who is my friend\" because you truly cannot trust anyone in this game no matter what they say or do.\n\n**CONS**\n- Game sometimes lags in certain areas of the maps\n- As of now, 3/21/2017, there are only two maps and they get boring pretty fast\n- Cameras are WAY too powerful against the infected when they are in Terror Form\n- Asian players invade the NA servers so you may get into a game where no one speaks your language\n- Some players go on shooting sprees to simply rank up their perks and it ruins the depth of the game\n- Cosmetics. I added this because having very specific cosmetics that you unlock can ruin the fun for this type of game. The idea that everyone looks the same makes it difficult to differentiate between two characters which is fun. People can now just say, \"OH IT'S THE GUY WITHOUT THE SHIRT AND THE GREEN ST. PATTY'S DAY HAT.\" and he becomes a SUPER easy target to find.\n- YOU NEED A MICROPHONE TO PLAY EFFECTIVELY\n- Alot of people play with their friends and only chat in discord or Teamspeak ruining the immersion.\n\n**PROS**\n- Every round feels \"new\" because of the new group of players you are playing with\n- Dev's have been releasing updates pretty often to fix bugs amongst other things\n- Decent price for a decent game\n- Have only had game crash twice out of the 21 hours i've played\n\nWould I recommend this game? Yes. Does it have potential? Yes. Will I continue playing it? Yes.", 0.745360791683197], ["To me, Deceit is an excellent party game. The rounds go by extremely quickly - out of 6 people in your lobby 2 will be infected. It feels like a mini game of one of my favorite movies \"The Thing\". Voice chat is nearly essential with people throwing out accusations about who is infected. \n\nDeceit is in early access, and I have encountered two dropped games in the 6 hours or so I have played. I have gotten stuck in the wall once after being revived.... that being said it runs extremely smoothly. The players contstantly fighting (or teaming up) for the few items per level, plus the lights going out every minute or so really amp up the feeling of panic as you try to work together to escape the asylum.\n\nI think my favorite part of the game at the moment is actually being one of the infected. While the lights are on, I can race around for the same objectives as everyone else, and I know I have one loyal team mate. I can cower in the corner or behind furniture with anyone else as the power fails.... and just before the lights are about to restart - eat some poor bastard that thought he had an ally. FUN", 0.6430827975273132], ["Learn Chinese Simulator 2017.\n\nI can't possibly in good faith recommend the game as it currently is. \n\n[i]tldr; Latest update has fixed nothing, brought new bugs such as the crate name being messy '@UI_CRATE #11', and even brought back old bugs like gas zones both being deadly which now happens more often. At least they aligned the pistol sights to the centre of the screen and made it accurate when aiming down sights though! Right guys?\n\nMoney grab by devs, soon to implement paid for skins by the looks of things (items still have [PRICE HERE] embedded into them...), and the game is buggy as hell and only gets worse, and has a toxic community.[/i]\n\n[h1]STAY AWAY! Buy on sale perhaps for $4.99.[/h1]\n\nPros:\n\n- Amazing gameplay in a vacuum.\n- When you do eventually get a good game, the gameplay is engaging and fun.\n- Character select screen is the lobby from the original Call of Duty: Black Ops Zombie map ;)\n- Can level up your character and earn perks.\n- Can unlock costumes for your characters\n\nCons:\n\n- Buggy AF.\n- Toxic community\n- Only two maps which get tired real fast\n- Developers keep adding in mostly skins vs 5-10% legitimate bug fixes (of which there are many) which often end up creating new peculiar bugs anyway. Remember this is not an EA game, this isn't good enough.\n- Mouse will be rendered useless one in every 3 games upon joining the game (latest 1GB update did this for me)\n- In order to make the game playable and not run at 20 fps I have to go into settings and select 'Low' which increases frames. But doing this in the main menu DOESN'T STICK. You have to do it for every game you get into!\n- Half games will start with my mouse curser activated in game... One game I was blessed to have the middle click scroll button as my cursor.\n- Game crashes for me once every 8-10 games or so.\n- Often matched with Asians who cannot speak english. Not their fault, but why match Australians, Americans, and other English speaking people with Chinese servers in a game where voice communication is vital?\n- This is more a discontent with human psychology than the game, but people are incredibly stupid in this game and because of this you'll find you only really get a decent game one every 3 or 4 games, not including game crashes, because other innocents will vote you out immediately in the first round because you \"were standing next to empty blood bag therefore infected\". Lumped in with this are people who play in small groups of 3+ and just randomly eliminate people together within the first round. Alot of people do play together/you can tell they are queued with each other but actually play the game properly, props. Anyway, I guess the votekick happy meta will evolve once people learn the game more.\n- The ADS crosshair is 2 cm below the centre of the screen, and accuracy is congruent with this. You're better off aiming from hip with guns.\n\nAll of this aside, if there were global servers and you played with a group of 6 friends (without any collusion), this would be an amazing game. Can't recommend for $15 at present build. This isn't even an Early release and it crashes more than EA titles!", 0.6634019017219543], ["This game is a lot of fun. Development is happening at a good rate. They are fixing bugs in a good time. Dev team is available in Discord. They actually play the game. The player base is a lot of fun. Not a lot of toxic people. Lot of trolling and deceiving. A true enjoyment.", 0.7014620304107666], ["Hello,\n\nI should say that i bought the game when it was 20 euro (now it's free) and i have more than 200 hours on this game. I DO NOT recommend this game to anyone, it really pisses you off. There are like 10000 bugs, and it's really annoying.\n\n- RANDOM CRASHES in the game (internet connection but my internet is working)\n- I kill someone and after 2 seconds i get downed by the guy that i already killed (ping but something)\n- I select ARCTIC TERROR but i'm still other terror\n- If i randomly press jump MANY MANY TIMES i can get up on the walls\n- I can pass trough windows if you, again, press jump randomly many times\n- You can go in exit when the door is opening (not opened yet)\n- Sometimes when you give a survivor the antidot he is still downed\n- Many times i get downed but i can still kill others for 10 seconds (until i die) but i am downed... wtf..\n- Double jump bug... many people can DOUBLE JUMP idk why \n- You can give lethal injection DOUBLE TIMES\n- If i am arctic form and they give me camera i can't eat them.... but i'm immune.... wtff\n- On THE FOREST map i can jump in the trees... seriously?\n- Sometimes i hit 1 bullet with the shotgun and i give 100 hp, and sometimes i give 0 hp but i still hit them\n- HitBox really retarded to be honest\n\nSo, after MANY MANY videos on my youtube channel (http://youtube.com/zzandrei) i can say that this game is not worthy :)\n\nThanks.", 0.6360432505607605], ["I gotta say, despite some bugs (which is expected at this point in the game's release) this game is fantastic. The premise: 6 players wake up in an asylum or a forest with a gun nearby but the catch is that 2 of the players are infected and can 'Hulk' out when the lights go out, allowing them to easily kill the innocent players when in beast form, then transform back again. You'll need to reach the next area once the lights come back on as the area you were previously in is getting gased for something, so you'll suffocate otherwise. And that goes for the infected players as well. \n\nThere are achievements, multiple cosmetics to unlock, a leveling system and the game runs pretty smoothly when working properly. There is huge potential here, so don't give up on this game. Now's the time to get it as it still seems to be pretty popular.", 0.6238297820091248], ["Nobody plays on the correct server. 60 people on US servers, only like 10 of them speak English.\nOnly good for playing with a group of six friends exactly. No more, no less.\nEven under those circumstances, the game gets boring very fast.\nSlow development.\nCommunity managers are terrible. Banned me from Discord for trying to report a group of players that were griefing me.", 0.6165522336959839], ["If you are wondering if you should buy the game or not: Buy it.\n\nThe price is very low for the amount of fun it can deliver to you. Just yesterday I had to stop streaming, because I was exhausted from laughing for 2 hours straight. Frankly that doesn't happen everyday, but if the right people meet in a lobby the amount of fun and confusion will peak through the roof.\n\nNewbies will get scared and run off into the gas, because there is too much spanking going on.\nTerrors will not transform, because they feel guilty on the inside.\nWeezers will try the longest of cons.", 0.6145864129066467], ["One of the best and funniest games i have ever played. Every match is a new expericene. The developers do alot of changes to keep the game interesting. So you gotta optimize the perfect stretegy to win and to survive. I met alot of funny and cool people in this game because im mostly playing solo. If you dont got 5 firends to queue all the time, trust me if you are a nice guy you will find persons to play with :). For competitive players this game also offers a Ranking system with different rewards after the season ends.  \nImportant for good communication is a microphone i would recommend getting one it will improve your game experience alot.", 0.6113448143005371], ["6 players\n2 demons\nWho survives? \nThis is a unique game that forces you to communicate and lie to each other.\nit's difficult to get the grasp of, but it's fun when you do!\nYou will take a few hours learning all of the aspects.\nThe game experience is interesting. Each play through is different.\nThe few set backs I have with it.\n\n1. Getting paired with non- english speakers. Since this game is all about communication it simply ruins the playability.\n\n2. Full blood for one kill. (the original version you could be transformed the whole night with 2 blood packs. Now you need 3, and once you kill one person it starts to drain. Which I understand why they implemented this, but hindering the demons so harshly makes it super difficult for them to be able to kill off the survivors. One survivor goes down, he gets antidoted back up. Well since we're on floor 2, we've had 1-3 scanners which means high probability the infected has been found. It's too many odds against the infected. It makes it super hard\n\n3. The community can be pricks. Sometimes friends will down you or just execute you simply because you're not in their \"group\" they did limit the party sizes to prevent this from happening, but it's  still difficult to handle.\n\nOverall it's a great game, especially for the price tag. The devs have an active discord channel and they seem interested in making this game great and keeping it that way. I would invest the money into it for sure. Not to mention i've met a ton of cool friends from this game.", 0.6079785823822021], ["Game looks incredible and seems like an awesome idea, but right now there are far too many technical issues to justify even playing it. My friends and I bought this so I could stream it and we tried playing for about an hour only to have most, if not all, of us crash randomly every game. We all refunded after several attempts to make it through one single game but never able to. As I said, the games looks incredible and I'm totally keeping it on my radar but at the moment it's unplayable - and I'm running a GTX 1080 GPU and 5960X Processor.\n\nTLDR: Tech issues holding the game back - too many crashes. Game is beautiful and cool idea. Come back to it!", 0.6028652191162109], ["I bought the game (2016) when it actually cost money, it was good then. Before the update which changed a lot of things, as gas exit, terror systems, players (innocent) being invisible. All of that sucks & makes the game WAY too casual. The teleporting to next level takes all fun out of the game & makes games way too short. UI Changes & objective changes are good / bad. I would prefer \"legacy\" / old systems back. At the current state the game is trash, and not fun anymore. I know that updating game is important, but these updates just made the game bad. I loved the old systems & many other players liked them too. Please bring them back, or you are gonna kill this game for sure.\n\nTLDR: Game's mechanics are too casual & way worse compared to older systems. I don't recommend the game to anyone at this state as it's not as much fun anymore.", 0.5454545617103577], ["Even with its many bugs ive still sunken a few hundred hours into it in only a few months worth every cent, even with its bugs teh game keeps improving and evolving very cool concept and exciting game :) keep up the good work Dev's cant wait to see the games direction :)", 0.5894909501075745], ["PROS:\n\nVery fun game to play with friends.\n\nGame has come a long way since release and there are constant updates to fix bugs players have experiences.\n\nGREAT WAY TO LEARN ASIAN LANGUAGES!!\n\n\nCONS:\n\nWill Ruin Friendships\n\nA lot of morons play this game\n\nCant play without friends \n\n\nOVERALL:\nFun and Addictive as fuck!!\n\n\n\n\n\n", 0.6355965733528137]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/466240/header.jpg?t=1734441940", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/466240/capsule_231x87.jpg?t=1734441940", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/466240/capsule_184x69.jpg?t=1734441940"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.playdeceit.com/"}, "developer": "World Makers", "owners": "5,000,000 .. 10,000,000", "tags": ["PvP", "Multiplayer", "Horror", "Social Deduction", "Free to Play", "Choices Matter", "Shooter", "FPS", "First-Person", "Psychological Horror", "Strategy", "Funny", "Co-op", "Action", "Zombies", "Psychological", "Mystery", "Survival", "Survival Horror", "Atmospheric"], "languages": ["English", " Spanish - Spain", " German", " Russian", " Simplified Chinese", " Japanese", " Korean", " French", " Italian", " Hungarian", " Polish", " Portuguese - Portugal", " Dutch", " Portuguese - Brazil", " Turkish", " Romanian"], "concurrent_plays": 245, "number_of_achievements": 14, "categories": ["Multi-player", "PvP", "Online PvP", "Steam Achievements", "Steam Trading Cards", "In-App Purchases", "Partial Controller Support", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action", "Indie", "Free To Play"], "short_description": "Test your instincts at trust and deception in an action-filled, multiplayer first-person shooter. You wake up in unknown surroundings to the sound of the Game Master’s unfamiliar voice, surrounded by five others. A third of your group have been infected with a virus, but who will escape?", "long_description": null}