{"name": "Rec Room", "app_id": 471710, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 92, "negative_reviews": 0, "reviews": [["I finally decided to leave a review of this game after seeing the AMA on Reddit, because I want to support these guys any way I can. Everything about this game makes you happy. Everyone's always smiling (because your character can only smile), other players are extremely friendly (its totally normal for people to compliment you or congratulate you if you hit them in paintball), and the devs are just as feel-good as the game itself. They are extremely responsive to the community and really have a way of making everyone feel special. I sent Against Gravity an email recently, and the response I got came back less than six hours later not from some intern, but from the CEO. And in the AMA, when someone asked how they could support the company financially, the response was to instead to make a donation to charity and to \"tell 'em coach sent ya\". They're small gestures, but it really shows that they care.\n\n\nIn a world where it seems like we are constantly being bombarded with negativity, and where everyone is divided, this game is like a haven of positivity. Much like the reviews, the game itself is \"overwhelmingly positive\"", 0.7759674191474915], ["I have played many hours on many games in VR, rec room is by far my favorite game and I felt compelled to write a review. It's free, it's social, it has many mini games which are awesome and addictive. I can only hope they continue to build on the base game they have already because it is amazing. A must have for every VR gamer of all ages.", 0.5454545617103577], ["Rec Room – I cant believe its free!\nI think this game is overlooked by some people but if you spend some time inside you it becomes a real Gem.\nI notice on vrlfg website that there are more players online around the clock than most multiplayer VR games.\nIt has been under continous development improving more and more every month.\nWhen you first start the game there is a computer where you can add all your steam friends.\nWith your wrist watch you can easily change games servers, invite friends etc.\nMy favorites: Paintball, Jumbotron Quest and Lounge room.\nRise of the Jumbotron Quest: The asthetics of lighting color and sound are the best of any vr game I have seen. It is challenging, but I did beat it 3 times 😊\nPaintball: Endless fun. Lounge room: So fun with friends, tell jokes on stage, draw things with the 3d marker, play cards whatever best for private gatherings.\nChildren under 13 arent allowed and it is very easy to kick using the wristwatch interface.", 0.528265118598938], ["I think Rec Room should add warning about racial discrimination.\nRec Room is a worldwide VR social game. That's the reason why all of the people from various countries are able to join here.\nUnfortunately, there are some children who can't understand about this diversity of people. \nSo, their behaviour to foreigners is extremely rude and nasty.\nThis is the reason why Rec Room should add warning of segregation on the dorm room just like sexual harassment. Additionally, it's not easy to kick them with the voting system.\nOne of my japanese friend did stop playing Rec Room because these kinds of problems.\nSo please make warnig of this matter, or please add segregation category in kicking system, and make a list of them.\nRec Room is really popular as the best VR Social Network game, these personal problems must be fixed if Rec Room need to remain for a long time.", 0.5], ["Some of the best VR experiences are free.\nThis is no exception.\nBest multiplayer in VR hands down.\nFriendly online community.\nEasy to get in and get out if you just want a quick play.\nA lot of Fun with real people.\nI would rather play paintball here than real life paintball.", 0.5], ["How is it that the best experiences I've had so far have been for free? Rec Room is a fantastic VR experience! The mini games are fun, the controls work great (learn to swipe left and right to orientate!), and the social aspect is one that I actually enjoy!! Brovo to the developers and please keep up the good work!! I'll gladly pay for an expanded experience!!", 0.5], ["I have played many games on the Vive and this is honeslty the best. The online interaction and fun in this game out of this world. The games on this are very team-based and just so much fun. I hope this application continues to grow because this is a VR dream come true.", 0.5], ["When I first downloaded this game, I thought surely it would be one of those that gets released then immedietly forgotten. To my suprise, this has quickly become my favorite game not just for the HTC Vive, but my favorite game overall. With the new quest expansion, devs have shown this isn't going anywhere, and is only going to get better.\n\nI only hope now that they'll expand quest mode a bit. It would be nice if you could use all that gold for something.", 0.5], ["This is my most played game and the most well rounded multiplayer experience so far. The Devs seem to constantly be updating and pushing out bug fixes. This is a must have game for all players 13 and over!", 0.5], ["Excellent game, and free! Great playability and when the right players are on, a lot of fun. The downside is that sometimes you get childish people on there that can detract a but, but the developers are working hard to minimize it.", 0.5], ["By FAR the best VR game i have played and maybe the best i'll ever play. And on top of that, it's FREE!!!\n\nPros:\nMeeting cool people in VR (But also having the option to turn off your and others voices)\nPaintball is AMAZING\nDisc Golf is a good casual game\nDodgeball is also really good\nGraphics are pleazing\n3D charades is a nice social game (You have to talk to play it)\nPaddle Ball is a fun, quick game\nAlso you can film INSIDE THE GAME\nShield soccer is also pretty fun\nDon't forget you can play basketball, ping pong. and MORE in the lobby!\nyou can also play cards with people IN VR?!?\nand did i mention, ITS FREE!\n\n\nCons:\ni guess the graphics aren't the best?\n...\nthats like, all i can think of.\n\nso, YEAH! GET IT NOW!!!", 0.5], ["If you hate kids you might not like this game at first, but once you've played some disc golf and paintball, their presence doesn't bother you so much anymore cause you're too busy having fun.\n\nIt's a good virtual hangout spot as well; really my only complaint is some games are locked away in a private lounge and you need to invite someone (or be invited) to access it. But then again I suppose it's a good spot to chill if you're trying to avoid all the children.\n\nSpeaking of which, what parent gives their 8-year-old an $800 piece of sophisticated equipment to play with, anyway? I wish I was this spoiled as a kid...", 0.5], ["Easily my favorite game to play in vr. Very fun, easy to play, there's a bunch of different things to do, and best of all its free. This is an absolute necessity if you have a vive.\n\nIt's got a 10/10 for a reason, just download it.", 0.5], ["Would totally recommend Rec room,  always updateing and always improving, even if you don't feel like playing games, it has plenty to offer as chatting and making new friends.", 0.44209232926368713], ["Spent a bunch of time just hanging out with some really nice people from around the world in the locker room. One of the most unique and immersive experiences i've had in my whole life of gaming.", 0.49024301767349243], ["10/10 Would Drink And KIll Flying Bat's Shooting Fireball's From There Mini Terrifying Gun's\n\n\"Oh Ya I Like Playing The Game As Well\"", 0.538118839263916], ["Gnarly game for free. First time playing VR and I played this game. Met some cool people so far!! Amazing game to met friends!!", 0.5252724289894104], ["This is a fantastic and must-have game if you have a Vive! It's free! \n\nThis game is basically Wii Sports for the VR world, but it's also social. You can talk to other players, and even give them a high five! The fist-bump is used to join a party with them, which I think was pretty neat.\n\nPaintball is challenging, and there are a few small \"invisible walls\" you think you can shoot through, but you just splatter paint. That aside, great game! ..You get the excitement of paintball without the welts.\n\nDisc golf, dodgeball and other games are great fun, I can certainly see myself playing this for quite some time!", 0.523809552192688], ["This game is truly the VR killer-app. It has SO much stuff to do. And it's FREE, FOR GOD'S SAKE! Buy it now and thank me later.", 0.523809552192688], ["A great experience. Generally a polite community. The execution of the games is particularly good. Moderators and admins are excellent in-game.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/471710/header.jpg?t=1738864240", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/471710/03b606c5e4281ecacb80ed42a0eb426db6b8a769/capsule_231x87.jpg?t=1738864240", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/471710/03b606c5e4281ecacb80ed42a0eb426db6b8a769/capsule_184x69.jpg?t=1738864240"}, "support": {"support_website": null, "support_email": null, "game_website": "https://recroom.com"}, "developer": "Rec Room", "owners": "1,000,000 .. 2,000,000", "tags": ["Free to Play", "VR", "Multiplayer", "Online Co-Op", "Funny", "First-Person", "Massively Multiplayer", "Casual", "Adventure", "Co-op", "Sandbox", "Sports", "Horror", "Family Friendly", "Simulation", "Character Customization", "3D", "Action", "Singleplayer", "Action-Adventure"], "languages": ["English"], "concurrent_plays": 1121, "number_of_achievements": null, "categories": ["Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Full controller support", "Tracked Controller Support", "VR Supported", "SteamVR Collectibles", "In-App Purchases", "Includes level editor"], "genres": ["Adventure", "Casual", "Massively Multiplayer", "Free To Play"], "short_description": "Rec Room is the best place to build and play games together. Party up with friends from all around the world to chat, hang out, explore MILLIONS of player-created rooms, or build something new and amazing to share with us all.", "long_description": null}