{"name": "Human Fall Flat", "app_id": "477160", "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "KRW", "original_price": "", "final_price": "₩ 20,500", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 27748, "negative_reviews": 1377, "reviews": [["Chaotic and silly fun physics based puzzle game with crazy levels and co op support. There's a ton of different stages and usually different ways to go about solving them. The physics will make you giggle and the silly shenanigans you can get into with friends makes multiplayer feel very rewarding. The controls take a bit to get used to but that just adds to the madness.", 0.6169668436050415], ["This game is HILARIOUS. Grab a group of friends and play it together!", 0.5419847369194031], ["Great game full of puzzle and that kind of stuff,u need to use 100% of ur brain in game and think,fire game i recoment it! :D", 0.5364238619804382], ["The local split-screen implementation with mixed inputs (Keyboard/Mouse + Controller) is incredibly frustrating and unreliable. Trying to get Player 1 on KBM and Player 2 on a controller is a nightmare. More often than not, as soon as the second player joins with the controller, the keyboard and mouse input for the first player completely stops working.\r\n\r\nOn the rare occasion - truly, once in a blue moon - that you actually manage to get it working, the game is an absolute blast. It's genuinely fun, silly physics-based gameplay that's great for both adults and kids alike. The potential for local co-op laughs is huge.\r\n\r\nHowever, that potential is completely overshadowed by the sheer inconsistency and hassle of just getting the split-screen to function correctly. Seeing how rarely it cooperates, I simply can't be bothered to fight with the setup anymore. It's a shame, because the core game is enjoyable, but this persistent technical issue ruins the local co-op experience for me.\r\n\r\nCannot recommend if your primary goal is local split-screen with KBM and a controller.", 0.5127537846565247], ["Human: Fall Flat is a delightful and quirky puzzle-platformer that delivers tons of fun with its physics-based gameplay. The wobbly, customizable characters and the comical ragdoll physics make every puzzle and interaction feel entertaining. Whether you're solving puzzles solo or teaming up with friends in co-op, there’s always a sense of hilarity as you try (and often fail) to navigate through the environments.\r\n\r\nThe game features a wide variety of creative levels, each with its own set of challenges that require both problem-solving and a good sense of humor. The open-ended nature of the puzzles means there’s no one right way to complete them, giving players the freedom to experiment and explore different solutions.\r\n\r\nWith its charming art style, fun mechanics, and lots of opportunities for laughter, Human: Fall Flat is a fantastic game for anyone looking to have a good time, whether on your own or with friends. It’s a lighthearted experience that’s both amusing and rewarding.", 0.5], ["these game controls are great. And its so fun to play.", 0.5], ["A bit shorter and easier than I expected, but a very fun and hilarious game when playing with many people.  Definitely even a game good for the family it seems.", 0.5], ["Honestly, I spent most of my time breaking maps by abusing the climbing system to its fullest extent. Play with friends who aren’t dicks and are down for a chill puzzle-solver with some platforming.", 0.5], ["This is one of the best games ive played on steam but there are also more really good games to if i would rate this game from 1 to 10 id rate it an 8 im sure everyone else would love it you should 100% try it\r\n", 0.5], ["some puzzle games make you cry\nsome precision platformers make your cry\n\nthis game does both. but theyre not tears of pain, theyre tears of laughter cause this game is FRICKIN HILARIOUS\nI cant stop laughing, this game is so funny lmaoooo. everytime you ragdoll body falls of an enourmous tower -- that you now have to reclimb -- or gets squashed by a giant box you cant help but laughing.\n\nthis is a good choice if you like puzzle games, precision platformers and/or doing dumb things with your friends in a video game.", 0.5], ["incredibly fun with friends. puzzles are fun, movement and physics are hilarious\r\n\r\npretty solid amount of well-made built-in levels\r\n\r\nafter we beat the game, there's like at least 100 mostly well made user created levels, some of them can be pretty buggy, but some of them are insanely good. getting 200 hours out of this is pretty crazy and fun. fun with 2 people or more (I don't think we've had more than 4-5 at once)", 0.5], ["Its a fun puzzle/platformer game and a sandbox game too but yeah thats all I have to say its a neat game to that you can play with your friends.", 0.5], ["Absolutely loved this game, total fun to play with friends!!", 0.5], ["Engaging, fun platformer to play with friends. Lots of community content, and many achievements to be had, with funny ragdoll physics.", 0.5], ["Human Fall Flat is a very fun game, it is an awesome game, I really enjoy it.", 0.5], ["kinda just pure goofy and fun the movement is just funa nd the music is cool", 0.5], ["Another legend in the section of \"from frustrating to fun\" - extremely worth it with friends, feels short but there's always Workshop maps to extend the chaos for another couple of hours!", 0.5], ["it is a very fun challenge and requires patience for the reward at the end of every level", 0.5], ["good and lag spikes even if i close it", 0.5], ["lost some braincells playing this game but very fun if u play with friends", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/477160/601a86df5fb603914ec6ec06792abd0dc4abe4e8/header_alt_assets_24.jpg?t=1743420339", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/477160/1b174facd949901c727737e4a8d7d67aba57fafe/capsule_231x87_alt_assets_24.jpg?t=1743420339", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/477160/1b174facd949901c727737e4a8d7d67aba57fafe/capsule_184x69_alt_assets_24.jpg?t=1743420339"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.nobrakesgames.com/"}, "developer": "No Brakes Games", "owners": "10,000,000 .. 20,000,000", "tags": ["Co-op", "Funny", "Puzzle", "Adventure", "Physics", "Multiplayer", "Sandbox", "Puzzle-Platformer", "Action", "Open World", "Local Co-Op", "Indie", "Local Multiplayer", "Comedy", "Parkour", "Casual", "Split Screen", "3D Platformer", "Singleplayer", "Simulation"], "languages": ["English", " French", " German", " Spanish - Spain", " Russian", " Italian", " Simplified Chinese", " Japanese", " Korean", " Polish", " Portuguese - Portugal", " Portuguese - Brazil", " Thai", " Turkish", " Ukrainian", " Traditional Chinese"], "concurrent_plays": 2610, "number_of_achievements": 139, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Workshop", "Steam Cloud", "Stats", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Adventure", "Casual", "Indie", "Simulation"], "short_description": "Human Fall Flat is a hilarious, light-hearted platformer set in floating dreamscapes that can be played solo or with up to 8 players online. Free new levels keep its vibrant community rewarded.", "long_description": null}