{"name": "Satisfactory", "app_id": "526870", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£33.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 110493, "negative_reviews": 2846, "reviews": [["Before getting this, I had not watched a single video on Satisfactory. I had never played the early access. I patiently waited. I set up a dedicated server, so the factory can run even when I am not in game and here's the verdict:\n\nThis game is on of the very few that can be considered somewhat of a cure to the sickness that we see in the gaming industry today. It's polished. It works! You can create MASSIVE interconnected systems. Explore, there's a TON to discover. The gameplay feels rewarding. It let's you play how you want, change the rules if you will and make it Harder/Easier, play with friends (4-player co-op is not a hard limit, it can be changed in an .ini file), it doesn't shove propaganda and ideology down your throat, it lets you have fun. It has a great sense of humor! And best of all, it has OFFLINE LAN play. Just like Baldur's Gate 3, Factorio, Mindustry and Minecraft (that I played also on my dedicated server with my kids) :D Of course there are other titles out there that sport all of the above, but I just want to say a massive THANK YOU to Coffee Stain Studios for staying humble and staying true and not taking the route of other companies that take the shareholder pleasing route and then blame their clients when things go wrong!\n\nI will buy this game for my kids and friends in the months to come. Love you for this! Excellent job!", 0.8242403864860535], ["431 hrs in Epic and then bought this again to play through also the Steam achievements. So yes, one of my favourite games ever to spend my time on. A good balance of planning, building and some exploration, nasty spiders and inventory management.", 0.6236934065818787], ["This is a game that will make time slip away—if you have any to spare, of course. Similar to Factorio, Satisfactory is a logistics game in which the player explores to acquire materials to build materials needed to construct an orbiting station facility. In short, great game with a lot of value. People who like to play Call of Duty or don't like to think too much while playing games make take issue with Satisfactory.\r\n\r\nThe game is quite astounding visually and delivers a solid [b]gameplay[/b] experience while testing the player's ability to organize and design a factory. It's a little crazy going from the 2D-ish world of Factorio to an open 3D world of Satisfactory. The map itself is quite vast (not painfully vast) and unlike Factorio, doesn't rely on seeds. The map is hand crafted and remains the same no matter what playthrough the player is on. Could be good or bad depending on who is playing. The [b]controls[/b] are pretty solid and include a lot of manoeuvres that even I didn't expect. The big one is the ability to press the crouch button and, given enough speed, ability to slide. Extremely useful early game when trying to get down hills or down conveyer belts. Moreover, every action is easy to access and easy to implement given how everything is laid out. The player feels in complete control while fighting, building, exploring, or simply sitting around and thinking.\r\n\r\nThe game world itself offers quite a bit to the player to check out. There are resources that the player can discover, pickup, and research to further unlock other equipment or abilities. Most mines are accessible, but will require some special equipment to access. There are three main stations (there are more, but for the sake of length): crafting bench, equipment bench, and a MAM (research station). Crafting bench allows the player to make new materials by hand (handy early game before automation), the equipment bench which allows players to make hand held tools and suit modifications, and the MAM allows the player to research new materials or equipment. There is a lot of additional buildings that are unlocked and available as the player progresses through \"Tiers\". Tiers can be completed by researching with mined or refined materials. When the tiers that are available (tiers appear two at a time) are completed, the player is requested to continue building the Space Elevator. When materials are delivered to the Space Elevator, then new tiers unlock.\r\n\r\nThe [b]visuals and graphics[/b] are actually pretty good. Although I was expecting Unity type graphics and assets, the designers did a good job creating the objects, creatures, and the world itself. The world doesn't change, but a pretty good job was done designing its topography (map) and some of the sights are definitely wonderful to see. When I discovered oil by the sand patches, there was a few times I stopped just to enjoy the view of the horizon (albeit virtual). All the requires animations seem to be there and the game is relatively smooth overall in this domain. The [b]sounds and music[/b] was another domain that was well done. The music doesn't feel like generic factory music, and seems to have hints of geographic culture depending on the song playing (some hints of Asian music mixed in with the music they've produced). Most of the sounds are appropriate and give the player a hint of what is going on in their surroundings. There are some sounds (like the crafting sound especially early in the game) that may annoy players, holding the button down for a minute or two to get a good stack of material.\r\n\r\nOverall, I would recommend this game on sale. I don't think the full price is worth it, but anyone that plays it can tell that there was a lot of thought put forth into the game connecting the objects, world, environment, and style of play all together. The game is a lot better with friends (and faster) and I feel it has a decent amount of replayability, given you're not tired from trying to connect pieces across the map. The multiplayer aspect is a nice addition and better controller support would perhaps attract more of a player base. Small additions to the game, such as enemies that can attack the player and hidden hard drives that provide upgrades, add an extra layer of excitement to keep players engaged. Good game, but would recommend doing your homework if you're completely new to the automation/building genre.\r\n\r\n\r\n[h1]RATING: 8.4/10[/h1]\r\n\r\n\r\n[table]\r\n[tr]\r\n      [td]Gameplay[/td]\r\n      [td]B[/td]\r\n[/tr]\r\n[tr]\r\n      [td]Story / Campaign[/td]\r\n      [td]B[/td]\r\n[/tr]\r\n[tr]\r\n      [td]Visuals / User Interface[/td]\r\n      [td]B[/td]\r\n[/tr]\r\n[tr]\r\n      [td]Sounds / Music[/td]\r\n      [td]B[/td]\r\n[/tr]\r\n[tr]\r\n      [td]Replay-ability[/td]\r\n      [td]B-[/td]\r\n[/tr]\r\n[tr]\r\n      [td]Overall [/td]\r\n      [td]B[/td]\r\n[/tr]\r\n[/table]", 0.6067069172859192], ["if you have OCD max efficiency tism then you'll like it\r\n\r\nget a tv show running in 2nd monitor for optimal enjoyment. fun with friends.\r\n\r\nps. get a friend to help figure things out early or watch a yt guide. I rage quit for not understanding game for 8months until I gave it a 2nd try", 0.5990903973579407], ["---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ FIFA\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐8\n☐ 9\n☑ 10", 0.5769230723381042], ["So excited about that game that I played for about 350 hours in the week that followed the release.\nAlso, great community and communication from Coffee Stain Studios.\nAt that point, some editors would already have 100$ of shitty DLC, I'm so glad that not every studio take that path.\nAnd there are tons of mods to choose from for a customized experience.", 0.5744194388389587], ["I do genuinely marvel over how slowly this game can ease complexity onto you, only to be forcing you to create utter logistical behemoths that strain the mind to plan out. This is absolutely a game for people that love spreadsheets and I love that about it.", 0.5640535354614258], ["Игра ахуенная\nНачиналось все с пиратки, зашли поиграли, погравилось , купили. С тех пор я стал любителем БДСМ в промышленном масштабе ведь мне надо именно 8 компьютеров в минуту а не 7,9 и ради этого я готов очко порвать и это относится в целом ко всему прохождению игры, отыграл 200 часов и это только начало чтобы достичь полного удовлетворения необходимо потратить пару тысяч часов вашей никому не нужной жизни, о том что вы не очень важный сотрудник вам регулярно будет напоминать ADA", 0.5620437860488892], ["Satisfactory is a fantastic factory-building game that will appeal to any fan of the genre.\nThe game offers hundreds of hours of gameplay, and if you ever get tired of the base content, it’s fully moddable. While it still lacks a few key mechanics that you might find in similar titles, it still delivers a full and satisfying experience—whether you're playing solo or with friends.\n\n[h2] Pros: [/h2]\n- Great visuals\n- Diverse map\n- Good optimization\n- Tons of ways to build factories using your creativity\n- A solid choice for newcomers to the genre – not too simple, but not overly complex either\n\n[h2] Cons: [/h2]\n- The final milestones can feel quite grindy. If that’s not your thing, it’s definitely worth investing in a hosted server, where progress continues even while you’re offline.\n\n[h1] Overall rating: 8,5/10 [/h1]", 0.5444685220718384], ["This game is a masterclass work of art. It takes uses the part of your brain that promotes productvitey. This is why i have almost 100 hrs in less then a month.", 0.523809552192688], ["This game is very addictive. You will find yourself wondering where the time went. Once you start a project you'll not want to stop until it's finished.", 0.523809552192688], ["Amazing product, hours of endless fun, from an amazing studio of devs that still care about games!", 0.523809552192688], ["this game is amazing, and is the best way to start on factory games in general. 100% recommend it", 0.523809552192688], ["Started This Game In Update 5 with a very closed mind and decided it wasn't for me, oh how wrong I was. After update 7, I really started getting into it and now that it has fully released into 1.0 and 1.1 Experimental, It has become the most stable, Optimized, and creative game I have ever played. Thank you CSS for all the frequent updates!", 0.523809552192688], ["my brain has been melted because the game is too confusing for my mush brain. oh yeah very good.", 0.523809552192688], ["the new updates are great. does need more opened lands but still there is alot to explore", 0.523809552192688], ["I haven't felt this way about a game since I first played Minecraft years ago. Hours will feel like minutes while playing. There's always \"just one more thing\" that you need to do before getting off which makes this game so addicting.", 0.523809552192688], ["This game is good, there are dogs, and guns, and bombs, and efficiency...\r\n\r\nWhat more could you ever want?", 0.523809552192688], ["I once played 200 hours in 2 weeks. Only play this game of you have absolutely nothing to do and either love mess and chaos or symmetry and organisation.", 0.523809552192688], ["Satisfactory is a masterclass in factory automation, exploration, and sheer engineering euphoria. If you enjoy turning chaos into order and love seeing production chains hum like a well-oiled machine, this is the game for you.\n\nSome minor gripes:\n1. Trains can be a bit fussy, though deeply rewarding when mastered\n2. Needs a bit more endgame content for post-space elevator players, but that’s what mods are for\n3. Power management (especially nuclear) can be difficult and a grindy hurdle for newer players\n\nIf you think your factory is efficient, wait until you rebuild it for the third time with alternate recipes and a bus system. That’s when the real addiction kicks in.\n\nHighly recommended for engineers at heart, perfectionists, and those who feel most alive watching iron rods flow like clockwork across hundreds of meters of conveyor belts.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/526870/header.jpg?t=1737364583", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/526870/fe7cbb345c177f83f829a61f0e0ab951b42c7ab1/capsule_231x87.jpg?t=1737364583", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/526870/fe7cbb345c177f83f829a61f0e0ab951b42c7ab1/capsule_184x69.jpg?t=1737364583"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.coffeestainstudios.com/"}, "developer": "Coffee Stain Studios", "owners": "5,000,000 .. 10,000,000", "tags": ["Base-Building", "Automation", "Open World", "Multiplayer", "Crafting", "Co-op", "Resource Management", "Building", "Sandbox", "Exploration", "Adventure", "Open World Survival Craft", "Survival", "Simulation", "First-Person", "Strategy", "Sci-fi", "Singleplayer", "Early Access", "Indie"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 21127, "number_of_achievements": 44, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Steam Cloud", "Remote Play on Tablet", "Family Sharing"], "genres": ["Adventure", "Indie", "Simulation", "Strategy"], "short_description": "Satisfactory is a first-person open-world factory building game with a dash of exploration and combat. Play alone or with friends, explore an alien planet, create multi-story factories, and enter conveyor belt heaven!", "long_description": null}