{"name": "Life is Strange 2", "app_id": "532210", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 7021, "negative_reviews": 1542, "reviews": [["my favourite game ever. i could go on about how amazing it is and how everyone should play it tbh. its just so so so good. the characters, the story everything. yes, the animation are stiff sometimes and my game lagged a few times but to be fair, this was released almost 7 years ago, so i dont mind. i do wish some characters had more screen time like lyla. other than that i genuinely loved this game so much. \n\nITS SO AWESOMESAUCE!!!!!!!!", 0.5652173757553101], ["played for the 3rd times, and this is the best wolf stories that ever existed, que padre!", 0.5454545617103577], ["Life is Strange 2 is a beautifully made, emotional story that absolutely deserves recognition—but for me, it just didn’t hit the same way as the original. That’s not to say it isn’t good—because it really is. The journey of Sean and Daniel is powerful, full of heart and difficult choices, and it explores themes like brotherhood, identity, and survival in a way that’s raw and deeply moving. The writing is strong, the art style is familiar and comforting, and the moral weight of your decisions is as heavy as ever. But despite all that, it didn’t quite leave the same lasting imprint that Max and Chloe’s story did. Still, if you love narrative-driven games or the Life is Strange series in general, it’s definitely worth playing.", 0.523809552192688], ["the game is absolutely amazing. life of strange 2 is definitely the best of all the LiS , although the graphics aren't the best i think that adds a lot to the charm of the game a brilliant game with 5 more endings than the 1st", 0.5187115669250488], ["best LIS game out of the series, 10/10 experience, didn't expect it to be this emotional and heavy", 0.5045104622840881], ["Man i really slept longer on this one than i should have. For sure worth a chance by anyone curious. I wasn't sold quite yet until i got into episode two then suddenly i cared a ton about these characters. These games are all a bit corny and extreme sometimes , which most know the type of game to expect when playing any lis games. To people who don't might not give it a chance to build the scenario, underneath the extreme ways it gets its story moving is meaningful perspectives on different lives. The way it drags you into the insane emotional decisions of the characters that feel real somewhere( without powers) . The responsibility of trying to still guide your younger brother to be a good person and do the right thing in such an unfair world is kind of what i imagine having kids is like. Mad respect to people with kiddos. That pressure is low key really scary. The game really makes you believe you yourself are in this situation and you start really thinking hard about whats the right move for not only yourself but people around you. I'm telling you , something about this one.", 0.5023923516273499], ["I am a lonely wolf unlike sean , Ill do everything for the people i love , even if they dont want me to , recommended 10/10 experience my ending .... i wont heal from it ever ig", 0.5], ["I consider myself a fan of choice-based games, and among many of them, I feel a deep connection with Life is Strange 2. I believe this game resonates with my life due to the various situations and decisions one must face, and the consequences that come with them. It reflects the responsibility and weight a person must carry in life. It’s a calm and slow-paced game, yet it delivers a powerful message, touching on sensitive topics that are still relevant today—and likely will continue to be. If you’re going to play it, make sure to pay attention to everything around you and to the dialogues. With that said, I hope you enjoy this game as much as I did.", 0.5], ["It's a great game. Nice engaging story. Wish they didn't portray nearly every white dude as either liberal, gay, or a racist jackass, but it was still a fun game! 8/10", 0.5], ["This game is a wild ride of emotion it had me crying at 3am but by 7 I was super happy 10/10 story would recommend for sure", 0.5], ["cried 4 times in a span of what? 15 minutes maybe??? 10/10 game would recommend, don't have a brother so Daniel just pissed me off half the game, but hey he's just a kid after all. so yeah, ruined me emotionally but that's okay cause its a banger game also, David cameo!!!!!!!", 0.5], ["absolute peak game, changed my life and the main characters are very likeable. 10/10 would recommend", 0.5], ["It's a different experience to the first game, but I had come to appreciate it by the end. Has a road trip feel to this adventure.", 0.5], ["Life is Strange 2 is not a bad game overall, but it definitely has its flaws. Sometimes the story has really silly moments, and some choices lead to strange or unrealistic consequences. Compared to the first game, the second part feels weaker and less impactful. That said, it’s still a decent experience, especially if you're into narrative-driven games. A lot of the game depends on the younger brother, which can be interesting but also frustrating at times.", 0.5], ["I absolutely love this game! The story is so engaging, and you get super attached to Sean and Daniel. Their journey is emotional, intense, and full of tough choices that really make you think. I’ve replayed it twice just to see how different things could turn out, and I’m so glad I managed to get the two best endings!\n\nIf you play this, just be ready to cry your eyes out. Seriously. 💙", 0.5], ["I've always loved the Life is Strange games, even dating back to when it first came out on PS3. \r\n\r\nOut of them all I'd say that this one is the best in the series <3", 0.5], ["Don't understand the hate. Besides Tell Me Why, this is my favorite LIS game ever. Love the story of Sean and Daniel Diaz. Only LIS game that made me cry like a baby, and I can relate to to Sean on so many levels myself. Beautiful game, beautiful soundtracks, as with all LIS games, and excellent writing, and I also like the upgraded graphics. Those who hate on this, calling it too woke or political are the very people who are the reason these brothers became wanted fugitives in the 1st place. If this game doesn't break you, I dunno what will. Besos!", 0.5], ["This game is one of the best games i ever played. The graphic, the story, everything was amazing. I think its amazing how they added a little bit from lis 1 to the story as well. Its worth it, i recommend it to everyone, unless you don't like long games.", 0.5], ["100% worth the price (32$)\n\nYou get a pretty unforgettable story with memorable characters.\nIf you're hoping for a great story, just stop reading reviews and buy the game!\n\nThe bad reviews for this game are usually just sad they didn't get to see Chloe and Max again.", 0.5], ["ENG:\nLife is Strange 2 delivers an emotional and thought-provoking journey, driven by strong character development and meaningful choices. The writing feels authentic, and the relationship dynamics evolve naturally, making every decision impactful. While the pacing can be slow at times, the story’s depth and emotional weight keep it engaging. The soundtrack and art direction enhance the atmosphere beautifully. Some players may find the lack of traditional gameplay elements limiting, but the narrative strength makes up for it. It’s a powerful experience that lingers long after the credits roll.\n\nRO:\nLife is Strange 2 oferă o experiență emoționantă și profundă, susținută de o dezvoltare puternică a personajelor și alegeri semnificative. Dialogurile sunt autentice, iar dinamica relațiilor evoluează natural, făcând fiecare decizie importantă. Deși ritmul poate fi lent uneori, profunzimea poveștii și impactul emoțional mențin interesul ridicat. Coloana sonoră și direcția artistică completează perfect atmosfera. Unii jucători ar putea considera lipsa elementelor tradiționale de gameplay ca fiind o limitare, dar forța narativă compensează acest aspect. Este o experiență puternică, care rămâne cu tine mult timp după ce se termină jocul.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/532210/header.jpg?t=1728397855", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/532210/capsule_231x87.jpg?t=1728397855", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/532210/capsule_184x69.jpg?t=1728397855"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.lifeisstrange.com"}, "developer": "DONTNOD Entertainment, Feral Interactive (Mac), Feral Interactive (Linux)", "owners": "10,000,000 .. 20,000,000", "tags": ["Choices Matter", "Story Rich", "Adventure", "Singleplayer", "Great Soundtrack", "Atmospheric", "Episodic", "Drama", "Sexual Content", "Choose Your Own Adventure", "LGBTQ+", "Point & Click", "Third Person", "Walking Simulator", "Mystery", "Nudity", "Puzzle", "Comedy", "Funny", "Classic"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Japanese"], "concurrent_plays": 158, "number_of_achievements": 46, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Adventure"], "short_description": "After a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel's new telekinetic power, the boys head to Mexico. Each stop on their journey brings new friends and new challenges.", "long_description": null}