{"name": "Left 4 Dead 2", "app_id": "550", "platforms": {"windows": true, "mac": false, "linux": true, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£8.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 203621, "negative_reviews": 5140, "reviews": [["In this game you dont have to fear zombies you have to fear your fucking teammates :D. Every time you make your way to the chocolate helicopter and run into horde of zombies its not them you should be afraid of but your stupidass teammates who might mistake you for one of these brain-eaters and unload an entire SPAS magazine into you. Nothing compares to this not Keiths stories and not pills jokes.", 0.8088274598121643], ["I love everything about this game I just wish there was a third one. The game could use more weapons but there are mods for that. Everybody should be playing this game it changed how I look at zombie games.", 0.5841864943504333], ["Endless amount of fun, especially since you can spice up the game however you like thanks to the plethora of mods suited to each and every person's taste. Every mode has its own charm and depth, you can grind on whichever one fits you the most, or switch it up whenever you're bored. I met a lot of nice people who gave me tips on how to improve and make my time playing even more enjoyable. You'll no doubt meet some trolls, griefers, and/or toxic people along the way - the \"Block All Communications\" button will be your friend - just block them and move on.", 0.5246862173080444], ["the game is really fun if you play it with your friend but its ok in solo version is really fun to even if you add some mod or addon its will be cool", 0.523809552192688], ["This is the best zombie game I have ever played. The gameplay loop is addicting, the maps feel different and fun, the characters have interesting personalitites, the graphics still hold up and it is incredibly fun with friends. The workshop gives this game replayability like crazy. Highly recommended.", 0.523809552192688], ["This game is very cool, perfect for those of you who want to play with your friends while shaking your stomach hahaha. Btw this game is quite affordable, you don't need to spend a lot of money just to play games with your friends.", 0.523809552192688], ["its a great game, easily moddable, and has a gameplay loop that keeps me coming back to it. wish they would update this to 64 bit, though.", 0.52173912525177], ["L4D2 можно описать так:\nИграешь кампанию - убивает танк\nИграешь версус- убивает танк\nИграешь мутацию - убивает танк\nИграешь выживание - убивает танк\nИграешь реализм - убивает тиммейт\n\nРЕКОМЕНДУЮ!\n", 0.52173912525177], ["One of the most addicting First-Person Shooter Co-Operative experiences I ever played back during the XBOX 360 days. Left 4 Dead 2 is great to play with friends & the modding community is what gives this game even more life than ever before & still maintaining good player numbers on Steam to this day & deservingly so. I highly recommend it it's genuinely a good fun time & an all-time classic. Still hope one day Valve can greenlit a Left 4 Dead 3.\n\nAlso, it depends on your choice but there's really no point in buying the original Left 4 Dead 1 as Left 4 Dead 2 includes both Left 4 Dead 1 & 2 bundled together. Left 4 Dead 2 has more content compared to the original first game unless you want an original experience. \n\nAlso, watch out for Toxic players, keep your friends close & aware when playing together online.", 0.521276593208313], ["One of the best parts of this game is not only playing it as intended, but by adding mods to turn anything in it to something you like. What other game can you be in a group with Rick Grimes, John Marston, Walter White and invincible fighting hordes of Saul Goodmans? Very fun game", 0.5205479264259338], ["This was my first ever video game that I have been playing since I was 3 years old in 2009. Literally. Over the years it has never gotten old, though the nostalgia factor does tend to help a lot. The Left 4 Dead community as a whole has done a masterful job of keeping the game alive through countless mods, including custom campaigns, for whenever you need a fresh take on the classic. While the bots do tend to be a bit dumb and not very helpful, there are many awesome mods to modify their AI to make them less frustrating, and give you a human-like playing experience. Additionally, I feel L4D was very ahead of its time, because of its unique AI called the \"Director\". Instead of a copy-and-paste experience for every campaign playthrough, the Director makes it so that the game dynamics (infected, items, pacing, spawn points) all vary based on the player's skill and current status. So if you're iffy on the prospect of \"just another zombie shooter\" give it a try, as it truly is a timeless classic. This game will forever have a special place in my heart.", 0.52008455991745], ["Huh? This a zombie horror shooter game, you said? Never have heard it. This just a game about 4 anime girls or something run and gun bunny hop all the way and slay any ugly mfs that dare to move with their goofy ahh-looking weapons", 0.5199999809265137], ["I played with Workshop features (Minecraft Collection: https://steamcommunity.com/sharedfiles/filedetails/?id=3427843564)\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10", 0.5178278684616089], ["during Covid-19 times this game was amazing but now its dead and modded servers killed it i can join 10 games and 8/10 of those would be modded the other 2/10 i would be at the last part so until they fixed or someone tells me i can remove or block modded servers this game will forever be uninstalled collecting dust", 0.5081967115402222], ["rlly fun zombie killing game that u can personalize very easily\ngunplay is simple but basic, the game is ez to pick up b there is also a lot to learn, its very mechanically complex and the characters r cool & funny\nhighly recommend for anyone who likes shooters, if u like blazing through maps then u will like it. if u like being methodical then u will also like it\n+ there r basically infinite gamemodes & maps that u can easily download with the workshop", 0.5080500841140747], ["played for 10 years on xbox and a previous account. good game.", 0.5070422291755676], ["genuinely the only valve game ive played where the community doesnt allow prevalent raceism, on top of addictive gme play and amazing environmental story telling. ive been playing since it first released on disk on the 360 and i still play today", 0.5045871734619141], ["This game is old and dumb. You just shooting into zombies and this is incredibly boring even for cooperative. \n\nStoryline: is even not zero out 10, it's just \"null\". \nGameplay: 2/10. \nGraphic: I don't care about grafic, mostly, but eah this is old too.", 0.502370297908783], ["this game is fun you can you to your hearts content 10/10 great game nicoals cage is a funny guy", 0.5011235475540161], ["Stupid game. 16 cans of gas spread out no pipe bombs 6 tanks. AI WONT CARRY GAS CANS. Worst fucking idea. whoever made this quest in the game needs to lose their ability to work on games forever.", 0.5005488395690918]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/550/header.jpg?t=1745368562", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/550/capsule_231x87.jpg?t=1745368562", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/550/capsule_184x69.jpg?t=1745368562"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.l4d.com"}, "developer": "Valve", "owners": "50,000,000 .. 100,000,000", "tags": ["Zombies", "Co-op", "FPS", "Multiplayer", "Shooter", "Online Co-Op", "Action", "Survival", "Horror", "First-Person", "Gore", "Team-Based", "Moddable", "Survival Horror", "Post-apocalyptic", "Singleplayer", "Adventure", "Local Co-Op", "Replay Value", "Tactical"], "languages": ["Danish", " Dutch", " English", " Finnish", " French", " German", " Italian", " Japanese", " Korean", " Norwegian", " Polish", " Portuguese - Portugal", " Russian", " Simplified Chinese", " Spanish - Spain", " Swedish", " Traditional Chinese", " Hungarian", " Turkish", " Bulgarian", " Czech", " Greek", " Portuguese - Brazil", " Romanian", " Spanish - Latin America", " Thai", " Ukrainian", " Vietnamese"], "concurrent_plays": 25878, "number_of_achievements": 101, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Captions available", "Steam Workshop", "Steam Cloud", "Valve Anti-Cheat enabled", "Stats", "Includes Source SDK", "Commentary available", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Remote Play Together", "Family Sharing", "Steam Timeline"], "genres": ["Action"], "short_description": "Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead, the #1 co-op game of 2008. This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns.", "long_description": null}