{"name": "Black Squad", "app_id": "550650", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 11, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 5, "negative_reviews": 6, "reviews": [["My patience is wearing thin. Valofe is going to ruin this game. NS Studio wasnt listening on community and they where bad developers since about 2 years, but Valofe is going to be crazy. \nSteam Market closed (was closed short before takeover, they didnt open it again), ingame Market horrible, they raised the prices beyond good and evil for items nobody care about and chances to get them beneith criticism.\nthey removed sprays and cards etc for whatever reason. events are copied from years above but rewards are devalued as hell.\nim really patience and im sure everyone should get a second bite at the cherry, but every update, things  getting worse.^\n\nthe key scene: a clan or friends cannot play together anymore!! you arent able to play with 5 together in competitive anymore, you stuck in quick match demolition waiting and never get a game (guys are moaning in global ingame chat too), cannot abort, you have to close the game via task manager to get out of this loop... clan matches are hard to get, there are mb 2 in queue if you are lucky. someone is spamming ddos attack in chat and (EU) servers arent playable. in team deathmatch there are strange things ongoing, players lagging more and more.\n\ni rare write negative reviews, VALOFE help to reversal my/our opinion and dont buy games to let them die!\n\nBlack Squad was the funniest game and the best alternative fps after other ones like we all played together till the end.\n\nConclusion: never was and still is neither p2p nor p2w, but actually l2p (luck 2 play^^) and p2m4fb (pay too much for fancy bullshit)?!!!!!!\n\nafter over 1900 hours of gameplay: R.I.P BS, VALOFE DELIVER!!!!\ni would really appreciate it if you convince us of the contrary!\n\nupdate 22.07.2021: \nupdate include battlepass, attendancepass .. ... .. instead of bugfixes...\nnothing to say....", 0.769659698009491], ["Alright listen up deciders,\nI bought the founders pack going into this game not knowing how it plays or feels.\nI can say that was a very good desicion. This game is very good, so smooth, so easy to get into.\nIt feels like CS:GO and Call of Duty had a baby, thats Free to play. All weapons seem balanced, and are overpowered only in 1 way and always has a trade off. \nSo far the player base is at the moment a bit too easy, and every once in a while you'll come across decent players. Its really competitive, and addicting.\n                Yours Truly, ChhimPanzee", 0.5836343169212341], ["No support for the game at all its kinda sad really they true to rule over their game because they poorly survey the game. If you end up playing this game understand one thing about it. 1 Hackers are allowed to roam freely in this game infact the dms prefer it that way so their so called partners look better then anyone in the game. If you speak out against them you will be banned I have spent a lot of money in this game and what I got was the F U button for speaking out on one of their so called partners. You will not ever get a hacker banned in this game unless you get it on video them snapping to people but if it can be covered up the GMs will do it no doubt about it at all.", 0.5170454382896423], ["Great combo between COD and CSGO. Needs some love from the devs in order to improve it to another golden game, but it is on its way. If you want a good free to play FPS, this would be the one to go with. It should definitely be sold for money, not given away.", 0.555405855178833], ["Guns aren't realistic making it fun until you want a new gun costing you a shit ton of effort or a few dollars.", 0.5], ["My friend talked me up to this game and convinced me to download it. Before I even played it I thought \"Hey if its that good of a game the Founders Package should be worth it too\" Well turns out the Founder's Package is just a complete scam of $30 and the game mechanics are shit. Everyone camps and I find the game to be unplayable. Just a ripped off version of Call of Duty that tries to be CS.GO. What a complete was of my money. These devs are scamming people out of their money for shit content and the game is a Pay to Win crapfest. Dont waste your time or money on this junk. Devs should be ashamed.", 0.46130287647247314], ["My first words for review? DON'T WAIST YOUR TIME AND MONEY!!!\nHere is my review, the Black Squad Devs are money leeches, i tried 4 random boxes and i emptied all of them and NOT 1 box gave me the colored gun, they say is there, but it ain't, also we are having a lot of hackers and the Devs don't even care, now the way the whole CLAN thing is setup is a total WAIST of time, you can't even chat withiin your own clan, because that don't have a chatbox within the clan, there is no way to do anything in this game, it's like youi are their prisoner, and when they say jump. you say how high, well i say good fucken bye.\nThe score out of 10? i would give it a 3, the game is all about them making money of you, and when you need to get somethings, most of it is TIME LIMITED, I lost already $100 AUD and you will too.", 0.41806381940841675], ["I don`t recommend this game toomany cheaters and developers ban pro players", 0.52173912525177], ["Ein sehr gutes Spiel. macht sehr viel Spaß, und ich kann es wirklich nur empfehlen :)", 0.523809552192688], ["beste game\nbeste anticheat\nlegende clans", 0.484455943107605], ["like", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/550650/header.jpg?t=1734321972", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/550650/capsule_231x87.jpg?t=1734321972", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/550650/capsule_184x69.jpg?t=1734321972"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.blacksquad.com/"}, "developer": "VALOFE, NS STUDIO", "owners": "10,000,000 .. 20,000,000", "tags": ["Free to Play", "FPS", "Shooter", "Multiplayer", "Action", "Early Access", "First-Person", "Military", "Singleplayer", "PvP", "Co-op", "War", "Tactical", "Massively Multiplayer", "Team-Based", "Violent", "Open World", "Strategy", "Gore", "Adventure"], "languages": ["English", " French", " German", " Spanish - Spain", " Russian", " Simplified Chinese", " Traditional Chinese", " Portuguese - Brazil", " Japanese", " Thai", " Turkish", " Korean", " Portuguese - Portugal", " Spanish - Latin America"], "concurrent_plays": 377, "number_of_achievements": 36, "categories": ["Multi-player", "Steam Achievements", "Steam Trading Cards", "In-App Purchases"], "genres": ["Action", "Free To Play"], "short_description": "Black Squad is a free-to-play military first-person-shooter. Players can master their skills and show off their strategies with a wide range of game maps, modes, and weapons to choose from. Join thousands of FPS players worldwide in one of the most played games on Steam!", "long_description": null}