{"name": "HELLDIVERS™ 2", "app_id": "553850", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£34.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 455867, "negative_reviews": 99430, "reviews": [["Hold my Liber-Tea and check this game out! Awesome co op shooter! Tons of fun with your friends! You'll be screaming  \"For Democracy!\" within hours of getting started.\n\nThree different factions to throw down with across many varying landscapes. Tons of stuff to unlock and upgrade along the way. Ten levels of difficulty offering a great variety of challenge. A tear may come to your eye when you here the mission launch tune kick in.\n\nDefinitely give this game a chance and will someone please fix this liberty forsaken arm?!", 0.7403929829597473], ["i'd vote it up but ever since the last few patches came out the performance has been getting worse and worse so i cannot in good faith recommend the game in its current state", 0.7064308524131775], ["this game used to run good on my 3060. then the cowboy warbond came out and it runs 20fps. unplayable.", 0.6413962841033936], ["I've really enjoyed Helldivers 2 for the year I've been playing. However, I absolutely despise ArrowHead at this point. Their entire approach to development of this game is atrocious, including the most recent update that makes it so people who bought the game a year ago can no longer play because they stealthily changed the system requirements. Despite generally enjoying this game, I cannot in good faith recommend it to new players just because of the trash way the studio has approached updates, balancing, bugs, and their overall interactions with the community as a whole.", 0.6407133340835571], ["Fantastic. I don't love shooters normally, but this one I can enjoy when I'm in the mood. I guess it's just that good.", 0.6151421666145325], ["I feel like the end is nigh for Helldivers 2. \n\nI have thoroughly enjoyed my time over the last year playing this game which, as a casual gamer has scratched THAT itch. \nOver the past year the bag has been fumbled a few times with certain updates or the furore over forced Playstation membership which actually alienated a lot of people in countries that Playstation didn't even support! \nCorporate greed has unfortunately dug its claws into this game slowly but surely as the Warbonds seem to get thinner and lighter and the storyline just meander's back and forth with no real defining arc. \n\nI don't like talking down about a game that I have quite happily sunk over 300 hour's into but with the last update physically stopping me from playing with the black screen of death on startup, I have to draw the line somewhere.\n\nThe ingredients are all there to make an amazing game but that would be too simple it seems. Lets wheel out this heap of buggy (no pun intended) mess that wants to choke-hold you into membership's and Kernel level anti-cheat software and then we'll kick you while you're writhing around on the floor. \n\nI will dive no more.", 0.5872780084609985], ["This has been an awesome game to 100% with my friends; the community is great and super supportive during all my interactions.\n\n9/10 game, For Super-Earth", 0.5760888457298279], ["Don't complain about the difficulty, it is easy to play on any level you want to so the top levels should be quite hard. The only possible criticism I could imagine is that some things can get a little repetitive, but all said and done I have enjoyed this game immensely, and still play it semi-regularly. Absolute beautiful chaos with a funny starship troopers like humor surrounding it.", 0.5720058083534241], ["Ever since they did the patch to their AI I've been crashing out of games my PC can't last no more than 5 minutes before it starts to lag and crash me out of games. after playing over 900 hours of this amazing game to then have it unplayable is an insult to the amount of time i have put into this game and i have been playing this game from day zero. Once this is fixed i will change this review but until then stay away from this game till they figured out this unplayable bug.", 0.5689346790313721], ["The game can be a lot of fun, but with the last few updates the game has become very unstable. \n\n  On several occasions I've been in the middle of missions when one by one team mates start disconnecting, then when im all alone if I die I will not revive, i will just sit there hovering over my corpse. \n  Another glitch I came across was while trying to use my Quasar Cannon, i went to aim and suddenly I was just hovering in the sky, my teammates said I was just laying on the floor but i took a video and sent it my friend in the game so he could verify what i was seeing while he was looking at my character just lay on the floor. \n  Many times we will just clip through the map after an explosion or impact, you either get stuck or the game kills you by \"environment\". \n  Misisons came take 20-30 minutes sometimes and gaming time becomes more limited and more precious the older you get, after so much time wasted on missiosn you cant complete because of bugs, and when the game is set up for you to get bigger rewards from completing 3 consecutive missions, its just utterly discouraging and makes you not want to bother even starting up the game.", 0.5664578676223755], ["Its fun to play, but for me its bit repetitive after some time.", 0.5660467147827148], ["This game is awesome. It's more of a friend kind of game if you want to really have fun on it. I only played it solo in the beginning to unlock starting weapons. Playing with randos seems like a bad time according to other reviews and I never liked or tried randos myself from any game in general, let alone pc players that cheat. So if you have friends you can Michael Bay everything together as family. I don't really have any problems with this game. There's things I avoid like the highest difficulties but I am having more fun on here just playing it for fun on the diff I'm comfortable with.", 0.5611086487770081], ["I wish I could give this game a positive review, but I can't the time I have spent playing this game has truly been fun I enjoy every aspect of this game except one thing, bugs myself and many other continue to face the game crashing whenever it feels like, many times after a update releases my game will crash after launching only to randomly be fixed some other update, this isn't as simple as validating game files or reinstalling, it saddens me to have such a loved game left to a coin flip if I can play it or not, I fear this bug may forever be woven into HD2", 0.560827910900116], ["Went from my favourite game to my least favourite because of Arrowheads inability to make a functioning working game. You had a gem here, and you've ******* it up so badly its a waste of time now. Congrats.", 0.5575202703475952], ["Killer game that is definitely worth playing. However, I just wish the devs would start focusing on fixing the game's issues.\n\nThe recent update that came with the new warbond, Borderline Justice, was executed quite poorly and introduced a number of unfavourable issues to the game, noticeably messing up the TAA graphic setting and introducing some other small but noticeable bugs that were not present pre-update.\n\nHell, the most recent patch somehow messed up the reload mechanic for a widely-used weapon. The issue was that significant that they quickly released a patch for that patch which solely fixed said issue.\n\nThis type of behaviour from the devs has become a repeating issue for a while and a lot of people are becoming frustrated with it when you notice that other issues that share the same significance, such as mission softlocks which are surprisingly common, have been in the game for a while and are still yet to be fixed or even addressed by the devs.\n\nAll in all, this game is really good but if you are on the fence with buying it then I would wait until said issues have at least been addressed. The devs need not forget that this game lost a lot of it's playerbase in just a few days.", 0.5569502115249634], ["The latest update ruined the already poor optimization even more.\nThe game is also still a repetitive, buggy mess that lacks an endgame.\nThe fact that over 180 countries still cannot play this game is absolutely outrageous.\n\nF#ck you Sony, f#ck you Arrowhead", 0.5552429556846619], ["Devs need to either offer refunds or make the game playable. The performance is HORRIBLE. 20-28 FPS on average with a 3080Ti and Intel i7-11800H CPU. The horridly low FPS and amount of stutters make the game genuinely unplayable, even on the lowest graphical settings. Every update has only made it worse. Devs continue to push more microtransactions without addressing the unacceptable performance issues. Don't buy this game unless you've got a PC from NASA or unless the devs actually make the game run properly. Game was great fun when it was playable, but it hasn't been for months. Game went from being one of my favorites of all time to just making me angry that the developers conned me out of my money and then made the game unplayable.", 0.5542124509811401], ["The game is great, but unfortunately it crashes so much it has become unplayable now, haven't been able to play in two weeks and nothing would fix it. It was good while it lasted.", 0.5516677498817444], ["The idea is good but arrowhead refuses to address performance issues on pc and every update degrades performance. overly monetised too for a game im paying for, how come if i want content thats useful i need to spend 15 dollars to buy the latest pass? the idea and core gameplay is really good but lazy business practices make this game a disappointment", 0.5461878180503845], ["Game is full with bugs.. i mean BUGS as in the none 6 legged kind, Currently impossible to play smoothly as thy have not fix these visual bugs and game performance hit thy had the last month. Stalling story line and lack of progression if you play it for long time.\n\nGreat fun have been had but going to play it much less until this is fixed.", 0.545668363571167]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/553850/header.jpg?t=1741137570", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/553850/2097f73bc73e84ff9928e8e65b6328800054da57/capsule_231x87.jpg?t=1741137570", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/553850/2097f73bc73e84ff9928e8e65b6328800054da57/capsule_184x69.jpg?t=1741137570"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Arrowhead Game Studios", "owners": "50,000,000 .. 100,000,000", "tags": ["Online Co-Op", "PvE", "Third-Person Shooter", "Multiplayer", "Action", "Shooter", "Co-op", "Sci-fi", "Capitalism", "Space", "Extraction Shooter", "Third Person", "Comedy", "Gore", "Violent", "Great Soundtrack", "Difficult", "Psychological Horror", "Singleplayer", "Open World"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Portuguese - Brazil", " Spanish - Latin America", " Polish", " Portuguese - Portugal", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 31160, "number_of_achievements": 38, "categories": ["Multi-player", "Co-op", "Online Co-op", "Steam Achievements", "In-App Purchases", "Partial Controller Support", "Family Sharing"], "genres": ["Action"], "short_description": "The Galaxy’s Last Line of Offence. Enlist in the Helldivers and join the fight for freedom across a hostile galaxy in a fast, frantic, and ferocious third-person shooter.", "long_description": null}