{"name": "Pavlov", "app_id": 555160, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£19.49", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 27665, "negative_reviews": 3038, "reviews": [["Lots of fun would recommend for new and experienced VR users. Just wish it had a more active player base.", 0.5833333134651184], ["destroyed community content which is what made the game what it was", 0.5464498400688171], ["A fantastic VR shooter that fell victim to over-development, a seemingly frequent issue with VR games. \n\nIn my opinion, this game was in a far better state years ago than it is today. A flourishing community was extinguished as Vankrupt expanded the games audience outside of PCVR to generate more business. To make room for the Quest market and cross-play, a lot of the keystone features were dumbed down, gutted, or entirely removed. The most egregious example of this was with the Steam Workshop and modding scene.\n\nWith the Workshop, game-changing addons were easy to create, share, and install. The variety of content that could be made by the community kept things fresh. To get the game on consoles with modding, Vankrupt switched over to a 3rd party mod-hosting platform called Mod.io. The switch to Mod.io was understandable and a necessity for bringing the game to other platforms; however, the retiring of the Steam Workshop was an over-step and led to years of community-made content becoming useless, broken, and lost to time. With newfound cross-play limitations, newly made custom content became far more difficult to create, manage, share, and update.\n\nAdditionally, Vankrupt is turning Pavlov into a passive-income stream similar to CS:GO. Things such as gun skins are now for sale with in-game currency. This is fine, but the pricing on these coins is a lot to stomach. The most expensive package costs about the same as a new large-title game. It feels a bit insulting that new content that customizes your experience is being sold for money when a giant chunk of community-made content and history was culled.", 0.54356849193573], ["This game was fun, was...     The updates that changed the modding stuff,   since then, and after the servers just slowly died.   I remember playing the push mode, now no active server higher than real 3 people.     i used to love this game. but now sadly i cant recommend it.", 0.5426061153411865], ["This game had a really good zombies mode and completely messed it up by removing the points system and regular round system.  I don't know what the devs were thinking in removing all the good parts of this gamemode and just making it all sprinters.  I don't recommend this to anyone who wants to play zombies but the multiplayer if fun at least.", 0.5348464250564575], ["What the heck happened to this game? I played this a ton on the standalone Quest and had a great time playing modded maps and game mods with friends. Now, nothing works and the game runs like crap. Please do not buy.", 0.5136178731918335], ["GOOD. ttt is fun. literally everything is fun would play this everyday. just be ready for people random killing and mean people team killing", 0.5], ["the best counter strike inspired vr fps game available.", 0.5], ["I almost feel like writing a review is pointless because this game stands for itself. If you are looking for an intense and competitive shooter, this game is for you. It's got loads of fun game modes with people who are driven to do well and win. \n\nThen, if your're looking for a social platform with people who just like chatting and having fun, it has loads of game modes for that. Whatever your play style is, you can probably find something in this game that matches it. I've spent an unhealthy amount of time on this game and whenever I play video games, it's almost exclusively Pavlov. \n\nHighly recommended if you're looking for something fun. If you want to be a normal, efficient, useful person, I don't recommend it. You won't be able to put it down if you're anything like me.", 0.5], ["penultimate vr coop gaming with buds game, easy enough to set up and fuck around in", 0.4946996569633484], ["Still tons of fun and 10/10 worth it in 2025, literally my favorite VR game!! \nMany thanks for pushing VR frontiers forward all these years! \n\nI just wish that PCVR community could play with the rest of people who's using standalone headsets. \nMaybe more effort could be put into marketing to bring old and new people, making some sellouts.. I myself literally forgot how fun this game was until I stumbled upon it on YT and now I'm having a blast in my old Valve Index. \n\nAlso I think the old main menu screen can be redesigned to be more inviting and with more emphasis on customization, like having a mirror or something.\n\nAlso, where the heck is my favorite Castle Wars map?? It was so popular..", 0.4761904776096344], ["very fun, best gamemodes are TTT and TDM", 0.4761904776096344], ["Sadly this game is slowly dying due to the community being more and more toxic every single day and the devs making poor choices.\r\n\r\nEven then when you are in a full lobby for whatever gamemode you are doing you are gonna have a blast as there is still plenty of very chill and some of the most hilarious people you will find in a shooter. Not only that but also there is multiple gamemodes, maps, and countless mods that will keep you busy. And even with skins added to the game recently there is nothing pay to win or to pay for besides skins (that the devs choose you can not gamble and trade like in CSGO); which is great since that means everyone gets everything equally, so you don't need to worry about dying to some loser with a $20 gun or because he grinded for a hundred hours while you are given nerf guns (unless you have a nerf gun mod lol). everyone is treated equally. But also besides all that there is things about this game I personally prefer over CSGO and other shooters (both flat and VR). Reloading feels very smooth and responsive and all the gun's recoil and behavior is also smooth and feel right vs something like Contractors where guns feel very stiff and awkward. Even though it is not perfect there is also some sense of balance in this game and almost every weapon can be useable (unlike CSGO and other shooters where you are stuck to like 3 guns). Proximity chat and radio chat is also such a blessing as you can hear everyone talking to each other which leads to some of the funniest moments i ever had and also helpful for when it comes to tactics (and also extremely immersive). and also defusing the bomb in SnD takes actual skill (unless you have clippers then it doesn't take any skill) since you actually have to be calm after an intense shoot out and push in the buttons manually instead of just holding one button for 5 - 10 seconds. Which also leads me to gun fights in general in this game are way more intense and exciting. Bullets will be flying and people shouting and all you can do is keep your head down while your ally gets turned into swiss cheese and all you can do is cry while experiencing the horrors of war while the person shooting at you is doing stupid voices causing you to laugh giving away your position and making your aim worse. plus with this being VR and not having to worry about physical bodies or hands and things feeling \"free\" you can do so many things you can't do in other VR and flat games like blind fire, prone into cheeky spots, suicide bomb with cooked grenades, gangster fire a .50 cal, etc. \r\n\r\nSo anyway if you want constant full servers play Shack and if you want to avoid Gorilla Tag and Rec Room kids then play PC just know that PC isn't as active but on certain days it will be slamming and it is a great time. It is worth the price and you will find something to enjoy whenever you are casual or competitive. If the community would go back to how it use to be (everyone was chill and funny) and not continue this road of being toxic assholes and causing people to quit the game, and the devs would do a better job with updates. Then this game can continue live on and be active and not be in the situation that it is currently in. Either Way you will have a great time and it is worth the price, and even if you can't play VR there is plenty of videos on Youtube on this game that you will enjoy.", 0.4745098054409027], ["many possibilities with the mod capabilities. this is basically Gmod, in VR.", 0.523809552192688], ["Lots of racism, toxicity, and likely getting doxxed a shit ton.\r\n\r\npeak VR", 0.49883177876472473], ["Not a good game. The recoil system is ripped from CS, and its just bad. It makes no sense that the recoil pushes the barrel up instead of back. If you want realistic recoil in a VR game, try H3VR out, then you'll realise how bad it is in this game.", 0.44081875681877136], ["Great game. good community. nice mods too", 0.5], ["Decided to play TTT and within 5 min I watched a clown play Russian roulette with a Desert Eagle. The person closest to him got blamed and the entire room filled with bullets in a matter of seconds while some guy came running in screaming AHLELELELELELE everything exploded and the round ended.", 0.523809552192688], ["This game is amazing and late night TTT in siberia is peak", 0.5], ["Russian roulette on a minecraft map is interesting......", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/555160/header.jpg?t=1740613949", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/555160/capsule_231x87.jpg?t=1740613949", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/555160/capsule_184x69.jpg?t=1740613949"}, "support": {"support_website": null, "support_email": null, "game_website": "http://vankrupt.com/"}, "developer": "Vankrupt Games", "owners": "500,000 .. 1,000,000", "tags": ["VR", "Shooter", "Action", "Multiplayer", "FPS", "Military", "Zombies", "First-Person", "Gore", "Singleplayer", "Funny", "Co-op", "Violent", "Competitive", "PvP", "Team-Based", "Memes", "Indie", "Simulation", "Online Co-Op"], "languages": ["English"], "concurrent_plays": 181, "number_of_achievements": null, "categories": ["Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Tracked Controller Support", "VR Only"], "genres": ["Action", "Indie"], "short_description": "Pavlov vr is a multiplayer shooter in VR with heavy focus on community features. Realistic reloading features and fast paced combat as part of the core experience. Play the #1 most popular VR shooter on PC today.", "long_description": null}