{"name": "DARK SOULS™: REMASTERED", "app_id": 570940, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£34.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 37300, "negative_reviews": 3529, "reviews": [["Dark Souls: A Beautifully Brutal Lesson in Self-Hate\n\nDark Souls isn’t just a game — it’s an experience. Specifically, the experience of being repeatedly and unapologetically bullied by medieval architecture, undead warriors, and the very concept of hope.\n\nYou don’t play Dark Souls. You survive it. Barely. Then you die. Then you survive a bit more. Then you roll off a cliff because your fat-fingered dodge was two pixels off. Classic.\n\nThe story? Oh, it's there. Somewhere. Probably scribbled on a wall behind a hidden wall behind another hidden wall guarded by a depressed dragon. Every NPC speaks in riddles, metaphors, or what sounds like Shakespeare having an existential breakdown. Meanwhile, you’re standing there in a rusty bucket-helmet, covered in regret and moss.\n\nCombat is tight, rewarding, and feels great — for the five seconds before a 12-foot skeleton dropkicks you into the sun. Boss fights are majestic duels where you die in 0.3 seconds, whisper “okay, fair,” and queue up to die again.\n\nAnd let’s talk about mimics. Remember how other games reward curiosity? Not here. In Dark Souls, opening the wrong chest gets you eaten alive by a demonic tongue monster. Trust no one. Especially furniture.\n\nThe game’s world design is stunning in a “look how beautiful this place is, shame it wants me dead” sort of way. You’ll traverse haunted castles, poison swamps, and hell dimensions… all while questioning your life choices and the sanity of the developers.\n\nFinal Verdict: 9/10\nLost one point because I screamed at a goat demon so loud my neighbor asked if I was okay. I wasn't. I’m still not.\n\nRecommended for people who think “fun” is overrated and want to feel something. Anything.\n\nP.S. If it looks like a chest… hit it first. Trust me.", 0.7906234860420227], ["Re-playing \"blind\" after 13 years is a massive nostalgia hit and the game is just as good as when it released, but prettier [and no durability bug].\r\n\r\nSuch a beautifully-designed game!", 0.7438196539878845], ["Hot take. I love this game way more than Elden Ring. Sure, it was my first Soulsborne game, but this is so different, in a better way. The graphics take you to a wonderful world with beautiful landscapes and some that cause your PC to explode. The bosses were amazing in the first half, but did die down second half. I loved the grind that was way harder than Elden Ring, this felt like a real challenge. With 100% now, I move on to other games, but man, this was an amazing game. I highly recommend people who loved Elden Ring or just hard games to try it, and as a little challenge, try and not summon, trust me it's way funner. I'm going to say this again, but hot take, this is better than Elden Ring and my new favorite game.", 0.6132542490959167], ["Awesome game, the world design is well thought-out and the experience is incredible. Perfect start to the souls genre.", 0.584854006767273], ["If You want dive your toes into the Soulsbourne franchise, this would be the game to go. Out of all the souls games this would be considered the \"easiest\" even though the game itself isn't. It's a game that doesn't baby you around and forces you to learn and overcome hurdles that by the end you would be better as a gamer overall. The satisfaction you get for either killing a boss or getting an achievement is euphoric and not many games can achieve that feeling. It's fun, it's hard, it's a masterpiece of it's time and while it's age really shows nowadays, it doesn't really retract from the whole experience. I would consider this a right of passage for gamer's. If you were to play this game well my friend you are a gamer.", 0.563758373260498], ["Playing this is like chasing Eldralune through ash and shadow — painful, haunting, and impossibly beautiful.", 0.5394737124443054], ["I need more... I must flatten more enemies with giant 2h mace... I must become hollow and delete this game making room for Dark Souls 2.", 0.5289855003356934], ["The game is great, just buy it.\nBut...\nThe game has a boss that made me want to pluck my pubes out one by one. This was my first souls game and definitely won't be my last. The endless torture brings me a euphoria I can't yet describe. It's almost orgasmic to beat the game. I didn't finish the dlc it was incredibly boring. But nonetheless Humus the great, will continue his battle against gods in Dark Souls 2.\nPeace Out Wankers.", 0.523809552192688], ["This game single-handedly turned me into a masochist and I'm grateful for it.\nThanks Dork Suls", 0.523809552192688], ["10/10\n\nTL;DR: I would rate this game 11/10 if not for the few qualms I have with it. If you are someone who hasn't played the game, don't look at reviews or YouTube videos. Go play the game because it is an experience you can only have once. It might be frustrating at some points but it will be so worth your time, Chosen Undead. \n\nPraise the Sun! \\[+]/\n\nDetailed Review:\nPros:\n+ Unmatched world design and interconnected layouts with unrestricted freedom (if you chose the Master Key starting gift)\n+ The lore is never forced onto you but instead always behind item descriptions or conversations you would willingly trigger to know more about the world\n+ Perfect mix of adventure with an action RPG\n+ The AotA DLC (although tough to trigger) is packed with the best boss fights\n+ Combat variety and options are always great to have\n\nCons:\n- The weapon upgrade system and scaling is something you would definitely need a sort of guide for\n- PVP can be VERY jank sometimes but it's all good", 0.523809552192688], ["this game is the beginning of my dark souls journey, i quit many times just bc i died, i started over and over, deleted the game etc.\r\nbut finally finished, there is nothing to talk ab, take ur ramen and rest w me at the firelink shrine. we crusaders must move soon to link our souls to the fire", 0.523809552192688], ["Remake of the best Souls game. Good QoL additions, but some of the minor art changes rubbed me the wrong way. If Prepare to Die Edition is a 10/10, this one is a 9.9/10.", 0.523809552192688], ["Setting and Atmosphere\nDark Souls is set in the haunting and decaying kingdom of Lordran, a place where the age of fire is fading, and the undead curse has gripped humanity. The world of Lordran is intricately designed, with areas interconnected through clever shortcuts that create a sense of discovery and immersion. The seamless world design is arguably one of the game’s greatest achievements, giving players the feeling of exploring a massive, living labyrinth. The atmosphere is thick with a sense of despair and decay, emphasized by minimalistic ambient music that only swells during boss fights, making those encounters feel epic and intense.\n\nStory and Lore\nThe story is subtle and deeply layered, told through item descriptions, environmental storytelling, and cryptic dialogues from NPCs. You play as the Chosen Undead, destined to link the fire and prolong the Age of Fire or let it fade into the Age of Dark. The game never holds your hand in telling this story, leaving much of it to interpretation. The rich lore, crafted by Hidetaka Miyazaki, creates a sense of myth and tragedy that resonates long after you put down the controller.\n\nGameplay and Combat\nThe combat in Dark Souls is precise, methodical, and punishing. Every encounter feels like a duel, requiring patience, timing, and skill. The game’s signature stamina management system forces you to balance attacking, blocking, and dodging carefully. Weapon variety is impressive, from mighty greatswords to agile rapiers, and every weapon has a unique move set that encourages experimentation. The parry and riposte mechanics are particularly satisfying, rewarding skilled players with devastating counter-attacks.\n\nOne of the most iconic aspects of Dark Souls is its boss design. From the imposing Bell Gargoyles to the chilling Four Kings, each boss presents a unique challenge, often testing your reflexes, strategy, and understanding of the game’s mechanics. Bosses like Ornstein and Smough stand out as some of the best in the series, demanding a mastery of both movement and combat flow.\n\nCharacter Customization and Builds\nCustomization is extensive, allowing players to tailor their character to their preferred playstyle. You can build a dexterous swordsman, a hulking tank, a powerful sorcerer, or a versatile hybrid. The stat system is complex, rewarding thoughtful distribution to maximize damage and survivability. Magic builds feel drastically different from melee builds, offering a wide array of spells, miracles, and pyromancies that add replayability.\n\nLevel Design\nThe interconnected world design is a masterpiece in itself. Unlocking shortcuts feels like a revelation, and the way levels loop back on themselves is nothing short of genius. Areas like Anor Londo, Blighttown, and Sen’s Fortress each offer unique challenges and aesthetics that make exploration both daunting and exhilarating.\n\nMultiplayer and PvP\nThe multiplayer component, including co-op and PvP invasions, is seamlessly integrated into the world. Summoning players for assistance or invading other worlds to challenge them adds unpredictability and excitement to the experience. The covenant system also provides incentives for different multiplayer playstyles, from helping other players to hunting them down.", 0.523809552192688], ["yea sure why wouldn't i recommend the greatest [u] euphemism [/u] of my life xD\r\nbashing your head at something repetitiously for someone else's gain? yea its like having a dead end office job only cooler cause its not an office and there's [b] fucking dragons [/b]", 0.5220588445663452], ["The recent 'Seamless Co-op' mod by Yui on NexusMods is absolutely incredible. I've played the Souls games many times but playing with a friend like this is amazing. A few small quirks but overall really great. Can't wait to do another session with my friend.", 0.52173912525177], ["Played this after finishing Elden Ring, Sekiro and AC6. The bosses in this game are not that hard, it's the journey that's difficult. I mostly die to gravity.", 0.5180723071098328], ["Genuinely such a pain in the ass some of the worst areas in the series and one of my least favorite games ever hell getting to the bosses is harder than the actual bosses themselves, and I absolutely love it", 0.5172414183616638], ["This might be my favorite game of all time. It's probably just nostalgia talking, but I love almost every aspect of this game. The music is killer. The map and world design still blows my mind to this day with its creative inter-connectivity. The combat is challenging, but rewarding and rarely feels unfair. Boss fights (for the most part *cough Capra Demon and Bed of Chaos cough*) are incredibly fun and memorable. And despite its age, the graphics are pretty solid. \n\nMy favorite aspect of this game, however, might be the lore. Your first play through, you will probably miss a majority of the story due to being overwhelmed by the harsh environment, or because a large portion of it is hidden away. Once you overcome this, you will find that there is some unique, artistic storytelling and world building that brings significant context to your journey through Lordran. The community also has amazing people who have helped bring these hidden story aspects to the mainstream. \n\nWhile DS3 and Elden Ring are both amazing games in their own right, I always find myself looking back fondly at this influential game. It made me fall in love with the Souls genre and the sense of accomplishment that is felt when you finally overcome a challenge you have been stuck on for hours. The feelings I have when playing this game are unmatched. If you have already played Elden Ring or DS3 and enjoyed them, this is a must play game for sure.", 0.5151515007019043], ["This is the Dark Souls of games, really. I've now played this multiple times across several platforms and it keeps getting more fun with each run. If you have never played Dark Souls and are wondering if it's worth getting in to what's now practically a retro game, the answer is yes. This game fundamentally changed the way I see other games. \r\n10/10", 0.5], ["Absolute masterpiece this game has been such a join to replay despite all the flaws it will always have a special place in my heart as my first souls games.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/570940/header.jpg?t=1726158603", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/570940/capsule_231x87.jpg?t=1726158603", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/570940/capsule_184x69.jpg?t=1726158603"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "QLOC, FromSoftware, Inc.", "owners": "2,000,000 .. 5,000,000", "tags": ["Souls-like", "Dark Fantasy", "RPG", "Difficult", "Action", "Dark", "Fantasy", "Atmospheric", "Great Soundtrack", "Action RPG", "Lore-Rich", "Adventure", "Multiplayer", "Exploration", "Story Rich", "Third Person", "Replay Value", "Character Customization", "Soundtrack", "Co-op"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 3502, "number_of_achievements": 41, "categories": ["Single-player", "Multi-player", "Steam Achievements", "Full controller support", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action"], "short_description": "Then, there was fire. Re-experience the critically acclaimed, genre-defining game that started it all. Beautifully remastered, return to Lordran in stunning high-definition detail running at 60fps.", "long_description": null}