{"name": "PUBG: BATTLEGROUNDS", "app_id": 578080, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 5, "review_decription": "Mixed", "positive_reviews": 175058, "negative_reviews": 101820, "reviews": [["It was revolutionary in 2017/18, but nowadays it´s incredibly outdated and clunky.\nPlus all the anime stuff really isn´t the way to go for a game like this", 0.8146478533744812], ["Games just keep getting worse and not worth playing anymore. Developers just keep investing in skins rather in the game. Too many bugs and cheaters.", 0.8072419762611389], ["I like it, I'm not sure if I got better or because a bunch of cheaters were banned. Either way I'm doing better, and most people (teammates) are fun to play.  Good moral.", 0.6238499879837036], ["Amazing game, but also ridiculous. Played my first few games. Knocked a higher level player, rage reported and I'm banned for \"cheating\". Absurd. I've never cheated/hacked before, don't know how to. Have thousands of hours on console, no issue. Only been on pc a short time, only started PUBG this week, and this happens", 0.5454545617103577], ["Just rampant cheating.\n\nGun play feels good but its just unreal how every two seconds someones shooting through a wall trying to hit me.\n\nCrazy how we went from so many good BRs to none in such a short amount of time.\n\nSave your time and pick up wood working or something.", 0.523809552192688], ["After 3200 hours of ranked games and really trying to scale I decided that I will uninstall this game because its full of hackers and noone's doing anything about it...its sad bcuz its a nice game but not worth it! AVOID THIS GAME", 0.523809552192688], ["Fix your shit ass game. Having to open and close the game over and over hoping it won't get stuck on a gray screen and just let me in to the main menu for a 7 year old game is comical. 50/50 chance it does the same after every game. What a joke", 0.523809552192688], ["PlayerUnknown's Battlegrounds (PUBG) is an adrenaline-pumping battle royale experience that truly sets the gold standard for its genre. From its immersive maps to its strategic gameplay, PUBG offers a thrilling blend of intensity and fun that keeps players coming back for more.\r\n\r\nThe game's graphics are stunning, with detailed environments that range from sprawling urban landscapes to rugged terrains. The dynamic weather and day-night cycles add an extra layer of realism, making each match feel fresh and unpredictable. The sound design is equally impressive, with every footstep and distant gunshot immersing you deeper into the action.\r\n\r\nOne of PUBG's standout features is its variety of playstyles. Whether you prefer stealth and strategy or fast-paced combat, the game caters to all kinds of players. The extensive arsenal of weapons, vehicles, and gear ensures no two matches are ever the same. Plus, teaming up with friends or joining random squads brings a sense of camaraderie that makes victory even more satisfying.\r\n\r\nPUBG’s commitment to updates and improvements demonstrates its dedication to the player community. Regular content additions—such as new maps, modes, and cosmetics—keep the game exciting and engaging.\r\n\r\nIn short, PUBG is a masterclass in battle royale gaming. It’s not just a game; it’s an experience that delivers heart-pounding action and endless replayability. Whether you're a casual gamer or a competitive enthusiast, PUBG is a must-play.", 0.5225653648376465], ["After launching years ago, I continuously find hackers, aimbotters, wallers, and cheaters in almost every map i join. If you want yourself to be frustrated by continuous South East hackers and ruin your game, be my guest and play it. Loose your mind over every death you watch on your death cam, your attacker always look at your direction in close proximity. Sound sense is the worst, cant hear anything from enemy running to reload or whatever. I wont recommend playing this. Thoroughly frustrated by hackers.", 0.52173912525177], ["I've been playing this game since 2018, and I really enjoyed it back then. But as time goes on, especially now, the game has just gotten worse — unstable, laggy, tons of input lag, filled with trash battle passes full of pinky stuff and it's getting more and more... gay. I’m probably uninstalling the game soon.", 0.5164835453033447], ["really bad game, mono sound you cant tell where you getting shot from. and really poor servers mostly bots are running.", 0.5128939747810364], ["Lets be real, the movement is hilariously horrible. The Audio is completely misleading and will have you spinning in circles. Not even worth buying the game at a discounted price. As of 2025, I would advise staying away from this game.", 0.5121951103210449], ["Can't select map. Game is flooded with bots. Body armor and helmets are just for show, they don't reduce damage. Small caliber SMGs and HANDGUNS make more damage than bigger caliber assault rifles. \"Skill based matchmaking\" in this game is a joke. Game decides whenever you shot is a hit or not, also determines the damage. If you value your nervous system you'll simply not play this game.", 0.5087335705757141], ["Full of cheater. Every session minimum 3-4 team using map, auto-aim, much life. Wait in zone 7-8 minutes. Much bag capacity more than 10 grenade etc. Reporting but nothing happening very seldom temporary for just 1 day! Almost never permanent ban. It was very good several years ago but now i dont advice to anybody play this game.", 0.5081967115402222], ["Casual is broken because everyone bots, ranking is broken because everyone has a rank 10 times higher. Probably game is dead", 0.5081967115402222], ["This game really shows its age. The QoL features that newer BR games have really spoiled me, because playing most of the new ones and coming back to this sours my experience. This entire game is plagued with clunky unresponsive jank that really cause issues with the core gameplay. Half of the \"difficulty\" is fighting against the game itself while trying to fight your opponents. The maps have the classic Battlefield game design of not knowing where your enemies are until you're up in their face (if you can get that close), and getting shot from who knows where and dying instantly - while it taking an entire clip or more to kill someone else. The loot distribution is awful and you'll rarely find what you're looking for (attachments, guns, meds, etc). You'll rely on luck in order to survive, more than most BR games (a lot more). This game was probably dope for the time, but did not age well. You're better off playing War Zone.", 0.5064278841018677], ["1. Bullets can hit anyone from almost any distance without a scope. No, it's not your aiming; it's just a game mechanic that favors shooters.\n\n2. Does the zone matter? No, the game has dozens of mechanics that render the zone irrelevant. Behind the enemy line is everywhere.\n\n3. This game simply isn't for solo players. This mention should be removed from the description because there is no ranked single-player queue.\n\n4. Prefer watching streams over playing? This game is for you. You'll watch a lot of streams of your friends playing alone after your death due to point 3.\n\n5. Player movement feels like controlling a wooden block. This is because someone thought it wise to split already sparse queues into smaller ones, allowing players to select FPP/TPP. Yes, the same wooden movement for both FPP and TPP experiences.\n\n6. In TPP, the player's camera is always over the left or right shoulder, not over the head. You can control it by leaning, but there's no center, which makes a huge difference in peeking around corners.\n\n7. This game had huge tactical potential, but developers prioritized making skins over providing gameplay improvements.\n\n8. This game looks terrible. Oh boy. It's like '90s... Tactical hide-and-seek? Forget about it. You're in plain sight no matter the distance, because devs are lazy and focus on skins and fireworks for celebrating the 8th anniversary of doing nothing but skins. Compare this game to others like theHunter, which also have large areas to render—it's on a completely different level. They were given an entire Unreal Engine. Devs, you had one job. Congratulations...", 0.5012469291687012], ["This game used to be great, but the insane learning curve, cheating, and just overall community has really dug this game its grave. Once one of the best battle royale games out there, now just apart of the old library of games that have no casual aspect to them anymore.", 0.5], ["I really love the game. If I could Live forever I would play it forever. My favorite gun is revolver.", 0.5], ["is nach jahren immernoch nicht über einen beta status gekommen von der engine her... aber gibt halt keine gute alternative...", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/578080/841ea38bc58cabb70aef65365cf50bc2d79329d9/header.jpg?t=1744161491", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/578080/14f42ab797699a9c9f137fda66582d8776da4330/capsule_231x87.jpg?t=1744161491", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/578080/14f42ab797699a9c9f137fda66582d8776da4330/capsule_184x69.jpg?t=1744161491"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.pubg.com"}, "developer": "PUBG Corporation", "owners": "50,000,000 .. 100,000,000", "tags": ["Survival", "Shooter", "Battle Royale", "Multiplayer", "FPS", "PvP", "Third-Person Shooter", "Action", "Online Co-Op", "Tactical", "Co-op", "First-Person", "Strategy", "Early Access", "Competitive", "Third Person", "Team-Based", "Difficult", "Simulation", "Stealth"], "languages": ["English", " Korean", " Simplified Chinese", " French", " German", " Spanish - Spain", " Arabic", " Japanese", " Polish", " Portuguese - Portugal", " Russian", " Turkish", " Thai", " Italian", " Portuguese - Brazil", " Traditional Chinese", " Ukrainian"], "concurrent_plays": 773389, "number_of_achievements": 37, "categories": ["Multi-player", "PvP", "Online PvP", "Stats", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action", "Adventure", "Massively Multiplayer", "Free To Play"], "short_description": "PUBG: BATTLEGROUNDS, the high-stakes winner-take-all shooter that started the Battle Royale craze, is free-to-play! Drop into diverse maps, loot unique weapons and supplies, and survive in an ever-shrinking zone where every turn could be your last.", "long_description": null}