{"name": "Monster Hunter: World", "app_id": "582010", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "£24.99", "final_price": "£8.24", "discount_percent": 67, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 100407, "negative_reviews": 8417, "reviews": [["\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template \n", 0.7365153431892395], ["much game.\r\nbig content.\r\nwow\r\nmany difficult.\r\nso gameplay", 0.7083404064178467], ["My first monter hunter game and it turn out to be very addictive", 0.621166467666626], ["One of the best ARPGs Ive played so far and definitely one of my favourite games overall. \nAnd It is still stays true even after release of Wilds and Rise.\n\nThe combat feels just right, with enough depth and commitment to every move you do. Id even say it might feel like a turned-based action game, where both you and the monster take your respective turns to punish eachother.\nThankfully, its not a game where you button-mash your way to victory, especially in later fights, you HAVE TO learn monster's moveset and especially your weapon's moveset, otherwise you either fail by carting or just time-out. And it feels great to learn that stuff and improve as a player. And there is alot to learn for each of 14 available weapons, that even after hundred of hours you still might learn new things even about a single weapon you main.\nYou dont get better in the game just by getting better gear or leveling up your stats, you get better in the game by learning its mechanics.\n\nThe monsters design is overall great, especially in Iceborne and its TUs. While there are some outliers, it doesnt take away from the greats like Velkhana, Namielle, Alatreon, Fatalis, Rajangs, Odogarons, Anjanaths, Zinogres and so on and so forth. Id say over half of the roster is great, the other half is either good or good enough. And then there are few like Lavasioths, Zorah and other Leshens, which Id say are just not fun to fight, thankfully you dont have to do most of them multiple times.\nThis is probably the only game where you can kill monster 100s of times and everytime it still feels fun to engage with it.\nI would've never thought that even grind for Decos and Materials might be so fun for hundreds of hours either just by doing Guiding Lands and slaying everything in sight or killing Tempered Teostra 300 times.\n\nDepsite it being a 7 y.o game, it still looks great even now, even in comparison to the 6th gen. And runs great even on mid hardware.\n\nThe only negative thing I can say about the game is probably story, but it doesnt take that much time to finish it, and you still get to experience alot of great monsters in there.\n\nIt might be hard to get into, especially if you havent played a game like that before, but its a rewarding experience for sure. You can always try and read in-game tutorials which give you some basic info or just look some more in-depth ones on platforms like YT.\n", 0.6036804914474487], ["This games dlc adds more than two times the content of the main game and both the main game and the dlc is peak", 0.547325074672699], ["Monster Hunter: World lets you live out your fantasy of becoming a glamorous beast slayer, just be prepared to spend hours grinding for that one rare scale and carting (dying) more times than you'd like to admit. The monsters are epic, the weapons are ridiculously oversized, and the satisfaction of finally felling a giant lizard is only slightly overshadowed by the realization you now have to carve it up for its shinier bits. If you enjoy epic boss fights and the endless pursuit of slightly better loot, prepare to lose hundreds of hours to this addictive monster-mashing masterpiece.", 0.523809552192688], ["Still the goat. Put on the ICE mod and it becomes a near-perfect game.", 0.523809552192688], ["I have over 1k hours on the playstaion, and I was looking forward to Wilds to come out, and don't get me wrong, Wilds has done a great job with the combat but this game is far superior in charm, colors, and weapon design...especially once iceborne was released. I booted this game back up today and just was taken back by the maps, the colors, the music, etc. It's a little slow going at first but once it gets going, it's hard to stop playing. I booted up wilds after playing and opened up the maps, looked at the boring roster and shut it back down. I think when I want a MH fix, I'll play this. I also enjoy rise, but can't seem to find people who play it at a lower rank. If there was I'd play that as well. I have a few hundred hours on the Switch but the visuals aren't there compared to the PC version, so I don't load that one up as much.", 0.523809552192688], ["Hunts, monsters, eating, this game is another masterpiece from CAPCOM and It's one of my favorite games ever!", 0.523809552192688], ["Monster Hunter: World and its expansion, Iceborne, are more than just action RPGs—they're a form of therapy. There's something incredibly satisfying about diving into a vast world where my only objective is to track, fight, and carve up massive beasts, all to forge stronger weapons and armor. The game’s core loop—hunt, gather, craft, repeat—is a cycle that absorbs me completely, helping me vent my frustrations through sheer determination and skill.\n\nAt its core, Monster Hunter: World and Iceborne give me control. No matter how chaotic real life gets, I know that in this game, with enough effort, I can overcome any challenge. And that’s exactly why I keep coming back.", 0.523809552192688], ["It's MONSTER HUNTEEEER!!!.....WHAT'S WRONG WITH YOOOOOOOOU!!!! Pick up a weapon and Slash, bash, poke, stab, blow up and shoot your way to give Monsters the Beat down that not even PETA will oppose...Great diversity of Monsters to hunt LOTS and LOTS of replay value. Collect all kinds of gear Armor/Weapon Sets that will help you on your journey to becoming the best Monster Hunter there is. Love the fact that THIS MH is more realistic, unlike the prior MHs that are more cartooney and or anime-ish but it's Monster Hunter non the less. If you played any of the MHs in the past consoles then you pretty much know what to expect. \n\nEach weapon has it's own learning curve over 10+ weapons to learn and collect monster parts to craft. you can also up grade your gear so you can hunt bigger and stronger monsters..You can hunt solo or with a Palico (kitty companion) or 4 other hunters. That ONLY PvP this game has is an Arm Wrestling table the game has in the Lobby which is fun in on it's self. Lots and Lots of costumes, emotes, emojies and DLCs that will expand the game and it's repeatability even more. Fun and Challenging all the way.", 0.52173912525177], ["It's okay. Scratches an itch that other RPG games sometimes fail to achieve. The weighting of the weapons and the monster's attacks feel great. The story-line is decent. World-building is excellent. Not overly complicated but still in-depth enough to make you feel like you are progressing naturally with the crafting and levelling systems.", 0.5068181753158569], ["It is a very good game. Some parts are tedious but those are few and far between.", 0.5068181753158569], ["I don't know where to start. I always watched Monster hunter franchise but never really got my eyes, but then I saw it was on sales, and.. everyone know what comes after. Hour and hour of pure and quality entertainment. This is just so good. Even the grind is amazing, and I really like a grind. Can't stop playing and I can't wait for Iceborn.\n10/10.", 0.5068181753158569], ["Very cool monsters and weapons, story is meh, graphics is good. 8/10", 0.5068181753158569], ["as someone who didn't enjoy MMO style gameplay or souls like gameplay this game is a no from me.", 0.5], ["amazing, beautiful and fun", 0.5], ["My first encounter with this series was Monster Hunter Rise. I played it on Xbox Game pass a while back lowkey didn't like it, but one of my friends told me to get this game, i was a little reserved because of rise, but after playing this game even for a short while, Ive come to like this game. Really excited to play Wilds.", 0.5], ["REALLY damn good game, crazy amount of content, so much to do. The ecology and monster behavior in this game is HONESTLY incredible to me, as someone who's a nerd about biology, and it's a shame to see proceeding games not have the same effort put into this area. I'm conflicted on the fact that this game begins the \"new\" style of monster hunter, but I think it's fine enough in this game and streamlines enough to be nice but not so much as to trivialize crucial parts of the monster hunter formula (cough cough, wilds). All being said, maybe get a shader overhaul because EVERYTHING in this game is blue, unnatural, washed out lighting, and it's extremely offputting to me personally. As well, if you're attached to the older style of monster hunter, just get Generations Ultimate. It has a similar amount of content, if not *more* than World.", 0.5], ["Great game, only complaint is the amount of stun lock there is in some fights. Gets frustrating a bit", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/582010/header.jpg?t=1734656748", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/582010/capsule_231x87.jpg?t=1734656748", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/582010/capsule_184x69.jpg?t=1734656748"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.monsterhunterworld.com/"}, "developer": "CAPCOM Co., Ltd.", "owners": "10,000,000 .. 20,000,000", "tags": ["Co-op", "Multiplayer", "Action", "Open World", "RPG", "Character Customization", "Third Person", "Adventure", "Fantasy", "Action RPG", "Difficult", "Singleplayer", "Exploration", "Great Soundtrack", "Replay Value", "Atmospheric", "Hack and Slash", "JRPG", "MMORPG", "Souls-like"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Portuguese - Brazil", " Polish", " Traditional Chinese", " Japanese", " Korean", " Russian", " Simplified Chinese", " Spanish - Latin America"], "concurrent_plays": 30437, "number_of_achievements": 100, "categories": ["Single-player", "Multi-player", "Co-op", "Steam Achievements", "Steam Trading Cards", "Partial Controller Support", "Steam Cloud", "Stats", "Steam Leaderboards", "Remote Play on Tablet", "HDR available", "Family Sharing"], "genres": ["Action"], "short_description": "Welcome to a new world! In Monster Hunter: World, the latest installment in the series, you can enjoy the ultimate hunting experience, using everything at your disposal to hunt monsters in a new world teeming with surprises and excitement.", "long_description": null}