{"name": "Tales of Escape", "app_id": 587860, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 48, "negative_reviews": 10, "reviews": [["This is a great game for co-op.  If you have a friend or two (or five!) with VR, or even if you have a non-VR friend that is willing to play it with you, I can't recommend it higher.  For the price, it is a great time hanging out with friend and solving puzzles.  \n\nIt's cheaper than a fast food combo and literally about a fifth of the price of an actul escape the room experience.  It's a great value for the cash with some really nice looking environments and some great clever puzzles. The entire experience took us almost two hours, and there is more DLC coming.  For under $6 a great value. \n\nThe developers have even integrated an optional hint system that unlocks new hints that you can view after a certain amount of time, which is great if you get stuck and don't want to let the experience drag on.\n\nOne minor recommendatino to the devs and for playres: increase the default graphics settings before starting.  We were almost finished with the game before we discovered you can increase the fidelity making it far easier to read all the clues (not to mention enjoy the environment).  The standard setting should be at least medium or high, but it defaults to the lowest settings making everything look extremely blurry.\n\nLooking forward to the DLC!", 0.7271261811256409], ["This game is the ideal co-op game for playing over the internet. It's fun, like a real escape room, though the actual solution can be vague at times. It is really exciting solving puzzles with friends.\n\nLook, let's be fair, if you expect the latest in graphics technology, then you're not going to find it here. That doesn't matter however, because this game just is fun for what it is. I would definitely recommend trying it, though I would invite at least one friend to your game, as playing it alone is only half of the experience. \n\nThe first level is available for free anyway, so just try it.", 0.6710846424102783], ["Bit disappointed with this for the one reason, I played it in non-VR mode and there is no gamma control, I could hardly see my way around and certain areas are just plain invisible. Ended up having to play at night only with all lights off and still not great.", 0.5338114500045776], ["Hard yet fun game. Riddles were difficult to solve. Would like more maps but til then i am happy with the game in its current state. Definitely worth the $5 except for the Ryyhargon\nRyyhargon's are not pleased woth the mine level..\nAll jokes aside, this game is good if your willing to buy the dlc. the free to play level feels the same thrughout the entire level where as the cold as ice dlc is great. Each puzzle was different and at the end i felt a sense of accomplishment. the only issue with the cold as ice dlc i had was both times ive played it with friend the scales broke and gave the wrong readings but other then that its a solid llevel.", 0.5833333134651184], ["A fantastic online co-op game to play with your qt best friend on a late Friday night. The riddles were challenging enough to give you that 'A-ha' moment. There is only 1 level so far but the game is worth the price and the memories! I'm definitely looking forward to DLC, if any.", 0.5752226114273071], ["Obviously not of the same quality as the we were here games but this was a great little bit of fun for me and my friend! Managed to complete all of the levels in one run :)", 0.5], ["Unnatural graping controls. But the most important ... Unlogic Puzzles! Not what we hoped it to be, sadly!\n\nBut a great Developer who takes care and action! Maybe in a little while this could get really good.\n\nMy friend and I played on Oculus CV1 with Touch Controls and a 2-3 camera setup.\n\nThe Puzzles\nWe could not get pass the first door. That was quite a frustrating experience! We felt there where not enogh clues around to figure out the door code. We did not use the hint system in the game though. \n\nThe Controls\nHaving to hold the Trigger for a while to grab something felt quite unnatural. We ended up wanting the Oculus grip buttons to be instant graping for stuff. And the front triggers to be teleport. Last but not least, a naturaly usable keypad on the locked door would feel much better. Seeing your real hands instead of controlers could also be nice.", 0.5489316582679749], ["With SteamVR we have seen a lot of these lately but this is the first one I know of that has multiplayer.\nCompared to what you would pay for a real life escape room, this makes much more sense, especially considering\nthat if you have a Vive, it's pretty much the same. It's cool that I can play with friends that don't have\na headset.", 0.5215710401535034], ["If you are looking for a smart puzzle game at a good price this is the game for you. I really liked the dark theme, overall had nice riddles that need you to think and observe very carefully, blink or you miss it! For maximum fun I recommend playing it coop with your friends. Cant wait trying it in VR and looking forward for the next room", 0.5106761455535889], ["I love escape rooms irl and after playing some I went searching for video games like this. Most I have found have been singleplayer experiences which, for me, misses the point, so I am very much liking this! The game lasts just short of an hour which is what I am used to for these kinds of games, the puzzles can be tricky but as with irl ones, this is largely dependent on the player.", 0.5106761455535889], ["Great game! Tales of Escape is a puzzle game and a very entertaining one. The game mechanics are intuitive and combined intelligently to create very interesting levels. \nI have not finished the game yet but the difficulty is well-balanced so far (which is the most important thing to create a GREAT puzzle game in my opinion!)\nSpecial note : the soundtrack is very cool :D\n\nRating : 89%", 0.5081967115402222], ["The riddles were challenging! Good job with the gameplay even though I think the game is made for the VR experience! \n\nKeep it up!", 0.5531160235404968], ["this game was awesome with 4 friends!  just too short, i need more levels stat--i'll pay anything!!!!!!!!!!!!!!!!!!!!", 0.5524816513061523], ["Very buggy, muddy visuals and \"puzzles\" with little logic to them.", 0.5], ["Yes it is cheap but it is also very bad. Extremely low effort.", 0.5], ["It's hard to pick a favorite room, but one thing is certain - they are all a lot of fun. The atmosphere is amazing and immersive. All room puzzles made you think outside the box, and sometimes the answer is right in front of your nose inside a box. I can only count a few times where a hint took the place of finding a clue. So far, this has to be my favorite escape room series. Looking forward to more!", 0.5], ["I loved this game and all the DLC.  Wish the Developer would make more DLC.  (HINT) Some puzzles are hard to read but after I changed the lenses in my Vive they are fine.", 0.5], ["Fun game! Especially for those who enjoy solving puzzles. It's great to play with a friend, and makes it fun to work together. I really hope they expand on this game and I wish there were more games out there like this. This is a fun game to buy!", 0.5], ["I played this game with a friend. We encountered a few game-breaking bugs but these were quickly fixed by the developer. Now that the game is working I definitely recommend it. The riddles are interesting and there is also a storyline that can be pieced together. There is currently only 1 level that is meant to be completed within 1 hour. It is maybe a bit short, but we definitely had fun and the VR support made our experience even better.", 0.5024875402450562], ["This is a very nice game. I like a lot the general concept, the blood stains and the cold atmosphere that is used mostly in the two first rooms. The background sound is amazing and varies a lot which makes the game more stressful. Personally, I would add more blood everywhere and some meat parts(e.g. frozen pigs hanging in the second room) to make the player start feeling anxious. In general, I liked the game very much. Well done, guys! Give us more rooms!", 0.4947104752063751]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/587860/header.jpg?t=1737460268", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/587860/capsule_231x87.jpg?t=1737460268", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/587860/capsule_184x69.jpg?t=1737460268"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.onskull.com/talesofescape"}, "developer": "OnSkull Games", "owners": "100,000 .. 200,000", "tags": ["Puzzle", "Multiplayer", "Free to Play", "Co-op", "Horror", "Online Co-Op", "VR", "Adventure", "Indie", "First-Person", "Mystery", "Funny", "Exploration", "Action", "Singleplayer", "Hidden Object", "FPS", "3D", "Investigation", "Controller"], "languages": ["English", " Greek", " Polish", " Russian", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Portuguese - Portugal", " Simplified Chinese"], "concurrent_plays": 18, "number_of_achievements": 16, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "Tracked Controller Support", "VR Supported"], "genres": ["Adventure", "Casual", "Indie", "Free To Play"], "short_description": "&quot;Tales of Escape&quot; is a series of 6 person multiplayer escape room adventures for virtual reality or desktop pc! Gather your friends and choose a story to play!", "long_description": null}