{"name": "Ricochet", "app_id": "60", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£4.29", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 2448, "negative_reviews": 398, "reviews": [["RICOCHET: THE. SINGLE. GREATEST. VIDEO GAME. EVER. MADE.  \n\nI am NOT being ironic. I am NOT exaggerating. I am speaking in absolute, undisputed, objective FACTS that not even the gods themselves could deny. Every single game that has ever existed before or after Ricochet is nothing but a cheap, uninspired, soulless IMMITATION of its sheer, unrelenting PERFECTION.\n\nYou like Counter-Strike? Lame. You like Half-Life? Cringe. You like DOOM, Halo, Elden Ring, or whatever other weak, pathetic excuse of a game you've attached your miserable existence to? FORGET THEM. Throw them in the trash. They are NOTHING compared to Ricochet, the magnum opus of gaming, the epitome of peak performance, the culmination of human evolution itself. \n\nAND DON’T EVEN GET ME STARTED ON THE AESTHETIC. \nThat neon-lit cyber dreamscape, a world so ahead of its time that even TRON looks like a kindergarten crayon drawing. The jump pads—ohhh the jump pads!—so elegantly placed, turning every single match into an orchestrated ballet of raw, unfiltered skill.  \n\nThere has NEVER been a game like Ricochet, and there NEVER WILL BE. The industry PEAKED in 2000, not because of Counter-Strike but because of RICOCHET, and has been in a downward spiral ever since. Every game developer, every studio, every so-called \"AAA masterpiece\" has done NOTHING but chase the unachievable perfection of Ricochet and fail MISERABLY.  \n\nYou say \"gaming is in a bad state.\" I say no, gaming is in a post-Ricochet dark age, and we are nothing but lost souls wandering in its shadow.\n\nIF YOU HAVE NOT PLAYED RICOCHET, YOU HAVE NOT LIVED.   \nSTOP WHAT YOU'RE DOING. DOWNLOAD IT. PLAY IT. BECOME ENLIGHTENED.\nOnly then will you understand. Only then will you truly game.", 0.6402953863143921], ["The best game ever created period. Newgens will be cured of their brainrot if they play this.", 0.5370370149612427], ["One of the best games I think I'll ever play. The gameplay feels super smooth and the story is compelling. 10/10 would play again", 0.523809552192688], ["After owning this game for 6 years, I now just had my first full-length Ricochet match, and won it too. This game is mad fun!", 0.5095368027687073], ["I was a autotuned ricochet man before becoming evil ricochet man for 2 and a half hours for ricocheting the bar\r\nPeak game", 0.5], ["Fun and somewhat janky goldsrc game. There's actually a bit of depth here, because you get two types of shots alongside with the ability to directly hit someone to push them off. Shots also ricochet (hehehe) off walls and come back to you, so you can genuinely aim shots so that they hit people as they come back. So, there's actually some strategy, which I like.\n\nThere's basically only one Tron-looking map by default in the game, though people were able to add their own maps in their community servers. Some maps use platforms alot less than others, which lead you to solely using your right click - and most of the time your weaker left click is pretty useless. Maybe that's a little unbalanced but it works fine, besides it's not really the way the game's supposed to be played - the game was moreso designed that you hit people off platforms in its only real map. I honestly enjoy the maps without the platforms and jump pads the most, though. The default one doesn't do much for me.\n\nProbably the most chaotic thing though are the *unrelenting* sound effects you hear, because they don't get quieter the further you are from them. So basically every decently populated server has a massive blanket of noise while you play, and I'm pretty sure everyone's ears were ringing. Tbh, it's the best part of the game. The chat was also hilarious, and there was some guy using a vocoder in the voice chat of one of the servers too. Honestly everyone playing had a funny ass sense of humor in general.\n\nI'm glad the community decided to revive the game for a little bit today, it's probably the best time ever to play this. I also hope Valve releases the goldsrc SDK so people can try to properly revive this and other games, which I think would be pretty enjoyable. Peace out Ricochet Nation", 0.5], ["Its a dead game with not much to offer either, you could maybe get this for really cheap to play with some friend, but even then its not worth it.", 0.43478259444236755], ["masterpiece, 10/10, peak,  best game to ever be released", 0.5], ["idk what y'all are on about. this game unironically fucks", 0.5132019519805908], ["Doesn't look bad at all. No players online most of the time so consider that before buying.", 0.5], ["the best Valve game ever, no doubt", 0.5], ["absolute cinematic masterpiece", 0.5375375151634216], ["ricochet cured my cancer and saved my dog", 0.5], ["PLEASE buy this game i will give you my life my king", 0.5], ["Might be one of best valve games", 0.523809552192688], ["best Valve's game", 0.5579793453216553], ["its so bad that its good '<>_<>' (literally it is)", 0.5], ["She AIR STRAFE on my DISC til I RICOCHET", 0.5], ["Ricochettin it", 0.5], ["good", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/60/header.jpg?t=1745368568", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/60/capsule_231x87.jpg?t=1745368568", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/60/capsule_184x69.jpg?t=1745368568"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "Valve", "owners": "5,000,000 .. 10,000,000", "tags": ["Action", "FPS", "Multiplayer", "Classic", "First-Person", "Sci-fi", "Shooter", "Space", "Cyberpunk", "Psychological Horror", "3D", "Memes", "Retro", "Platformer", "Old School", "Conspiracy", "Cult Classic", "Competitive", "Sports", "Great Soundtrack"], "languages": ["English", " French", " German", " Italian", " Spanish - Spain", " Korean", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 3, "number_of_achievements": null, "categories": ["Multi-player", "PvP", "Online PvP", "Valve Anti-Cheat enabled", "Family Sharing"], "genres": ["Action"], "short_description": "A futuristic action game that challenges your agility as well as your aim, Ricochet features one-on-one and team matches played in a variety of futuristic battle arenas.", "long_description": null}