{"name": "Attack on Titan 2 - A.O.T.2", "app_id": 601050, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£39.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 16, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 3203, "negative_reviews": 212, "reviews": [["Awesome game based on a really cool anime. The controls take a bit of getting used to but after that you'll be flying through the air slaughtering titans in no time.\n\nThere's a bunch of different game modes and a lot of ways to upgrade not only your main character but all the characters from the anime as well. Between each game mode it pretty much covers the whole story.\n\nIf you enjoyed the anime you should definitely give the game a try!", 0.6986302733421326], ["This Yeager guy is pretty chill. Id be pretty surprised if he genocides 80% of the world.", 0.7305840253829956], ["[h1]Thrilling, immersive, and a cool new angle on the anime.[/h1] \n\nAOT2 was a super fun ride. gameplay is fast, flashy and super satisfying — swinging around and taking down titans just never gets old!\n\nThe city hub between missions is a nice touch — gives the game a bit of breathing room and added immersion with special interactions between the characters. What I enjoyed the most was reliving the most epic anime scenes in high-quality CGI with the original voice actors. It really brought the story to life, especially with my own Scout character added into the mix. \n\nThe pacing through the main storyline is excellent and the voice acting absolutely stellar. It doesn't bring anything new but feels more like a much welcomed refresher on the Masterpiece that is the writing of Attack On Titan through seasons 1-2. \n\n(And season 3 if you get the DLC but it's not as good as the main game due to lack of CGI cut scenes, no hub and no custom character)", 0.523809552192688], ["If you watched the anime, you already know what to expect in gameplay-wise enemy type for the rest of your time (unless you get in DLC and fight humans for a tad bit). And if you didn't, you get a nice summary in story mode.\r\nThe ODM fast movements are good, get yourself in the story is good but can't engage the short king.\r\nFor an anime game it looks great and is fun.", 0.523809552192688], ["One of the best anime game. \nAOT based story makes it even better. Also, I like it how I could save the characters that died in the main story line and used those characters. \n\nPETRA NUMBER ONE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", 0.5], ["The game is so well made and way more thought out than any other anime game out there! I think the coolest thing is that the company had to almost reanimate scenes from the show and make it cut-scenes in 3d!\r\nAnd it is sooo much better than the 1st game! Customizable characters, bigger story, and much more!\r\nI love this game and I will glaze it to the maximum.", 0.5], ["Fun Gameplay Loop (Probably gets boring after a while....still waiting for that while to hit) -> Check\nInserting Yourself into Your Favorite Anime -> Check\nMore Features Than You'd Ever Expect for an Anime Adaptation -> Check\nCo-Op and Online Versus -> Check\nODM Gear That Makes You Feel Like Spiderman -> Check\n\nWhat more could you want? Besides more of it..\n\n10/10", 0.523809552192688], ["played this after finishing AOT to cope--a bit janky but fun", 0.5], ["Controls take a lot of getting used to\nFun once you get the hang of it though", 0.5], ["real friends were the gifts we gave them along the way", 0.5], ["retake trost was the only good arc in the storyline", 0.4761904776096344], ["I liked how you can be a part of the amazing story of Attack on Titan\r\n", 0.5], ["very good", 0.5], ["SASYGEO", 0.5], ["yes", 0.5], ["e", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/601050/header.jpg?t=1729050891", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/601050/capsule_231x87.jpg?t=1729050891", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/601050/capsule_184x69.jpg?t=1729050891"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.koeitecmoamerica.com/attackontitan2/finalbattle/selectlang.html"}, "developer": "KOEI TECMO GAMES CO., LTD.", "owners": "200,000 .. 500,000", "tags": ["Action", "Anime", "Character Customization", "Multiplayer", "Gore", "Open World", "RPG", "Singleplayer", "Co-op", "Online Co-Op", "Adventure", "Third Person", "Nudity", "Story Rich", "Hack and Slash", "Horror", "Great Soundtrack", "Sexual Content", "JRPG", "Musou"], "languages": ["English", " Japanese", " Korean", " Traditional Chinese", " French", " Italian", " German", " Spanish - Spain", " Spanish - Latin America"], "concurrent_plays": 181, "number_of_achievements": 40, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Partial Controller Support", "Steam Cloud", "Family Sharing"], "genres": ["Action"], "short_description": "Abandon all fear. Attack on Titan 2 is the gripping sequel to the action game based on the worldwide hit anime series &quot;Attack on Titan.&quot;", "long_description": null}