{"name": "House Flipper", "app_id": 613100, "platforms": {"windows": true, "mac": true, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£20.99", "final_price": "£6.29", "discount_percent": 70, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 40079, "negative_reviews": 2427, "reviews": [["This game is surprisingly addictive and relaxing. I love the satisfaction of renovating and decorating houses from scratch. It's a perfect mix of creativity and problem-solving, and it’s super fun to see the transformation unfold. Highly recommend!", 0.6104847192764282], ["This game is quite enjoyable and relaxing. The jobs are fun, the properties are great. The DLC's and the Furniture pack have added quite a bit more to the game. While they have House Flipper 2, House Flipper 1 is not put to the wayside and abandoned. There is always something happening with this game. There's just something about cleaning up a property, restoring it, changing it, and making it yours is always rewarding. I spend my time buying up properties and creating places that I would actually picture someone living in. There's something about tearing down walls, building up new walls, throwing on a fresh coat of paint and just going wild designing the perfect home. The Luxury, Pets, and Farming DLC's add quite a plethora of properties to play with. You can have the option of having a little fur baby with the Pets DLC, but you don't have to have one if you don't want one (though there are achievements for having pets). Having pets is quite fun as it adds yet another dynamic to the game. But back to the point of this game I can literally spend hours just making fantastic properties with wonderful yards (amazing gardens) and beautiful homes & offices.", 0.5688689947128296], ["This game is actually really fun. I have enjoyed playing and it is very relaxing and can be addicting. If you are a person who loves architecture, interior design, cleaning, and organizing. This game is definitely for you. It is a great replacement for the Home Renovator game. I have had a couple game crashes while playing that caused me to restart the game, but overall great game.", 0.5289855003356934], ["Never used to have an EULA when I first bought it, now the devs want me to agree to give up my ownership of a game I paid for so it can be \"licensed\" instead ie converted to a long term rental. The greed in this action is so beyond anything reasonable its unbelievable. Not worth the price tag to not even get to own the game Im paying for.\n\nFor anyone still interested just be sure not to ever look at repack sites for a copy of House Flipper and all its DLC. This may not be legal in your region and its so easy to do, just downloading the repack and installing with the click of a few buttons, you could do it by accident.", 0.523809552192688], ["Super satisfying game to play for many hours to relax. Would recommend if you enjoy renovation games.\r\n", 0.523809552192688], ["House Flipper (2018)\r\n\r\nWonderful game where you get to buy run down houses and you get to renovate it anyway you like. You can choose to renovate a house to live up to certain client's expectations to sell a house for more money. There are plenty of different houses to buy and renovate. There are some classic houses like Walter White from Breaking Bad's house, the Room from Silent Hill 4 and the Kami House from Dragonball Z. If you are looking for a fun, relaxing game just to pass the time, this is a great game to get. You buy houses and you renovate them. Easy.\r\n\r\n8/10\r\n\r\n“A home is never finished, it’s only saved from decay.”\r\n― Victor LaValle, Lone Women", 0.5070422291755676], ["House Flipper is a nice, turn-off-brain, distraction and while it is very rough around the edges, it is pretty fun.", 0.5070422291755676], ["Where did the day go...\r\nRelaxing, Fun and with all the DLC there is plenty to do for everyone.", 0.5070422291755676], ["Lets be honest. Its a game from 2018 and is as ugly and clunky as you would expect it to be.\n\nI got this on sale for around $15 (Base + Garden DLC) and its as mystifyingly addictive as others have described.\n\nWho would have known?", 0.5], ["It is fun and relaxing. If you have a fear of bugs that's ok, because you can change bugs to glass in the settings.", 0.5], ["This is my third or fourth time playing House Flipper. It's a nice quiet game that you can really get zoned into. Additions to the furniture, decor and paint/flooring options have definitely improved from when I first started playing a few years ago.", 0.5], ["This game allow me to live vicariously through the life of someone who can actually afford a house. In fact, they can afford multiple.", 0.5], ["The base game is brilliant on it's own. The DLC takes things to a new level, as it should! Honestly worth the investment. Would be a great learning tool for kids to try out designing, building and home maintenance.", 0.5], ["Really good game! There are plenty of jobs to do to ensure money and heaps of properties to buy and sell once renovated, I love that you can do everything at your own pace.  I highly recommend this game as I downloaded it a day or two ago and have already spent 13 hours playing the game.", 0.5], ["Really fun especially good for playing while listening to podcast or watching something only bad thing is I dont think the dlcs should be dlc the cooking yeah but gardening n some furniture i feel like u should get for free", 0.5], ["If you like the house building part of The Sims, or of you were the weird kid who played on your dad's AutoCad software offline while your mom used the landline, this game is for you.  The main jobs are lenient on completion percentage; and the flipping & selling portion of the game is seemingly limitless.  I lost an entire day to this fake job.  I'm serious, I average about 6 hours working on one house, it's insane.  I wasn't mentally prepared for the random jumpscare, and frankly the entire atmosphere is very isolating and you constantly feel like you're being watched, but it's still worth it.  Makes flipping houses seem like a fun job.  I know it's a lie, but it's a beautiful one.", 0.5], ["House Flipper is hands down one of my favorite games, well deserving of all the praise it receives. The blend of renovation, design, and management gets you hooked from the moment you pick up that hammer and lay down that last tile. It allows you to unleash your inner designer and landscaper, with every DLC expanding the experience by adding new content and improvements.\r\n\r\n**It's also incredibly relaxing and therapeutic, pulling me out of those long workday slumps. In fact, this game got me through the COVID lockdown. What the developers have created here is truly amazing, and I am happy to be a supporter for them. I'm super eager to add House Flipper 2 and the long awaited Forgery Craft to my library.", 0.5], ["if you love fun simulation games, highly recommend this one. its almost always on sale (a huge plus) and its just overall just a fun game. the fps is so smooth, and the gameplay is like how it would be irl kinda.", 0.5], ["Easily my favourite game. Highly recommend. Great graphics, controls, and the dlcs are so affordable when on sale. Switched from the sims 4 to this and haven't regretted once.", 0.5], ["At first, I bought this game only because I saw it on sale and I used to watch a couple of videos about this game years back. When I turned it on for the first time - I literally fell in love. It's a game you'll get lost in for HOURS, DAYS, MONTHS... I'm telling you. If you're looking for the perfect blend of creativity, relaxation, and rewarding gameplay, House Flipper is a must-play—and honestly, it's my favorite game for a reason.\r\n\r\nAt its core, House Flipper is about renovating and transforming homes, but it offers so much more than just flipping properties. Also, the achievements are fun to get.\r\n\r\n🌾 Farming & Animals\r\nOne of the most enjoyable aspects of House Flipper is the farming system. You can grow your own crops, build and manage a farm (sell your goods), and even ride horses around your property! It doesn’t stop there—you can collect resources from animals like chickens and cows, which adds a whole new layer of gameplay. Whether you’re gathering eggs or just enjoying the peaceful rhythm of farm life, it’s deeply satisfying.\r\n\r\n🐶 Pets\r\nYou can have pets—and not just one! You can adopt cats, dogs, and even more exotic animals, give them custom names, pet them, and take care of them in your home. Watching your furry friends roam around a freshly renovated living room is just the best feeling.\r\n\r\n🌺 Garden Design\r\nIf landscaping is your thing, the garden features are incredible. There’s a wide variety of flowers, shrubs, and decorative items to create truly stunning outdoor spaces. Whether you're into structured Zen gardens or chaotic cottagecore flower beds, there's room for your creativity to flourish.\r\n\r\n🛋️ Luxury & Interior Design\r\nThe luxury DLC lets you go full HGTV. You can paint and customize furniture, restore high-end apartments, and even fulfill specific requests for picky clients. It’s super rewarding to turn a neglected space into a dream home, especially when you're matching a client's personality and desires.\r\n\r\n🍽️ Dine Out\r\nYes—you can even run your own restaurant! There’s an entire system for setting up your eatery, discovering and unlocking new recipes, and turning it into a thriving culinary hotspot. From kitchen layouts to table settings, everything is in your control.\r\n\r\n🧰 Workshop Support\r\nAnother major win for House Flipper is the amazing community support through Workshop items. There are hundreds of mods and user-created content available. These mods keep the game fresh and help expand what’s possible.\r\n\r\n💸 Price\r\nFor all the content packed into this game, the price is extremely reasonable. Whether you grab the base game or go all-in with the DLCs, like I did, it’s one of the best value-for-money games out there. The frequent discounts on bundles make it even more appealing.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/613100/6cee40fe293f0bab47534e78bcda64487902efc1/header.jpg?t=1745594047", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/613100/446e6c6faa35dd9303ae58753b532bdb4ff42960/capsule_231x87.jpg?t=1745594047", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/613100/446e6c6faa35dd9303ae58753b532bdb4ff42960/capsule_184x69.jpg?t=1745594047"}, "support": {"support_website": null, "support_email": null, "game_website": "http://houseflippergame.com/"}, "developer": "Empyrean", "owners": "2,000,000 .. 5,000,000", "tags": ["Simulation", "Design & Illustration", "Building", "Singleplayer", "Relaxing", "Sandbox", "Casual", "Education", "Immersive Sim", "Multiplayer", "First-Person", "Management", "Economy", "Family Friendly", "Base-Building", "3D", "Replay Value", "Realistic", "Indie", "Moddable"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Polish", " Russian", " Simplified Chinese", " Czech", " Japanese", " Korean", " Romanian", " Turkish", " Hungarian", " Portuguese - Brazil", " Traditional Chinese", " Ukrainian", " Greek", " Dutch", " Norwegian", " Portuguese - Portugal", " Spanish - Latin America"], "concurrent_plays": 2607, "number_of_achievements": 96, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Workshop", "Steam Cloud", "Remote Play on Tablet", "Family Sharing"], "genres": ["Indie", "Simulation"], "short_description": "House Flipper is a unique chance to become a one-man renovation crew. Buy, repair and remodel devastated houses. Give them a second life and sell them at a profit!", "long_description": null}