{"name": "Portal 2", "app_id": "620", "platforms": {"windows": true, "mac": false, "linux": true, "controller": "full"}, "price": {"currency": "USD", "original_price": "", "final_price": "$9.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 155871, "negative_reviews": 1820, "reviews": [["Portal 2 Review\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ SpeedRunners Only\n☐ ~~Features~~\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10", 0.8356645703315735], ["My God, VALVe never disappoints.\n\nIt's actually amazing how good this game is especially considering the fact that it's usually on sale for like a dollar. When i first played the original Portal, i did like the game but i wouldn't say i loved it. it was a neat little game that fit it's small scale very well but for me, it didn't have that \"uumph\" factor a lot of VALVe games have. No matter how much you liked the original Portal, you have to admit the final product did feel like a side project VAVLe didn't put too much effort into compared to their other games like Half Life 2 or Left 4 Dead.\n\nHere? They completely threw that. There's sooo many new ideas here, paced evenly so that all the new mechanics get their time to shine without it feeling overwhelming. The environmental storytelling, while not as eerie as the first in my opinion, sells it's fantasy much better than the first with all the different moods they tried to evoke here like the dilapidated and broken down test chambers from the first game, or getting to see [spoiler]Cave Johnson go from a young aspiring scientist to a desperate and broken shell of a businessman by listening to J.K Simmons wonderful audio logs.[/spoiler] The characters are so brilliantly written, they feel and act like real people and that trademark wit and sass from the first game is still here without taking away from the serious moments in the game. My only minor complaint is that i wish the game had more variety in how you could tackle the puzzles you're given because i feel like that would have given it more replay value and it would've let you be able to solve the puzzles faster in your own way.\n\nNonetheless, while i personally don't think this is VALVe's best game (i still think that title does to Half Life 2) the feats this game accomplished should not at all be ignored. Seriously what are you waiting for? The game on it's usual price is cheaper than a family meal and on sale it's the price of a KIt-Kat bar. Go buy it. 10/10", 0.553415060043335], ["Played this after the first game, crazy graphics, the mechanics haven't really changed but still great game", 0.553415060043335], ["Great game. I'd recommend it purely for the voice lines by Wheatly. The entire storyline is goated, but man that robot is hilarious.", 0.523809552192688], ["this is a great game, i have been meaning to play the main story for a while now, and let me say that the puzzles  are  really well crafted and get more complicated as you progress\r\n\r\nDO NOT CHEAT!!!", 0.52173912525177], ["Lovely game that continually keeps you entertained.  Puzzle solving with a good story.", 0.52173912525177], ["It took 8 hours to finish but it took a long time to get rid of happiness that felt like a void in the middle of my chest. After the first game, the story of Glados and this place made my mind start understanding. The new features such as liquids, blue road and others made puzzles a lot interesting and harder than i thought. The quality of the game were beautiful. You can even play with your friends, that was a feature i didn't guess before playing the second game. A worthy game to pay without thinking.", 0.52173912525177], ["Portal 1, but more! Portal 2 builds off of everything that Portal 1 was and is a great successor to the original. Again, simple, timeless, fun. Would highly recommend.", 0.5128205418586731], ["Portal 2 is the perfect sequel to Portal 1 and expands its story and world to a wide scale. It immerses you well into the setting of the Enrichment Center and introduces you immediately to one of my personal favorite (and fan favorite) characters ever Wheatley who's companionship and goofy antics makes him a joy to have in the game. The new mechanics make solving puzzles fun and challenging at the same time and allows for more diversity in the testing chambers than previously before. The introduction of Old Aperture and the way it is used to purvey the beginnings and lore of the facility is done in a smooth and fascinating way. On top of all this, the visuals that go alongside the game are surprisingly good for their age and help you appreciate the vast and complex features of the facility. The Co-op content that happens after the main game's story has an insane amount of fun and well made levels. They do a very good job of including the challenging puzzles in tandem with making them fun to play with a friend. Overall, Portal 2 is an amazing experience that is well worth the time, effort, money, and brain power you spend playing it.", 0.510869562625885], ["awesome! best game ever, the physics are sick, the mechanics are awesome, and the story... next damn level!", 0.5], ["pros:\n▪ Unforgettable game of the year\n▪ Very decent graphics\n▪ Puzzling but entertaining\n▪ Best sounds\n▪ #WELOVEVALVE\n▪ British Robot\n▪ #PORTALISLOVE\n\nCons:\n▪ Can't sex with GlaDOS\n\noverall score: 100/100", 0.5], ["All time great puzzle game. Simple yet captivating mechanics and very fun coop playthrough.", 0.5], ["Same as Portal 1 I felt like I was playing for longer than 6 hours, some of the puzzles are really tough. The soundtrack or atmospheric music they have fits the game perfectly.", 0.5], ["Amazing game. Great experience. Cool graphics. I highly recommend it to everyone, amazing second game that makes the first game has an unforgettable story.\r\n\r\n\r\n!!!SPOILERS AHEAD!!!\r\n\r\nGlados and Wheatey are great characters. Unique charisma, good robot-look. The plot twist is amazingly made, the amount of good jokes and fun stuff makes the game the perfect example of the word \"Amazing\".\r\n\r\nHighly recommend!!!!!!", 0.5], ["its fun but sometimes buggy the little conveyer one with the crap turret doesent work for me", 0.5], ["Love the series and the community and everything:3", 0.5], ["quirky and fun a classic\n\nthe co op mode is probably good but it requires a friend so its pretty impossible to finish", 0.5], ["Awesome puzzle game by Valve. Good for beginners. Has a great story and wonderful humor", 0.5], ["The best first person story puzzle game period. This game has been around long enough that there are more spin-offs, mods, and community maps, that you could spend the rest of your life playing this game on not even experience half the available content. If you have any desire to laugh or enjoy yourself, you should absolutely play this game. If you don't want to be happy or laugh, then boy does your life not sound that great, you should try this game instead of doing that.", 0.5], ["One of the best games I have ever played.  Sets the bar for puzzle games while providing a decent story and plenty of laughs along the way.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/620/header.jpg?t=1745363004", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/620/capsule_231x87.jpg?t=1745363004", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/620/capsule_184x69.jpg?t=1745363004"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.thinkwithportals.com/"}, "developer": "Valve", "owners": "10,000,000 .. 20,000,000", "tags": ["Platformer", "Puzzle", "First-Person", "Dark Humor", "Story Rich", "Puzzle-Platformer", "Funny", "Female Protagonist", "3D Platformer", "Action-Adventure", "Action", "FPS", "Co-op", "Physics", "Sci-fi", "Level Editor", "Science", "Comedy", "Atmospheric", "Adventure"], "languages": ["English", " French", " German", " Spanish - Spain", " Czech", " Danish", " Dutch", " Finnish", " Hungarian", " Italian", " Japanese", " Korean", " Norwegian", " Polish", " Portuguese - Portugal", " Romanian", " Russian", " Simplified Chinese", " Swedish", " Thai", " Traditional Chinese", " Turkish", " Bulgarian", " Greek", " Portuguese - Brazil", " Spanish - Latin America", " Ukrainian"], "concurrent_plays": 2310, "number_of_achievements": 51, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Shared/Split Screen Co-op", "Shared/Split Screen", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Captions available", "Steam Workshop", "Steam Workshop", "Steam Cloud", "Stats", "Includes level editor", "Commentary available", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Remote Play Together", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "The &quot;Perpetual Testing Initiative&quot; has been expanded to allow you to design co-op puzzles for you and your friends!", "long_description": null}