{"name": "Blade and Sorcery", "app_id": 629730, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£24.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 44569, "negative_reviews": 1385, "reviews": [["> boot up the game for the first time  \n> have fun  \n> complete the story  \n> either get bored and quit or continue  \n> go on youtube and see if there's any content  \n> sees realistic shit  \n> decides to give it a try  \n> downloads mods to fuel your addiction  \n> head into sandbox  \n> fail miserably  \n> decide to dedicate their time to this game  \n> practices combat in this game  \n> soon after, ai is a joke at this point  \n> become a medieval soldier in combat  \n> you stand no chance  \n> practice your magic skills  \n> become a built druid  \n> go for hand-to-hand combat  \n> knows the most effective hand-to-hand combat techniques  \n> become a professional japanese martial artist  \n> arms start to swell, however, you are growing stronger at a rapid rate  \n> your footwork is like a choir, beautiful\n> you are a super soldier  \n> you become who you want to be  \n> before you can take a fresh breath, your headset dies  \n> plug in  \n> too lazy to wait  \n> so you invade a nearby castle  \n> take over in a matter of minutes  \n> you begin to form an army, growing it and thriving  \n> nobody can stop you now  \n> try to take on the final leader of this world  \n> fight the final wizard near your power of magic  \n> but you came out on top  \n> you sit on your throne while everyone bows down to you  \n> you make a goal to take on every greek mythical creature  \n> visit zeus in the clouds  \n> call out  \n> he thinks you're weak and puny  \n> so you show him who's boss  \n> after an intense battle, you finally return home, becoming an everlasting god  \n> generations will know you  \n> after pondering on your throne trying to figure out what to do  \n> your headset finally charges  \n> you put it on and play more blade and sorcery", 0.7559466361999512], ["best vr game ever made, if you try it make sure to try mod too\nmy suggestions:\nMedieval MegaPack 10/10\nRealisticBleeding 8.5 / 10\nIceSpell 6/10\nGhettosFirearm 10/10 (for american)\nHalf Swording and Support Grip 8/10\nBEO4 7/10 \nYamato 5/10 \nZandatsu 5/10\n(very little gory)", 0.756745457649231], ["The gameplay and open modding everyone wanted, but so few spineless corporations/devs were willing to make.", 0.5912408828735352], ["I'm not very good at writing reviews and stuff but i feel this game deserves one.\n\nI have been playing for a while in Sandbox, but only recently tried Crystal Hunt and it is just so much fun.\nThis game does not waste your time, game mechanics are well thought out, especially the way you spend crystals to unlock abilities.\n\nEndless ways to build your character to suit your playstyle, from ranged to melee or mix and match as you see fit.\n\njust buy it man, you won't regret it, this game is an absolute blast.", 0.5588235259056091], ["very good game very good mods also beware the game will most likely make you a psychopath just in case you need to check the traits are:\r\nAntisocial behavior\r\nLack of empathy\r\nImpulsivity\r\nNarcissism\r\nLack of guilt \r\nIf you experience any of these symptoms I would recommend you take a break from the game and seek psychiatric help and consolation", 0.5517241358757019], ["Great game only one downside it may or may not cause murderous intent for the NPC's", 0.5419847369194031], ["Hands down the best vr game for both mods and overall gameplay and longevity. 100% would commit digital atrocities again.", 0.523809552192688], ["This is such a fun, high quality game! Playing this really does feel real by the physics, area, and combat from the VR experience. The mods variety and playstyles are amazing ranging from combat, game style, and how much gore you like to play with. The crystal hunt mode is very fun, from looting, fighting, unlocking spells, and the lore (but I don't read the letters) though it can get a little bit boring due to fighting the same boss over and over again or from the outposts being the same. The weapon range can be modern to medieval due to if you like the game without mods or with mods.", 0.523809552192688], ["probably some of the best Bladed Combat i've ever experience in as vr game, worth the price", 0.5], ["goated game this is legit the most fun vr game ive played ever (playing on a psvr2 with pc adapter)", 0.5], ["wonderful game i have it on my vr account but my steamvr account i had to refund blade and sorcery the hands \ndid'int work", 0.5], ["Installed a mod that allowed me to cut people in half and crush their spines to restore HP and focus 10/10 best vr game ever made", 0.5], ["very good game mods are even better and you can get them inside of the game witch i think is pretty cool", 0.5], ["This is definitely the best VR game I played. The combat is fun and it's very easy to mod. It can also be a climbing simulator because of it's cool grabbing mechanics", 0.5], ["Good game if you just want to do some sword fighting or act like you have main character syndrome \n\nModding scene is very active and variety of mods are great\n\nBoth sandbox and campgain are good, same goes with the games optimization since it ran well with my i7-7700 and a gtx 1070 at the time, replayed with a rx6700xt and ryzen 7 5700x", 0.5], ["amazing game i enjoy making enemies cry for help and mixing heads with different bodies.recomend to everybody without age acceptions", 0.5], ["good game many mods but need a higher end pc to run smoothly", 0.5], ["best game ever...Literally, can time travel through the updates amazing mods the support for the game is eccentric has a full story mode and an amazing fan base stealth, brute force, swordplay, sorcery, and archery play styles none the less amazing customization and plenty of guides to get you started.", 0.5], ["Godly game, should have won VR GOTY 2024,  but unfortunately it didn't, and for almost 10 years of development time by a indie studio, it definitely deserves way more praise. I am totally not bias.... and please ignore my hours...  I believe I'm OK Mentally...\n\nAlso do we wanna talk about the crystals tho? I think I need more.... MORE CRYSTALS\n\n\nAnyways fun game all around, especially with mods\n100/10 game", 0.5], ["so fun and great for entertainment the powers feel and look so so cool its great I feel like I can do anything in this game.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/629730/header.jpg?t=1743683696", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/629730/af06ceb984281d88ace61451c6bae51c5ef52323/capsule_231x87.jpg?t=1743683696", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/629730/af06ceb984281d88ace61451c6bae51c5ef52323/capsule_184x69.jpg?t=1743683696"}, "support": {"support_website": null, "support_email": null, "game_website": "https://warpfrog.com/"}, "developer": "WarpFrog", "owners": "1,000,000 .. 2,000,000", "tags": ["VR", "Swordplay", "Moddable", "Gore", "Sandbox", "Action", "Magic", "Violent", "Physics", "Medieval", "Simulation", "Fighting", "First-Person", "Fantasy", "Singleplayer", "Adventure", "RPG", "Indie", "Early Access", "Games Workshop"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Portuguese - Brazil", " Simplified Chinese", " Thai", " Traditional Chinese"], "concurrent_plays": 533, "number_of_achievements": null, "categories": ["Single-player", "Tracked Controller Support", "VR Only", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG", "Simulation"], "short_description": "Blade &amp; Sorcery is a built-for-VR medieval fantasy with full physics driven melee, ranged and magic combat. Become a powerful warrior, ranger or sorcerer and devastate your enemies.", "long_description": null}