{"name": "Risk of Rain 2", "app_id": "632360", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£19.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 135992, "negative_reviews": 7432, "reviews": [["Fuck Take-Two and its shitty practices. First a rushed DLC release, now a downright comical EULA upgrade saying things like they own content made with RoR2, or that you can't use or even discuss mods. No hard feelings towards Hopoo as they wanted to move on, but the result was the unlucky situation game ended up in.", 0.8344608545303345], ["Do not buy this game until they change the terms of use. It has very concerning privacy terms. Boycott all the games under Take-Two Interactive.", 0.6814926862716675], ["After 2 years of playing, sign a new EULA that you don't agree with or lose access to the game. Great job Steam for protecting me from this and reminding me that I don't own anything here.", 0.625859260559082], ["DO NOT BUY THIS GAME UNTIL GEARBOX REVERTS THE EULA CHANGES.\nthey are putting spyware on a game THAT DOESNT CONNECT TO A SINGLE SERVER.\nand if you do have the game pls uninstall they are collecting everything from your ip ,to the dust in yo bumcrack", 0.5942182540893555], ["revert the game to before the seekers update randy\n\nyou had to just not touch it randy\n\nhow do you fuck up the main menu randy, i didn't even get the DLC and shit is still broken RANDY\n\npirate the game and grab a copy from before the greasemaster got his grubby little hands on it, the hopoo guys won't see any money from a new purchase", 0.5896972417831421], ["Screw Take-Two's new EULA I am not accepting any of that. \nThey're against mods and whatever else is considered freedom, I just am not going to play the game until that eula is shat upon aswell as the team/person who wrote this mess.", 0.5774860382080078], ["I've heard a lot about this game and even seem some of my friends playing it, didn't caught my attention initially but when it went on sale I thought \"Why not?\", been playing 4 days straight. The very next day I bought the dlc, I highly recommend it. Risk of Rain 2 is highly addictive if you enjoy rogue-like, exploring and challenging games.", 0.5652173757553101], ["Nice EULA change, tracking user information such as passwords, addresses, phone numbers, and IP addresses. Now in borderlands modding is now a bannable offensive. Do not buy this game.", 0.5566269159317017], ["EULA is straight up spyware.\r\n\r\nThe game is mega fun and good, but don't buy it until EULA is reverted.", 0.5512820482254028], ["New terms of service for gearbox is full of shit. Wait to see if they rescind their terms or spend your money else where.", 0.5454545617103577], ["The changes in the EULA and terms of service make this game borderline spyware at this point. Taking data like: Passwords, Address, Phone Number, If mods are installed, and even I.P. Address. Do not install or play this game unless Take-Two and Gear Box change it back.\n", 0.5454545617103577], ["this game gives me insane fun and mad rage and I never know which one i'm getting. When the game works you get insane power and melt every enemy on screen. But then you have stuff like opening an offering that costs 50% hp which is fine on it's own, but when you have a useless equipment that you have to bring to the endgame with you, it suddenly blows up the rest of your HP. The netcode and overall stability of the game is also somehow worse than a few patches ago. Dear devs, wtf is this bullshit? Game can be fun, but I can't recommend it in it's current state.", 0.5454545617103577], ["This is easily my favorite game that I've ever played.\n\nI have played many rouge-lites, and this one by far stands at the pinnacle of them. RoR2 is a extremely polished game that does quite literally exactly what every rouge-Lite wishes and hope to do. Be engaging over and over again, Many games in the rouge- lite genre are great at making you want to play the exact same game over and over again, take Hades, and Dead Cells for example, (Try them too) but RoR2 does it with more fervour. \n\nThe gameplay is fun, playing as the 17 different vanilla character will surprise you at all of them stand apart from each other. Yes, you will have a favorite (Mine is MUL-T) but you will enjoy most all of them. The items of this game, the meat so to speak, are incredible. All the legendary items fun to pick up, but even the common items have charm in strength. Going from a scared powerless noob to a genuine god causes white tears to run down my leg. The environments all with their own styles never fail to be a sight for sore eyes. THE MUSIC. I know its beating a dead horse but the music is phenomenal music hear is on my daily Spotify playlist because its just that powerful. The lore. Again, many games in the genre have well crafted stories. But theres a magic in RoR2s story. Reading logs, cross referencing ideas between the first and second game, all the story of RoR2 is hidden to someone who doesn't care. But to ones that do? They'll find a story that emotional, tragic, a story that can stick with you like the best of books.\n\n RoR2 is already amazing by yourself, but this game takes it up one more notch. Unlike many (if any) rouge-lites, if you can grab a couple friends, convince them to buy the game? You've just got a one way ticket to double the fun, maybe even triple the fun. The kind of stupid fun that brings people back to the better times of getting with other kids in neighborhood and going on silly adventures and eating pizza after a long day together.\n\n(IMPORTANT) Now one last thing, the reasoning for the not recommending. The game has had a stressful time lately, Our beloved Hopoo sold the IP of RoR to Take-Two interactive, a hopeless pathetic switch in. This has caused some concerns to long time fans for the future of RoR2 and the franchise. I mean hell, I planned to write another section about the amazing modding community this game has (Totally not suggesting you use it) before learning that the new EULA discourges it. I will say now that if this comes across Fake-Two's eyes, we are watching and we as a community are terrifyingly ready to tear apart everything you stand for if you continue to disrespect the consumers of your newly acquired product. Despite the ever constant bleakness of the universe, I am hopeful. I hope that the  game is optimized, I hope they fix their DLC as soon as possible, that they accept mods and the joy that they add to a wonderful game. The game in this state is a dirty nugget of gold, just waiting for its time as the pinnacle once again.\n\nOnce Take-Two Interactive gets off their high horse amends their mistake, I will say one thing and one thing only. Please play Risk of Rain 2. Whether you have been a forever fan of rouge-lite and want to get into the genre, play this game.", 0.54356849193573], ["If you play with a friend who's put some good time into it, you can unlock a lot of achievements really fast.\r\nJust uhm... expect difficulty.", 0.5427135825157166], ["Actually one of the best games ever made, with its diverse roster of survivors that has their own distinct play styles and hundreds of items that mostly synergies with one another. What I personally love about this game is that it just lets you break it with no limits on item count or the difficulty scaling itself. In a weird way, this game is a sandbox where the player races against time to determine whether they will break the toys given to them or will the toys break the player. All of that accompanied by one of gaming's most memorable soundtracks, this game redefines the rougelike genre.", 0.5389221906661987], ["The game itself is great. New Take2 ToS, however, makes it into a literal spyware. Until they revert it,  stay away from their games. This goes for Borderlands series as well.", 0.5479009747505188], ["Risk of Rain 2 runs great on the Steam Deck! The fast-paced gameplay and roguelike progression feel smooth Controls are responsive, visuals are sharp, and performance holds up well even in chaotic moments. Perfect for quick sessions or long runs—Id lean towards playing this game docked rather than handheld.\n\n\n\n", 0.5263158082962036], ["Take 2 Interactive is a scummy company in my opinion. The game is great but I do not agree to the latest TOS change.", 0.523809552192688], ["Fun game. The true difficulty is finding friends that can play on hardest mode without dying in the first minute.", 0.523809552192688], ["I didn't mean to give myself EVERY SINGLE ACHIEVEMENT I just wanted Artifact of Command to be better (which DIDNT HAPPEN)\r\nAnyway this is peam I'd eat it if it were food", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/632360/header.jpg?t=1741113466", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/632360/capsule_231x87.jpg?t=1741113466", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/632360/capsule_184x69.jpg?t=1741113466"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.riskofrain.com/"}, "developer": "Hopoo Games", "owners": "5,000,000 .. 10,000,000", "tags": ["Third-Person Shooter", "Action Roguelike", "Multiplayer", "Co-op", "Action", "Rogue-lite", "Rogue-like", "Looter Shooter", "Loot", "Online Co-Op", "Shooter", "Great Soundtrack", "Difficult", "Third Person", "Indie", "Survival", "Singleplayer", "Soundtrack", "Early Access", "Bullet Hell"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Turkish"], "concurrent_plays": 6427, "number_of_achievements": 121, "categories": ["Single-player", "Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Full controller support", "Steam Cloud", "Steam Leaderboards", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Indie"], "short_description": "Escape a chaotic alien planet by fighting through hordes of frenzied monsters – with your friends, or on your own. Combine loot in surprising ways and master each character until you become the havoc you feared upon your first crash landing.", "long_description": null}