{"name": "The Crew™ 2", "app_id": 646910, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "INR", "original_price": "₹ 2,099", "final_price": "₹ 629", "discount_percent": 70, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 19305, "negative_reviews": 5725, "reviews": [["perfect game for lazy people who want to travel around america", 0.6784895658493042], ["Do not buy this game, they're just going to make it unplayable like they did with the first game.", 0.6385466456413269], ["amazing game, but a con is that you gotta use ubisoft launcher", 0.6366042494773865], ["Got it for $1 and wasn't expecting much, but I was so wrong. Really, really fun game. Been enjoying it quite a lot.", 0.560699999332428], ["Slop, barely functional, good for one or two launches, forces a ubisoft launcher, which is a crime in itself, mediocre at best. A fruit of corporate \"design\"", 0.5519136786460876], ["Only Ubislop would be capable of turning Forza Horizon and turn it into a soulless, boring game. Even Dirt 5 has more soul than this. The gameplay is absolutely repetitive and monotonous. The soundtrack is the most mid, boring thing imaginable. Even Unbound, which has a polarizing soundtrack, elicits more emotion. At least people have feelings about it. The Need for Speed sections are also completely uninspired. They put 0 energy into the police chases as well. Most of the game is spent racing alone on a time trial, or in first place miles away from anybody else. The handling is also dull and lifeless, it's like the car is driving itself. The Laguna Seca recreation is the most apt description of this game: everything is wrong, the elevation, the kerbs, the environment, the turns. The silhouette only vaguely resembles the track. They ruined the Corkscrew. It's like this game was made by an AI. I regret buying it.", 0.523809552192688], ["I bought The Crew 2 for 1 € on sale. After playing it for a couple of hours, I can say that it's barely worth that 1€.\r\nLoose and unresponsive controls, totally unrealistic car behavior, boring tracks and a bad upgrade system, all located in a huge world filled with static (unbreakable) objects. That's what you can expect from The Crew 2.\r\nSure, there are plenty of cars and the graphics are decent, but the gameplay is utterly terrible. I wouldn't even call this game a \"Forza for the poor\" because the quality of Forza Horizon games is light years ahead of this half-product and it doesn't even deserve the comparison. The only thing I liked about The Crew 2 is the photo mode, which is hands-down a completely useless feature in a racing game (or any game for that matter).\r\n\r\nScore (out of 10):\r\n[h1][b]5.5[/b][/h1]", 0.523809552192688], ["This review will be more subjective than the others I did before, little heads-up.\n\nI am a huge fan of the The Crew franchise. The Crew was my favorite game as a child and stuck with me deeply. I was of course excited when The Crew 2 was released.\n\nBut on release, the game felt quite empty. The map, despite being seemingly more detailed and the roads not being as stupidly massive as they were in The Crew, feels kind of empty to me.\n\nAnd now that the game is finished, and no more content will be added, I can give my full conclusion on it: it has years of content, and it's quite diverse in terms of the disciplines you can try (sports cars, hypercars, boats, planes, monster trucks, etc.), but overall the races tend to feel like you've seen that place a million times before.\n\nAnd what killed it for me, and despite being close to 100%ing the game, made me quit, is how stupidly grindy this game is. The Crew was very grindy, but this game is even more so. There's so many events you need to complete 3 times in all 3 difficulties and so many cars to grind money to get and so many cars that are exclusive drops from the Summit, the weekly contest, but to reach top places, you need the best cars with at least decently optimized parts which requires even more grinding. \n\nThe photo modes, as well as the stories to win cars and clothes, just feel like checklist to me. Honestly I'm quite fed up with this game.\n\nIt's very fun if you just want to f*ck around with friends driving around and doing races, but if you want to complete it to the fullest, it will just swallow your soul in the worst way possible.", 0.52173912525177], ["this game is really fun with good graphics and many cars to unlock \r\n\r\n\r\n\r\nI would recommend you buy this game when its on sale I got it for indian Rupees 50", 0.5124531984329224], ["The worst racing game. I turned ULTRA preset on, but game looks still as bad as peeled potato. Also car controling feels really bad.(I've played NFS Heat 50hrs) i know what im talking about.", 0.5095469951629639], ["I got it for 1 $ the best price you could get a game for.\r\nIt's very enjoyable and best experience will be with your friends.\r\nBUT UBISOFT CONNNECT IS A DISAPPOINTMENT AS A LAUNCHER.\r\n", 0.508816123008728], ["Yeah, yeah I know I have only half an hour on this game right now but this game is bad.\n\nFor a game from 2018, the graphics look really plain and boring, due to the engine the fps are capped to 30 or 60 fps and the FOV is far too low and I can't find a solution to change it. The vehicle physics don't feel good and controls feel mushy. Even Burnout Paradise from 10-15 years ago feels far better.\n\nFor the amount of advertisment and promotion they did back then, this game doesn't feel and look good. It's like a bad console port. I'm actually sadly dissapointed.", 0.5049504637718201], ["Crew 2 is regret, I bought the game for 80 cents at the time, but the game is still terrible graphics, controls, even the game itself is shit, I thank the 7 dollars I gave to Forza Horizon 4 at the time, in short, fuck you and play Forza (fuck Ubisoft)", 0.5016429424285889], ["if u dont buy nfs or forza and u buyed the crew 2 0.80$ congrats but its the game is boring but its ok", 0.5], ["shitty UI, questionable controls, issues with a 2nd monitor even in fullscreen mode, forced 60fps cap even for PC, need ubisoft laucher\r\nDo not buy this unless you either like wasting money or your a masochist", 0.5], ["So, I bought this game as a recommendation from my friend, who described it is great game, with fun mechanics and othre stuff. I really loved the original The Crew from 2014 that I used to play on xbox one with my father. So I decided I will give this a try. \nWhere do I start.... The graphics aren't that bad, but I'd prefer the 2014 crew visuals and graphics. \nCharacters in this game don't stand out at all, cutscenes feel really wierd and voice acting is like AI made. Music is TERRIBLE, I switched all the radio stations and at the last one I decided to turn the radio off and listen to my own music. The menu and the map are so minimalistic and unoriginal, again I prefer the 2014 the crew which was S-tier. \nVehicle upgrading and customization doesnt feel rewarding at all. It's just click click done. No changes are made to your vehicle just some numbers and stats.\nWhen alt tabbing, or minimalising the game everytime, my pc was glitching between the game screen and the other, lasting like 15 seconds and I couldnt do anything just wait. \nAll of this plus the game is capped at 60 fps. That for me ruins the racing gaming experience.\nI wanted to play some good racing game but this is big NO for me.\nMaybe its fun later after 50 hours, but I wanted the game to impress me in the first hour. Im really dissapointed.", 0.5], ["The game itself is nice, good graphics, sound. But after a while u can have an suv passing supercars which eh it can be funny at first but after a while the game gets boring doing the same think over and over again.", 0.5], ["the crew 2 is imo a better game than the crew 1 however there is no way of finding out since ubisoft nuked it but it is a true statement. something i will do however is not put anymore hours into this game because ubisoft want me to be comfortable with not owning my games.", 0.5], ["Great game except the races do seem to become very repetitive and easy, the apartment is quite cool just I would like to be able to customise it, The multiplayer is quite good really like being able to just join a crew and join and invite friends to races very easy and intuitive.  8/10 could be better if more customisation was present but otherwise very good game definitely recommend.", 0.5], ["While semi buggy, it's a good enough game, and some of the music goes so much harder than it has a right to, like Miami Ride and Strange Case of 1950, best songs in the game", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/646910/header.jpg?t=1736258631", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/646910/capsule_231x87.jpg?t=1736258631", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/646910/capsule_184x69.jpg?t=1736258631"}, "support": {"support_website": null, "support_email": null, "game_website": "http://thecrew-game.com"}, "developer": "Ivory Tower", "owners": "2,000,000 .. 5,000,000", "tags": ["Racing", "Open World", "Automobile Sim", "Multiplayer", "Driving", "Massively Multiplayer", "Action", "Flight", "Co-op", "Singleplayer", "Arcade", "Online Co-Op", "First-Person", "Third Person", "Simulation", "America", "Sports", "Atmospheric", "Sandbox", "Adventure"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Dutch", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 1649, "number_of_achievements": 34, "categories": ["Single-player", "Multi-player", "MMO", "PvP", "Online PvP", "Co-op", "Online Co-op", "Steam Achievements", "Captions available", "In-App Purchases", "Partial Controller Support", "Remote Play on Phone", "Remote Play on Tablet"], "genres": ["Action", "Massively Multiplayer", "Racing"], "short_description": "Take on the American motorsports scene as you explore and dominate the land, air, and sea across the entire USA. With a wide variety of cars, bikes, boats, and planes, compete in a wide range of driving disciplines.", "long_description": null}