{"name": "Raft", "app_id": "648800", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£14.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 112910, "negative_reviews": 7335, "reviews": [["I highly recommend this game, but only if you have a friend to play with, can be a tad boring on your own however that's just me. It's a fantastic experience when you work together—it’s a lot of fun!", 0.6140351295471191], ["This isn’t a survival game, it’s an emotional abstinence simulator. You’re floating in a sea of despair, picking up scraps like someone trying to gather enough willpower to not eat a alfajorcito de maicena after midnight. You know you shouldn’t, but you still think about it. The shark is your anxiety, the raft is your self-control, and every new plank is just another excuse to keep going. But just like with alfajorcitos, there’s always that moment when you say “one more won’t hurt”... and suddenly you’ve built a second floor with a grill. True survival is internal.\n\n[table]\n    [tr]\n        [th][h3][b]QUALIFICATION[/b][/h3][/th]\n        [th][h3][b]7/10 SHARKS[/b][/h3][/th]\n    [/tr]\n[/table]", 0.5967742204666138], ["It's a good game, i love the story, variety gameplay, cool island map, and other things. Definitely worth of time and money, it's more fun to play multiplayer too!!", 0.5582549571990967], ["The gameplay, the multiplayer, the story, ... it is a nice game :) the storyline is not super long but other than that: great accessible game for everyone! My husband and i love playing it multiple times, we love it", 0.5454545617103577], ["I'd prefer a 'meh' rating rather than thumbs up or down, but eventually decided I wanted to vote up more than down.\n\nOn peaceful mode, it's a decent enough survival crafter - you pull in resources floating on the waves, and build up your raft to survive on.  You dive for rocks and bits of metal, and use crafting stations to craft better materials to craft better items.\n\nThe problem with that statement?  The first three words: On Peaceful Mode.\n\nWhen you're [i]not[/i] on peaceful mode, one thing gets shoved into the game that ruins everything.\n\nThat [strike]Feep[/strike]ing Shark.  Those three words (the one censored you can guess) are capitalized in my mind.  From the very beginning, it's [i]there[/i], just swimming in circles around your raft.  Every now and again, That [strike]Feep[/strike]ing Shark will decide for no reason to tear off part of your raft.  It won't take long before you can make a weapon to drive That [strike]Feep[/strike]ing Shark away, but it doesn't damage it much.  After driving it away enough, though, you will eventually [i]kill[/i] That [strike]Feep[/strike]ing Shark.\n\nAnd then it'll come right back.  No real break.  Just one dead That [strike]Feep[/strike]ing Shark replaced by another That [strike]Feep[/strike]ing Shark.\n\nWhile you're on your raft, this is a constant annoyance, but nothing critical.  Even if it tears off part of your raft, it's cheap to rebuild.  It becomes infuriating, however, once you start diving for heavier elements.  Drop in the water, and here comes That [strike]Feep[/strike]ing Shark to attack.  Throw out a bait to keep it away?  You have [i]very[/i] little time for it to be occupied, and then here comes That [strike]Feep[/strike]ing Shark to attack.  Use a shark bait to bait it in and kill it?  In no time at all, here's [i]another[/i] That [strike]Feep[/strike]ing Shark attacking you.\n\nSo.  Yeah.  On normal mode?  This game is [i]not[/i] worth playing.  It's anywhere from aggravating to outright throw-the-controller-and-scream inducing.  \n\nOn Peaceful?  That [strike]Feep[/strike]ing Shark leaves you alone, and you end up with a chill experience.  There are some balance issues, in that with a little effort you can build nets to catch flotsam and have more of the basic resources than you need without any real effort, but it's a decent survival crafter with a new twist.  Not [i]great[/i], not the next new thing, but worth spending some time on.\n\nJust avoid That [strike]Feep[/strike]ing Shark.", 0.5378151535987854], ["i find this game quite challenging, although it is quite hard to progress throughout the game. i would recommend this game to people with friends who have steam else it is quite boring with no public lobbies", 0.523809552192688], ["First half an hour or so is fun, but after the first tower this game seems to be undecided on what it wants to be, story driven, survival, crafting, puzzle, parkour... it tried to be all of these things to different extents and sadly it fails to do any of these things well.\n\nCompounded with the frustrating mechanics and poor design choices that make no sense, this game just became tedious to play by the end of our play though and we were glad to see the back of it.\n\nPersonally, I cannot recommend this game.", 0.5215105414390564], ["This game was great for the most part.  Had all the things I love about this genre.  Crafting, survival calm atmosphere and exploration.  Then they went and ruined it by putting stupid boss fights at the very end.  I tried to get by this part for a few hours then quit and uninstalled the game.  I cannot imagine why they decided to add this tiresome and frustrating trope to what was previously  a masterpiece of a game.  I like this genre of game because they do not contain boss fights that impede the progression of the plot.  Planet Crafter - no boss fights, Subnautica - no boss fights (leviathan type encounters but they could be avoided and did not impede your progression in the game), Astrometica - no boss fights, No Man's Sky - no boss fights.  Added to the annoyance of the boss fight itself is the constantly respawning hyena enemies and an imprecise control scheme that was clearly not designed for intense combat sequences. Based on this section of the game which ground my enjoyment of Raft to a halt I cannot recommend the game.  It feels as though my entire experience and progression in the game was tossed out the window by the devs deciding to make into a genre I hate - platformer with boss fight.  Add to this the game's annoying behaviour of autosaving your game state into your sole single save slot when you die (after you die so that you respawn with the consequences of having died even if you reload your save).  I could have overlooked the minor annoyances but the progression halting boss crap at the end ruined it all for me.  Uninstalled and done.", 0.5134159922599792], ["When I first started playing I didn't think I'd last for long. But through trial and error, and camping at islands a lot,  I managed to survive and learn how to make things and got much better at it. I didn't bother with the story at first, I was too busy trying to stay alive! Now that I've established the how to's I'm starting to move along nicely. It's a fun game with lots of crafting involved. The graphics are good and the controls are easy enough with some practice. It can be very cozy on your raft when the sea is calm and the moon light is shining. Then there are huge swells and you're getting swallowed by them! The shark is always hovering waiting to make a meal out of you but I muzzled mine in the settings ;) so my game play is easy and relaxed. It's not too difficult gathering materials and its always fun adding onto your raft! And the fishing alone makes it worth playing ;)", 0.5132817625999451], ["The concept is a lot more interesting than the game itself. It takes a frustrating amount of time to gather a usable amount of resources, mobs have a disproportionate amount of health and damage compared to what you have against them, food and water drain way too fast. Playing on any difficulty higher than easy can set you back hours if you die", 0.5095754265785217], ["Unless you play on easy, be prepared to be constantly gathering, crafting, fishing, finding food, repairing, and stabbing shark. Way too few survival resources (esp starting out). Poor explanation of game mechanics, and being locked to a raft is an interesting concept but makes for boring \"wait on materials to come to you\" loop.", 0.5064724087715149], ["Watch a couple youtube vids and you'll end up buying it tbh. It's a pretty unique game available for an affordable price that is *super* fun with friends.\r\n\r\nAlso, takes a very small amount of storage space compared to most games today. I'd say go for it, It's fun in a similar casual way that sea of thieves is, but with \"base\" building elements and crafting", 0.5045045018196106], ["creative is nice to learn how to build and what not with zero pressure. I find Normal mode to be just enough pressure especially when just starting out on your little 3 square raft. Once you begin building momentum, it's super fun....the most fun is playing with friends! Def worth the cost", 0.5], ["Good survival game. Starting from scratch with unlimited potential. Story is a bit confusing.", 0.5], ["Man I think about this game all the time and have for years. Tied with Subnautica for me as one of the best survival games ever made.", 0.5], ["The game is kinda fun and relaxing, tho it starts of veeeeeeeeerry slowly. \r\nYou probaply either have to play it with friends to enjoy, or always have another thing on a differet monitor.", 0.5], ["I enjoy the game but Please increase the spawn rate of ship wreck and plane crash island it's way to low but the achievements difficult to complete.", 0.5], ["Really love the game a little addicting, but we should be able to collect wood without an axe on an island to prevent restarting over because you dont have any wood. And on island to be able to axe the down trees", 0.5], ["This is a game that you have to dive into in order to enjoy it. It is very confusing at first but once you sink about 5 hours into it and learn the basics it becomes addicting!", 0.5], ["Its a great and fun and unique game that honestly needs more attention", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/648800/header.jpg?t=1727184011", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/648800/capsule_231x87.jpg?t=1727184011", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/648800/capsule_184x69.jpg?t=1727184011"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.raft-game.com"}, "developer": "Redbeet Interactive", "owners": "10,000,000 .. 20,000,000", "tags": ["Survival", "Multiplayer", "Open World Survival Craft", "Co-op", "Crafting", "Open World", "Building", "Base-Building", "Online Co-Op", "Adventure", "Sandbox", "First-Person", "Singleplayer", "Underwater", "Simulation", "Early Access", "Action", "Indie", "Strategy", "Massively Multiplayer"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Swedish"], "concurrent_plays": 10798, "number_of_achievements": 104, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Steam Achievements", "Steam Cloud", "Family Sharing"], "genres": ["Adventure", "Indie", "Simulation"], "short_description": "Raft™ throws you and your friends into an epic oceanic adventure! Alone or together, players battle to survive a perilous voyage across a vast sea! Gather debris, scavenge reefs and build your own floating home, but be wary of the man-eating sharks!", "long_description": null}