{"name": "Counter-Strike 2", "app_id": 730, "platforms": {"windows": true, "mac": false, "linux": true, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 1131620, "negative_reviews": 179010, "reviews": [["It doesn't matter if you have 100 hours of playtime, 1000 hours, or even 5000 hours, you will remain a noob forever. There are enough cheaters in the game to make you drop the game, but once you get caught up in this endless addiction, there is no turning back.", 0.9102828502655029], ["when you start a premier match , one of the 3 things will happen\n49.8%: you will be forced into a cage called \"team\" that consist of you and 4 retarded monkeys that speaks languge even Chatgpt never heard of\n49.7%: the silver with software, in second or third round after you peek him in the most default ah position ever will toggle his gay ass software and will start accusing you whole game of cheating\n0.3%: normal ah team that is playable\n\nTLDR: if you want to observe a zoo from your home this is the game for you", 0.7930871248245239], ["great game have thoroughly enjoyed it..\nonly issue is obviously the cowards that choose to cheat and use hacks.", 0.7797354459762573], ["Unplayable for newcomers. 9 out of 10 games are Hacker vs Hacker Lobbies.\nthx valve for not giving a f*ck about your game and preferring to add skins instead of actually working on it", 0.7609837651252747], ["Тhe game had potential, but it's completely ruined by the overwhelming number of hackers. It's frustrating and unfair, making it almost unplayable. Developers need to take action before it's too late.", 0.6882720589637756], ["Full of cheaters, still unoptimized after so long, and basically its a heavy greasy poop of a game", 0.6585533022880554], ["leads to gambling addiction, and including that you get free russian and romanian lessons when you fuck something up\r\n\r\n10/10", 0.6577777862548828], ["Go outside. Exercise. Read a good book. Connect with God. Go do something else, anything else... to prevent yourself from never taking accountability, growing angry, and wallowing in self-pity.", 0.6486102342605591], ["I have been playing counter-strike since it was a mod, before Valve bought the rights and before steam was even a thing. I have had no issues until CS:GO where hackers seemed to go unchecked and if you tried to report anyone valve wouldn't let you for a time and said they have a full proof anti-cheat method. CS2 was coming out and I was excited for it since it would be an upgrade to visuals and gameplay. It has some improvements but hackers are still a problem more in comp and premier than in casual surprisingly.\r\n\r\nSteam from the articles I have read are using AI and a report from another player to catch cheaters now, this however is showing false positives, there are videos discussing this in more detail where the number of \"caught\" cheaters has increased exponentially. I myself have not cheated in any game, ran any scripts, etc. Yet I have now been punished twice in two different pods of 5 despite no actual vac bans and no word on who was even suspected of cheating, instead we get a generic message of \"Irregular Gameplay\" and the whole team is penalized. First time was 20 hours, I figured I just won't play with those guys again as I only knew one of them anyways. The second time I met 3 clan guys friended one of them and ran with one of their friends and the match ended early. We were losing both matches by a lot and we suspected the top frag player on the other team of hacking given how great he was compared to everyone else. The second time was a 3 day cooldown and since I don't hack I opened a steam ticket and almost 3 days later there is no response. I have spent a lot of money on opening cases and everything so I find it very crappy that Steam/Valve has decided to ignore my ticket and derank me a second time on premier when I was not cheating at all.\r\n\r\nI have friends who play premier and I want to play with them which is why I was getting my rank up which peak was around 3500 which isn't very high. Most of my friends got theirs up to 10k+ and the game doesn't allow you to play if the level difference is too high, which I understand the reason is so players don't get boosted. My issue now is that I am forced to play with full randos as if I join a stack, I risk getting cooldowned again or banned if someone else is cheating or has \"Irregular Gameplay\". \r\n\r\nI will still play the game but I don't see a point in trying to do comp or premier anymore nor do I see the point in spending money in a game that allows actual cheaters to play the game while penalizing those it just thinks might be cheating. This makes me want to go to back to COD but most of my friends play CS2. If you are looking for a game to play competitive this game is definitely not it. \r\n\r\nCheating is not the only reason not to get this game, CS2 has been out for 2 years and I was a little down that they eliminated a lot of maps, but they brought new versions at the same time. They announced they were bringing new maps, for hostage rescue, there are only 2 maps where before we had more. I would have thought that we would get 2 new hostage maps but both times they released 2 maps for a total of 4, they were defusal maps and the first two weren't for casual or comp but only wingman (2 v2). They release skins and they are nice but cheating is a problem, since Q3 of last year flagging accounts who aren't cheating has been a problem and we still only have 2 hostage maps that one has always been since beta the other since 2000, 25 years old. Meanwhile most of the defusal maps are newer or have had major upgrades to design layout.\r\n\r\nIf you already own the game, sure you can keep playing it but if Valve/Steam continues in the direction they have been headed they will destory the player base for this game. If you don't own this game, I do not recommend you buy it and purchase price is they charge money to play premier/comp, 15 dollars. It isn't worth it.", 0.6308991312980652], ["Counter Strike is a team game for people who like self-harm. This game is like a drug, you know that after turning it on you will feel like you want to slit your wrists, but you still turn it on just like with drugs. \n\nThe goal of the game is to cooperate with individuals who have had a lobotomy and on top of that, each of them has the ego of the director of the globe. During the game, you will often have the urge to whip someone with an electric cable, but you will quickly get used to it. At the beginning of the game, you spawn with 4 other people, two of whom don't have a microphone and you wish the other two didn't have one. Most of them do not even speak English and they shout various spells at the others. \n\nThe basic tactic in this game is to die first and curse at the others. If you are lucky enough and happen to win a game, do not forget to write \"gg ez noobs\" in the chat.\n\nFeel free to click the \"play\" button, which actually means \"give me 4 mentally challenged individuals on my team\" to find out how many people are actually sleeping with your mother.", 0.6221786141395569], ["this game actually just sucks\r\nit is an incredibly frustrating game \r\nyoure trying to improve at the game and youre playing ranked, the formula for a counterstrike game is trying to improve but never truly having fun, stuck with teammates who harass you for any little mistake you make, forced to listen to racism, homophobia, misogyny and all sorts of toxicity that force you to mute teammates in a game where communication is incredibly important, while the enemy team either has a smurf owning you or are a blatant wallhacker and youre just losing and feeling like garbage for it, youre playing the same maps with the same guns and the same strategies, the developers cant be bothered making a good anti cheat because they simply dont care because they rake in $millions of dollars from people who want to gamble their money for a 0.000000001% chance for a knife \r\nthis game turns people into assholes \r\nyoure only truly free when you get out of low ELO\r\nand then youve only got cheaters\r\nuninstall or dont install in the first place\r\n\r\n", 0.5984306335449219], ["Counter-Strike 2 was supposed to be the evolution of CS:GO. A fresh engine, better graphics, smoother gameplay. In reality? It's a downgrade in disguise. Sure, the core gunplay still slaps, the maps look cleaner, and Source 2 brings a nice visual upgrade. But once you scratch the surface, the issues hit you like a flashbang to the face.\n\n🔸 CS:GO was just better. More features, better balance, less chaos. CS2 feels like a stripped-down, half-baked remake with prettier lighting. It lacks the polish and reliability that made CS:GO feel like home.\n\n🔸 Cheaters. Everywhere. Despite all the “improved anti-cheat” talk from Valve, CS2 is swarming with wallhackers, spinbotters, and aim-assisted clowns. VAC is more of a meme than a system. You might get one clean match out of five – if you're lucky.\n\n🔸 Account leaks through streams. Let that sink in – people literally lost their Steam accounts just by watching CS2 streams on Twitch. No phishing, no clicking shady links – just watching a major event. And Valve? Dead silent. No statement, no apology, no help.\n\n🔸 Server quality is laughable. 64 tick servers in 2025 is just unacceptable. We were promised 128 tick – we got smoke gimmicks and laggy peeks. Rubberbanding, packet loss, and straight-up disconnects still happen. It’s like playing on a potato sometimes.\n\n🔸 Missing content at launch. CS2 launched like an early-access game. No community servers, no classic modes, missing features from CS:GO that players used every day. And they’re slowly trickling back... keyword: slowly.\n\n🔸 Matchmaking and ranks are a joke. The ranking system feels totally random. Win streak? You derank. Lose a game? Here's your promotion. No transparency, no logic – just vibes and suffering.\n\nFinal thoughts:\nCounter-Strike 2 could be amazing. The gameplay foundation is still gold – it's fast, competitive, and adrenaline-pumping. But Valve has a long way to go before this game deserves to stand above CS:GO.\n\nAt the moment, I play CS2 not because it’s great, but because there's no real alternative. And deep down, I still miss CS:GO – the better, more complete version of the game I fell in love with.\n\nFinal rating: 7/10 – for what it could be, not what it currently is.", 0.6658041477203369], ["this game will make you cry, scream, and may make you want to break your computer. But I will play it until my eyes bleed :)", 0.604519784450531], ["I really like the game but cheaters are ruining the experience i don't mind the other problems so much but cheaters are destroying everything , in a game that is full tactical and needs so much of practice and hours from your life i cant stand that almost in every premier (ranked) match is at-least one cheater its just sad !!!!", 0.583035409450531], ["this game is pretty fun, but cheaters ruin it. i had a gay man in my team named SShifann who e-touched me, and asked me to send him naked pictures. (I did)", 0.579279363155365], ["Full of russian and russian cheaters , i dont recommend.", 0.5652173757553101], ["The game is unplayable. Every time when you shoot a bullet is like you spin a roulette. Sometime is going in the upper left of the crosshair other time in the upper right or bottom left or bottom right and if you are lucky is going in the middle where is supposed to go. If you don't believe me, just enter a game and single shoot the weapon at the wall. I paid for the prime to stop playing with cheaters but I feel like if you don't play with a wallhack at least you don't have what to do on the official servers. I reached lvl 10 to play premier but even there are cheaters. I think I will search for a private server that are punishing the cheaters. Sadly they are not giving experience. I can't recommend this game when CS 1.6 is better in every possible way and he was released in 2000.", 0.5588235259056091], ["This used to be the best game ever but now it's just filled with cheaters and bad hit reg crappy subtick system. Please fix valve or it will die soon!", 0.5580110549926758], ["Terrible fucking game. Bunch of cheaters and Valve sucks ass", 0.5544160008430481], ["you can't play 1 premier game anymore without someone using some kind of hack -.-  its almost sad how bad things have got...  after they put this game up for free its 50% hackers... Valve do your job and fix it before people leave.", 0.5476190447807312]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/730/header.jpg?t=1745368595", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/730/capsule_231x87.jpg?t=1745368595", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/730/capsule_184x69.jpg?t=1745368595"}, "support": {"support_website": null, "support_email": null, "game_website": "http://counter-strike.net/"}, "developer": "Valve", "owners": "100,000,000 .. 200,000,000", "tags": ["FPS", "Shooter", "Multiplayer", "Competitive", "Action", "Team-Based", "e-sports", "Tactical", "First-Person", "PvP", "Online Co-Op", "Co-op", "Strategy", "Military", "War", "Difficult", "Trading", "Realistic", "Fast-Paced", "Moddable"], "languages": ["English", " Czech", " Danish", " Dutch", " Finnish", " French", " German", " Hungarian", " Italian", " Japanese", " Korean", " Norwegian", " Polish", " Portuguese - Portugal", " Portuguese - Brazil", " Romanian", " Russian", " Simplified Chinese", " Spanish - Spain", " Swedish", " Thai", " Traditional Chinese", " Turkish", " Bulgarian", " Ukrainian", " Greek", " Spanish - Latin America", " Vietnamese", " Indonesian"], "concurrent_plays": 1728150, "number_of_achievements": 1, "categories": ["Для нескольких игроков", "Кросс-платформенный мультиплеер", "Коллекционные карточки Steam", "Мастерская Steam", "Внутриигровые покупки", "Включён античит Valve", "Статистика", "Remote Play на телефоне", "Remote Play на планшете", "Remote Play на телевизоре", "Временная шкала Steam"], "genres": ["Экшены", "Бесплатные"], "short_description": "Более двух десятилетий Counter-Strike служит примером первоклассной соревновательной игры, путь развития которой определяют миллионы игроков со всего мира. Теперь пришло время нового этапа — Counter-Strike 2.", "long_description": null}