{"name": "Phasmophobia", "app_id": "739630", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "EUR", "original_price": "", "final_price": "19,50€", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 314019, "negative_reviews": 12247, "reviews": [["Really fun and scary game to play with friends, sadly over time you will get accustomed to the ghost behavior and desensitized to horror and it will become a trivial task unless you challenge yourself with self imposed rules.", 0.6865756511688232], ["funny laughing with your friends for the first couple hours then turns into the most boring repetitive slog. Hasn't had any real content updates that add depth or interest to the game in years.", 0.6470503211021423], ["Game was worth it years ago when it was first publish, however, Phasmophobia has been in the same/similar state for the past year and a half with no sign of significant change or improvement. The development team have been severely lacking in progress and quality updates, adding smaller and less effective contents and events rather than prioritizing the obviously needed updates\n\n- Horror aspect is severely lacking, the devs have plans to update this, however, these plans have been made years ago and no actual progress was made toward them\n- Game Mechanics have barely seen any changes making the game severely repetitive in everything\n- Devs priorities seem to be focused on Community Events/Holidy Events and Mediocre Content such as random unnecessary UI changes, as well as map touch-ups/changes rather than improving on the main gameplay itself\n\nI am heavily convinced the devs just stopped caring for the development of this game and it's community as a whole.", 0.6402625441551208], ["This game is very fun to play with friends. What's really cool is that it's still in development so you can watch the game get even better as you play it!", 0.5996651649475098], ["[h3] Want to hunt ghost but can't afford to irl? You'll probably get sucked into this game! [/h3]\r\n\r\nThere are a few things that [b] need [/b] to be added, like being able to save/favorite cross platform players in game, and a way to filter through multiplayer lobbies by difficulty setting, but from what I have heard the devs are working to add these features along with character customization asap!\r\nI also think it could be really interesting if they were able to add possessions in some way, or even an animal companion in single player mode that can react to unseen ghost activity (that might be a stretch though).\r\n \r\nThe community can be a bit toxic and sweaty but, once you weed-through the bad lobbies, you can meet some really cool people! :)", 0.5652580857276917], ["I was recently recommended this game by my buddies at work and we played for three hours straight as a team. This game can be terrifying, addictive and fun. Once you start playing you will never want to stop. The atmosphere constantly keeps you on your toes and you never truly know what you're dealing with until the lights start flickering and that's when you know things are about to go down. At the time of writing this there are about 24 real world ghosts with different personalities and traits to give off the illusion that someone actually used to live during that point and time. I also appreciate the attention to detail given to all of the ghost hunting equipment and makes it seem like you're actually apart of one of those ghost hunting TV shows you used to see as a kid back in the day. The threats are constantly unknown, and you will feel the tension in the air, once you fully get used to the horror atmosphere. It becomes addictive, and you will want to spend time earning more equipment as time goes on. My only complaints would be the ghosts constantly looking like Unity Assets when they spawn in during hunts and most of the player death animations are reused for all ghosts. I want to see a little more variety towards death animations and ghost models to an extent so it actually looks like they've arrived from the darkest pits of the unknown. The ghost models do kinda remind me of the Ghosts from Silent Hill 4 except these ones don't float towards you. But rather run towards you like a flickering zombie which I think looks kinda silly. Other than that, I believe this game has potential to be something more and it really shows. This earns a 10/10 rating and the $20 price tag is worth every penny. If you haven't tried this game before, go ahead and give it a try!", 0.5614035129547119], ["Disconnected Client Timeout literally every game for 3 years from different devices: laptop, PC, xbox, VR. Changing your internet provider doesn't change anything. The developers are showing absolute disrespect for players by not fixing this issue for years. Shame. Very disappointing.", 0.547325074672699], ["Incredible game. The progression is always keeping you on your toes, letting you unlock new items and badges. You could be the best in the world and still have things to accomplish. It's really one of the only good ghost-hunting games left these days, and oh my GOD is it good. Absolutely worth the money. If someone is scared of horror games this is the way to start. It brings you in, but the jump scares aren't that bad, and over time you get used to it. 10/10. Get it. Please.", 0.541284441947937], ["This game is over all a fun game to play either by yourself or with a friend/ group of friends. In the limited number of hours that I've played I haven't run into any issues. If you're looking for a game to have a good time and even get funny moments with your friends then look no further.", 0.540777325630188], ["I will throw hands if I get jumped by another Demon the second I enter the house, and Shades are literally the Chudjak.\n\nBesides that, absolute peak. My favourite of the co-op investigation style games like Content Warning, R.E.P.O. or Lethal Company. Deserves so much more attention than it gets.\n\nGive us more player models though, or customisation, I beg.", 0.523809552192688], ["The first year or so of this game was utterly unbelievable in both enjoyment and accessibility, although I feel that has fallen to the wayside unless you enjoy heavy RP and an excessive amount of trial and error in identifying the now almost 25 types of spirits in the game. Not saying it's bad now, just that my friends and I couldn't come back to this and play casually after a certain point.", 0.523809552192688], ["If you're into horror, teamwork, or just screaming with friends — Phasmophobia is a must-play. This game nails the atmosphere like no other. The sound design, lighting, and ghost behavior all work together to create an experience that’s genuinely creepy whether you’re solo or in a group. Playing alone is pure nerve-wracking suspense, while co-op turns into a chaotic, hilarious mess of yelling and last-minute rescues (or betrayals). The devs have been constantly updating the game with new content, smarter ghosts, and better tools, and it just keeps getting better. Every hunt feels different, and every session creates memorable stories. Whether you're a ghost-hunting pro or a total scaredy-cat. Highly recommend. 10/10", 0.523809552192688], ["As much as I really like this game I don't think it would be for everyone. The best way I can describe the game in a few would be a spooky game of guess who with extra steps, not to mention you are practically looking for an invisible person so you gotta be patient. You are for sure in need of game knowledge when you play for a longer amount of time.", 0.523809552192688], ["One of my favorite games, I enjoy it both solo and multiplayer! \nOf course, the game gets a bit repetitive when you play a lot, but to me that's part of the reason I like it- you know what to expect, and can endlessly try to hone your skills to complete contracts. \nThe challenges and possibility to earn badges and achievements is always a good motivator as well!", 0.523809552192688], ["Phasmophobia takes the classic ghost-hunting concept and brings it to life with a level of immersion and tension that is unmatched. This cooperative multiplayer game lets you and your friends become paranormal investigators, entering haunted locations armed with various ghost-hunting tools in search of spirits. But be warned—this is not your typical ghost-hunting experience.\n\nAtmosphere: 10/10\nThe atmosphere in Phasmophobia is nothing short of chilling. The dimly lit environments, eerie sound design, and unsettling visuals pull you into a world of paranormal horror. The game’s use of sound to build tension is especially impressive. Every creak, distant whisper, or sudden bang keeps you on edge, making it one of the most immersive horror experiences available.\n\nGameplay: 9/10\nThe mechanics of Phasmophobia are surprisingly deep for a horror game. Each ghost behaves differently, and you’ll need to use various tools—such as EMF readers, spirit boxes, and UV lights—to gather evidence and identify the type of spirit haunting the area. The thrill of discovery and the fear of what might happen when you’re left alone with the ghost is a constant tension. The game encourages communication and teamwork, as you and your friends must cooperate to solve the mystery before the ghost becomes hostile.\n\nMultiplayer Fun: 9/10\nThe multiplayer aspect is where Phasmophobia truly shines. Playing with friends is a blast, especially when things go horribly wrong. The sense of camaraderie and shared fear makes the experience uniquely enjoyable. If you’re looking for a game to play with a group, Phasmophobia offers a perfect balance of cooperative strategy and heart-pounding moments of terror. But, the AI behavior for the ghosts can be unpredictable, keeping you on your toes at all times.\n\nTerror Factor: 10/10\nThe horror in Phasmophobia isn’t just about jump scares (although there are plenty). It’s about the constant sense of dread and the terrifying unpredictability of the spirits. The ghosts can interact with you in various ways, some becoming aggressive and hunting you down, while others may remain eerily quiet. The game also does a great job of amplifying your fear by using voice recognition to trigger ghost interactions, so speaking can sometimes lead to disastrous results.\n\nReplayability: 8/10\nWith multiple maps, different ghost types, and varying difficulty levels, Phasmophobia offers plenty of replay value. While the core gameplay loop remains the same, each investigation feels different because of the random nature of the ghosts and the environment. However, the lack of a deeper progression system or major content updates might make some players feel like they've seen everything after a while.\n\nConclusion:\nPhasmophobia is an absolute must-play for fans of horror games, especially those who enjoy multiplayer experiences. The blend of strategic investigation, intense fear, and cooperative gameplay makes it stand out as one of the scariest games on the market. Whether you're teaming up with friends or braving the horrors solo, Phasmophobia offers a truly terrifying and unforgettable experience.\n\nFinal Score: 9/10", 0.523809552192688], ["---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks  \n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second live for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10", 0.52173912525177], ["Very creepy game but it's very fun and less scary with friends! Would recommend!!", 0.52173912525177], ["This game is a must! It's a recipe for many laughs on multiplayer, and despite a simple premise, it doesn't tire in the slightest. Highly recommend!", 0.5209155678749084], ["Phasmophobia is a captivating cooperative horror game that redefines the ghost-hunting experience. Its atmospheric gameplay keeps players immersed, with each haunted location brimming with eerie details, from dimly lit hallways to the sudden, spine-chilling whispers of an unseen ghost. The game's dynamic ghost behavior and randomized investigations make every session feel fresh and unpredictable, keeping players on their toes as they strategize and work together to gather evidence.\r\nWhat sets Phasmophobia apart is its emphasis on teamwork and its innovative use of investigative tools like EMF readers, spirit boxes, and UV lights. Whether you're playing on PC or diving into the game’s highly immersive VR mode, the tension and thrill are palpable. With its blend of strategy, suspense, and scares, Phasmophobia is a must-play for anyone seeking a truly unique horror experience. This game is truly amazing!", 0.5209155678749084], ["Its pretty goofy and funny with friends but its also scary when you play alone, its a good time either way tho", 0.5209155678749084]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/739630/header.jpg?t=1740090955", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/739630/capsule_231x87.jpg?t=1740090955", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/739630/capsule_184x69.jpg?t=1740090955"}, "support": {"support_website": null, "support_email": null, "game_website": "http://kineticgames.co.uk/"}, "developer": "Kinetic Games", "owners": "10,000,000 .. 20,000,000", "tags": ["Horror", "Online Co-Op", "Multiplayer", "Psychological Horror", "Co-op", "VR", "Supernatural", "First-Person", "Investigation", "Dark", "Demons", "Detective", "Mystery", "Thriller", "3D", "Early Access", "Indie", "Action", "Tactical", "Singleplayer"], "languages": ["English", " Portuguese - Portugal", " Spanish - Spain", " Portuguese - Brazil", " German", " French", " Italian", " Bulgarian", " Czech", " Danish", " Dutch", " Finnish", " Greek", " Hungarian", " Japanese", " Korean", " Norwegian", " Polish", " Romanian", " Russian", " Simplified Chinese", " Swedish", " Traditional Chinese", " Turkish", " Ukrainian", " Catalan"], "concurrent_plays": 13550, "number_of_achievements": 54, "categories": ["Solo", "Multijoueur", "Coopération", "Coopération en ligne", "Succès Steam", "Compat. contrôleurs complète", "Prise en charge des contrôleurs suivis", "VR prise en charge", "Cartes à échanger Steam", "Steam Cloud", "Remote Play sur téléphone", "Remote Play sur tablette", "Partage familial"], "genres": ["Action", "Indépendant", "Accès anticipé"], "short_description": "Phasmophobia is a 4 player online co-op psychological horror. Paranormal activity is on the rise and it’s up to you and your team to use all the ghost-hunting equipment at your disposal in order to gather as much evidence as you can.", "long_description": null}