{"name": "Shadow of the Tomb Raider: Definitive Edition", "app_id": 750920, "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 17855, "negative_reviews": 3158, "reviews": [["I have enjoyed the game.  I am 79 years old.  But having a little problem with some of the screens.  Wish i could find a walk through like for the last Tomb Raider Game I purchased.", 0.7613690495491028], ["---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☑ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying (some bugs)\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☐ One and done\n☑ Maybe after a year\n☐ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☐ None\n☑ cosmetics and other stuff\n☐ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10 \n", 0.649029552936554], ["This game has a serious problem of immersion. You're just starting to feel the adventure the game promises, but it's suddenly punctuated by a deluge of tedious acrobatic endeavors and time-consuming puzzle-solving arrays. Combat or action sequences are undermined by unengaging exploratory sequences, which, in turn, make the game monotonous and mediocre.", 0.534416675567627], ["[h1]Overview[/h1]\n\n[i]Shadow of the Tomb Raider[/i] concludes the survivor trilogy, but I was honestly disappointed by it. The storyline is the weakest of the three, disjointed and inconsistent, making it hard to get into. But why do I still recommend this game even though it has the worst storyline in the trilogy? because of its improved gameplay, which I will discuss more in the \"Gameplay\" section. In my opinion, Mathias was the best antagonist in the trilogy. Konstantin was decent too. However, Dr. Dominguez felt underwhelming in comparison. I was hoping for a more intimidating villain, but it felt like a downgrade. They didn't change Lara's character model this time (which is a good thing), but the skin textures looked less detailed than [i]Rise of the Tomb Raider. [/i]On the upside, there's noticeable improvement in hair rendering. Camilla Luddington delivers a decent performance, but the dialogue occasionally feels weak.\n\n[h1]Gameplay[/h1]\n\nThis game focuses more on exploration and has less combat compared to the previous one. Though I had fun exploring Peru, as the world-building and environment are gorgeous, and I believe they have been very consistent with it throughout the trilogy. It turns into horror for a bit, with an eerie atmosphere executed effectively. Combat mechanics are largely similar to the previous game, and I had fun taking the stealthy route. Lara can camouflage herself with mud, use fear arrows to turn enemies against each other and perform brutal stealth takedowns from trees or underwater. The expanded skill tree offers diverse playstyles, and weapon customisation remains robust. The best part of this game are the tombs, there are a total of 16 challenge tombs (including DLCs) in this game. They are more elaborate and challenging than [i]Rise of the Tomb Raider, [/i]often requiring players to engage with multiple mechanics and think critically to progress. The increased difficulty and depth of these puzzles offer a more rewarding experience. Additionally, the atmospheric design and the environmental storytelling contribute to a more immersive and engaging experience. [spoiler]\"Howl of the Monkey Gods\" was my personal favourite.[/spoiler]\n\n\n[h1]Downsides[/h1]\n\nWhile this game excels in atmosphere and exploration, the narrative execution was quite bad (as mentioned in the \"Overview\" section). Other than that, there's not much to talk about here, except some occasional texture pop-ins and camera glitches.\n\n\n[h1]Conclusion[/h1]\n\nPersonally, the trilogy could have ended in a better way. The tombs were amazing, I would go so far as to say one must play [i]Shadow of the Tomb Raider[/i] once, just to experience the tombs. With the new Tomb Raider game being in development for quite a while now, I hope we get some updates soon. Until then - keep exploring!", 0.523809552192688], ["1. This game = Story driven + Badass Main Character + Action and/or Stealth gameplay + Tombs exploration & its puzzles.\n\n2. This game is very good sequel to previous tomb raider games but I liked the first two games of this series far more = i.e. \"Tomb Raider 2013\" and \"Rise of the Tomb Raider 2015.\"\n\n3. I liked this game but it has too much side content that you get side-tracked very easily which I didn't like.\n\n4. This game have semi-game breaking bug in this DLC = \"the monkey one with huge drums\" and the somewhat glitchy DLC = \"pillar type one where we have to use lots of fire arrows\".\n\n5. This games takes less than (20 hours to finish = if only doing the main story) but with + [all the side missions and challenge tombs it takes less than 45 hours to finish].(on normal difficulty)\n\n6. For me this game  was = 8/10.\n\n7. Recommended to buy and play this game.\n", 0.5235767960548401], ["Unfortunately I can not recommend this game.  The game is amazing, it is a lot of fun, but so far there are just way to many issues with it.  \n\nI have a 5090 and 9950x3d.  I was trying to play with maxed out setting and in the benchmark got over 300 fps.  Unfortunately in game if you have ray tracing on it crashes non stop, you have to turn ray tracing down to medium to reduce the crashes but even then you get several.  \n\nLater on in one of the tombs there is a puzzle where you have to rotate dials to open a door, unfortunately, you have to get under 90 fps to be able to actually turn the dials otherwise it does nothing...  \n\nI am still going to try to beat the game, and if you can deal with the bugs it is a fun game, but if you have a high end pc, you will not be able to take advantage of the perfermance you can get.", 0.5220333337783813], ["Despite looking gorgeously lush, with beautiful cinematography during cutscenes, Shadows is unfortunately underbaked. The platforming controls respond poorly, combat is tedious and punishes stealth, environmental lighting and animations break frequently, and many puzzles are poorly designed and require the player to mash the interact key on every rock Monkey Island style. Too often I've had to watch a gameplay video to figure out which rocky ledge on a wall is climbable and which one is just set dressing. It's clear that whoever was in charge of this game simply rehashed the old engine and phoned it in. An unfortunate waste of money.", 0.5172392725944519], ["This game is worse than the previous game. The cutscenes are even longer, they made every side character annoying and they somehow made discovery and exploration uninteresting. Which sucks, cause this is arguably the best setting yet.\n\nOnce you find the lost city, you are somehow immediately trusted by one of the factions there and despite looking different than everyone else and everyone commenting on this fact, you somehow are able to stay in disguise around the enemy faction. This shit is so dumb and far away from the lone wolf feeling of the first reboot game and the original games. Also, why does Jonah look completely different and why is he an annoying passive aggressive bitch this time around? \n\nAt least the stores make sense in this one.\n\nI'm not done with it yet. I'll finish this damn game and update my review but I'm not gonna be happy doing it, that's for sure.", 0.5146570801734924], ["definitive edition stills pack with glitches and crash.\n\nif you enable dx12 your game will crash every 5 mins with this: Crashing with DXGI Error it was a in the base game and still in definitive edition\nThe graphics are ok but so many hair glitches, rope glitch that the game doesn't feel polished.\nYou can enable an option call Voice-over immersion. basically, this will make people speak their native language. However, it is very stupid to keep Lara to speak only English they interact with people in the middle of the jungle of Peru that speaks Spanish. Either Lara speak Spanish, even a broken one would have been so much better for integration than one speak English and the other Spanish.\nGameplay: Nothing has change here\nThe game needs to throw a Cinematic every 5 mins. it feels the game is slow and sluggish. \nThe climbing and parkour are just not as exciting and fresh, and inconsistent in terms of execution. Sometimes you don't even know if it's a bug or not.\nTraveling and exploration is a chore, and only for the sake of collecting stuff.\nThe change of Look of Lara is also very annoying.\n\nStory after 4h is ok but not really great. I will probably just rush through to get conclusion or watch it on Youtube.\n", 0.5102640986442566], ["bad game, waste of time on lots of walking talking climbing, low action, puzzles are un understandabel,  rise of the tomb raider was the best game full of action, weapons, crafting, but shadows is a complete shit", 0.5022059679031372], ["After being pleasantly surprised by 2015's Rise of the Tomb Raider, a game that built upon the foundation laid by its own predecessor by including more exploration elements from the original games and adding to the combat and platforming, I decided to give Shadow of the Tomb Raider, the final instalment in the Survivor trilogy, a go. I had seen reviews that this was the worst of the three, but had figured it would be fairly consistent with the other two regardless, but somehow, this game, which also builds on the platforming and combat of Rise while including more elements from the classic games, is a huge step down in quality.\r\n\r\nIn some ways it is consistent with the previous games. Platforming is about the same level of quality as in Rise, with extra focus on the grapple axe and the new additions of rappeling and overhead climbing. Precision jumping is still impossible, but the platforming is actually a nice diversion. Lara's combat moves are essentially the same as in Rise, with a dodge scramble, no being stuck behind cover, and unlockable new abilities like a Batman style takedown from tree branches, meaning the foundations for a fun shooter are there on the player's side. The setting and environments are also great, this game taking place in the Amazon, giving some great MGS3 jungle vibes, especially with changeable costumes and the ability to cover yourself in mud to aid in stealth. Graphically, the environments and art direction are very strong, though not every character model has the same love put into it, with Lara, Jonah, and Dominguez being obvious favourites.\r\n\r\nSo if the game has a better setting and the same core gameplay, what went wrong? Firstly, the stronger elements from the original game aren't followed through properly. Lara spends much of her time in Shadow exploring temples, shrines, a church, and at one point, even breaks into a Tomb, like the name of the game, but these are so simplistic and linear it begs the question of what the point really was. For the most part, puzzles were more complex in the previous two games, which already had highly simplified puzzles compared to the original, and there are no locked doors in any of them, just simple puzzles to progress to the next room, with no enemies in many of them. Some of these areas only require platforming to get through without any puzzle solving. It genuinely makes me wonder if the team had played the first Tomb Raider or not. In that game, Tombs take up whole levels and are filled with Zelda/Resident Evil style key hunting and puzzles that ask you to understand 3D space to navigate. Even the first Tomb in Tomb Raider 1 is more complex than the temples in Shadow, and it's made up of a handful of rooms, later tombs are sprawling behemoths to navigate. So yes, the inclusion of temples and shrines as part of the main plot in Shadow is welcome, but the execution is highly lacking. I understand that fans of the previous two games potentially would only play for the combat and be put off if this game suddenly forced them to complete Zelda style dungeons, but if the reasoning was to allow for more combat, I have more questions.\r\n\r\nCombat is the big elephant in the room, and it's time I addressed it. Shadow of the Tomb Raider fails to live up to the shooter gameplay of its predecessors because it simply doesn't have combat in it. I am of course exaggerating, there are some combat encounters here. But for over 5 hours, I did not come across a proper combat arena (excluding the Jaguar fight, meaning with human enemies) like in the first two games, and only a handful of small skirmish encounters, many of which were clearly scripted to allow one highly easy way through. In the early game, the stealth that was such a big part of approaching groups in the previous games also didn't seem to work; on one encounter, which I restarted multiple times to test this, I would wait until the Survivor Instinct told me a lone soldier was not being viewed by his comrades, then headshot him with the bow, a silent weapon, and every time I did this, every enemy in the area somehow knew exactly where I was and I had to play through the scenario as a shooter, without stealth, despite the game telling me stealth was possible. In fact, it wasn't until a story development where Lara lost all her weapons except for her knife that stealth seemed to work. After I got my weapons back, it gave me encounters where enemies permanently viewed one another and all wore helmets, rendering stealth impossible again. The game pretends to give you a wealth of options in approaching encounters, but really every encounter it has a set way it wants you to play. At the same time, enemy AI seems worse than in previous games, with enemies all just rushing you once they know where you are instead of using cover and forcing you to move around like in previous games most encounters. And after all this, there are only a few combat encounters in the whole game. The late game combat sections are like the early game sections from the first two. Half the time NPCs actually do the combat for you, such as in the Unuratu prison break section in which I killed two guards (who were positioned perfectly for stealth kills with no effort from me) and she killed the other four. Such a disappointment.\r\n\r\nIf the temples are watered down and there's no combat in it, all the game really has to grab you with is its story, which is really bad. It's essentially a retread of Rise's story, with Lara going up against Trinity, except this time it's the leader of Trinity and he actually has reasons for wanting to reshape the world, Lara finding a secret civilisation, there being ancient magical creatures to protect the plot macguffin (that you fight once in the whole game) and even an early game fight with wild animals. If the gameplay was actually existent, the plot would have been serviceable enough if a worse retread of the former game, but as it stands it just drags, and at a scene by scene level the writing can be summed up by one scene where Unuratu gives Lara a key and tells her to take it, they both walk down a corridor together, and at the end of that corridor Lara uses the key to open a door. Pointless. I did like the elements of Lara becoming a darker and more vengeful person, but they didn't commit to that, and that was also due to the actions of a guy who they build up as a major antagonist only for him to be killed in a cutscene by an NPC. It's weak stuff, and that's without even mentioning the number of obnoxiously long forced walking sections that suck all the joy out of some of the well crafted areas in the game like Paititi.\r\n\r\nIt's a shame because I like Tomb Raider and I wanted to like this one just as much as Rise, but the pacing and the actual balance of the gameplay itself is completely wrong. Save your money and play a different Tomb Raider game instead.", 0.5022059679031372], ["in short, its different. if you want a longer review, the game doesn't follow the previous tomb raiders functions. perks cost different amounts, weapon upgrades don't carry over, merchants exist, the sound design has been overhauled and more. its a good game. i don't like it as much as the others, but still.\n\nits a good game.\n\nEdit: after playing through the game some more, it has become better. the difference is quite nice when you get used to it.", 0.5015105605125427], ["This one was slightly more generic and less memorable than Rise. But I had a lot of fun anyway.", 0.5], ["Shadow of the Tomb Raider is a pretty good conclusion to the reboot trilogy. The game is beautiful but it also has the gameplay to match. Combat is less intense than the other two games in the trilogy, but it has some solid puzzles and movement that you would expect in a TR title. Shadow of the Tomb Raider also contains optional side missions and side content that is also pretty solid. After you finish the main game, you can go back into the game to complete side missions and other content too. The game has a new game plus mode encouraging you to replay it, but I think that its a title worth replaying. \r\n\r\nOverall, it's a pretty solid game. Definitely worth the money, even better on sale.", 0.5], ["\r\n---{ Graphics }---\r\n☑ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☐ Fast\r\n☑ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☑ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n", 0.5], ["This game. This trilogy. First of all, I must say that I never played any of the older Tomb Raider. So I can only comment on the three most recent games.\r\n\r\nBut this is about Shadow. This have to be one the most gorgeous games I've seen in the last few years. The jungle and temples sceneries are beautiful, and even though it's mostly what you will see -jungle and temples-, the devs have detailed it very very well. And, it's one of those rares games where they actually included flora that move when you move through them.\r\n\r\nThe gameplay is fun, a lot more stealth oriented than the previous two games, although there is still combats and hunting. Some annoying moments, for sure, especially against a certain type of enemy. The puzzles and plateforms moments, although sometime very complicated (or I was very tired) were usually fun, more than a lot of moment in the previous games.\r\n\r\nThe story is good. Not the best in the trilogy in my opinion, but that's ok. I don't ask every chapter in a serie to be better than the last.\r\n\r\nTo me, this game is a solid 8.5/10. But, I think you need to at least have finished the previous two games, because as the closing chapter of the trilogy, a lot is build on the previous stories, and a lot of references are made.", 0.5], ["I just finished playing this absolutely amazing game. I would certainly recommend this great game to any and all Tomb Raider fans, the game doesn't disappoint. While I played the Definitive Edition, I played all of the DLC's and each and every chapter is a whole story all into itself also gives some side characters the ability to give you a few extra missions with really good gear and outfits to help you in your additional quests in the game. It is a heck of a lot of fun and the New Game plus let's you play the game with all your skills unlocked and you can play the game as many times as you want. \r\n\r\nShadow Of The Tomb Raider Definitive Edition is the most amazing game I have ever played I cannot to continue to play it again really soon.", 0.5], ["After playing Tomb Raider, Rise Of The Tomb Raider and Shadow Of The Tomb Raider, I can say that this series improves with every addition. Shadow Of The Tomb Raider will remain as the best within the series. Showcasing Lara Crofts past and choices leading to many lives being saved. The exploration was the most noticeable improvement and combat mechanics. Great game and series and I would highly recommend this series to anyone looking for an adventurous time.", 0.5], ["Honestly, this might be the worst in the series. Long story short:\r\nIf you like harvesting worthless resources for a broken upgrade system, buying worthless items, being told you can't wear half your outfits in certain areas for unknown reasons, and cutscenes that feel like pure padding, then you will like this game.\r\n\r\nHowever, the jungle setting is fantastic. The game is worth it just for that. It's a shame all the other, many changes only hurt the game.", 0.5], ["Can never go wrong with this franchise. Some of the puzzles are kinda lame, but great game, as always.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/750920/header.jpg?t=1729014037", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/750920/capsule_231x87.jpg?t=1729014037", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/750920/capsule_184x69.jpg?t=1729014037"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.tombraider.com/"}, "developer": "Eidos-Montréal, Crystal Dynamics, Nixxes, Feral Interactive (Mac), Feral interactive (Linux)", "owners": "2,000,000 .. 5,000,000", "tags": ["Adventure", "Action", "Female Protagonist", "Singleplayer", "Open World", "Third Person", "Story Rich", "Puzzle", "Stealth", "Action-Adventure", "Exploration", "Survival", "Violent", "Atmospheric", "Shooter", "Gore", "Great Soundtrack", "Multiplayer", "Dark", "Heist"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Traditional Chinese", " Arabic"], "concurrent_plays": 1219, "number_of_achievements": 99, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Phone", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "As Lara Croft races to save the world from a Maya apocalypse, she must become the Tomb Raider she is destined to be.", "long_description": null}