{"name": "Sekiro™: Shadows Die Twice - GOTY Edition", "app_id": 814380, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£49.90", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 73241, "negative_reviews": 4826, "reviews": [["[b]Hesitation is defeat![/b]\n\nThis is by far the best sword fighting game I've ever played. Once you get used to the combat, it's the most satisfying thing ever!", 0.8040608763694763], ["\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☑ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10", 0.7539633512496948], ["When you enter a bosses arena at first, you will probably think that you will never beat the boss; but then you actually do it and the feeling is just magnificent. All the games areas are very detailed and there are lots of thrilling battles, lots of places to explore and you could probably never get bored of this game. Must recommend. :)", 0.5973154306411743], ["I should've played this game sooner. It's truly a masterpiece, the story, characters and the gameplay. In my opinion, the best Miyazaki game.", 0.5799580216407776], ["This game saved me! been having played lots of games in the past i got saturated to the point that i started using steam like a shopping website. i would go around buying games and installing them once. could not play for more than an hour. But this has brought my inner gamer right back. what can i say about this game man!!! IT's a MASTERPIECE", 0.5613231062889099], ["this game has the best and most exhilarating combat of any game I've ever played. No other game will get my heart pounding like this, once you get into the flow of the combat it's so addicting", 0.5289855003356934], ["Sekiro: Shadows Die Twice (2019) was a significant departure from the usual formula, focusing more on pure action and precision rather than RPG elements. Set in a fantastical version of feudal Japan, players took on the role of Wolf, a shinobi seeking vengeance. The gameplay centered on perfectly timed parries and breaking enemy posture rather than whittling down health bars. This shift from traditional Souls mechanics polarized fans, but the intense focus on mastering combat made Sekiro a standout title. Its storytelling was also more direct, following a defined protagonist rather than a nameless, hollow character.", 0.5253682136535645], ["\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☑ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\n\n---{ Author }---\nMuntajir aka GOD\n", 0.523809552192688], ["literally the pinnacle of fromsofts creations, The Perfect Souls game, it's everything I wanted out of dark souls 3 that it didnt deliver on, two handing greatsword brainrot got NOTHING on sekiro, STEP ASIDE elden ring youre sekiros BITCH now istg this game feels like repeatedly getting broken jank ass ds1 ripostes straight through the heart to any me ever enjoying another video game, I have NEVER done a NG+ run of any game EVER but when I beat this I ended up playing it FIVE MORE FUCKING TIMES im dead serious once you get the mechanics DRILLED INTO YOUR BRAIN it is just so inherently satisfying no loot rewards are necessary, like seriously it just perfectly encapsulates the best of soulslike gameplay that i didnt know existed, it isnt just spamming roll and hitting r1 periodically, its so much more dynamic while not letting you get away with just turtling behind a shield, getting the heal/posture refresh upon deathblow let you play so so aggressively and take risks and mean you dont have to run away and estus constantly you can just keep fighting!! being successful in it is purely a matter of getting better, if you can do EXACTLY what the game wants you will win, hit every deflect PERFECTLY and you win its as simple as that. sekiro doesnt let you roll out away from your problems like a COWARD nah u gotta stare them tf down and just smack every single attack they throw at u like its just cheese!!!! nothing will ever give me dopamine spikes like perfect deflecting every single attack a boss hurls at you and deathblowing them, i will never feel true happiness again PLEASE DIVINE DRAGON SMITE ME WITH THE LIGHTNING OF TOMOE AND BRING ME TO THE HEAVENS I CANT PERSIST A SECOND LONGER ON THIS IMPERFECT EARTRH LET ME DEFLECT AWAY ALL MY EARTHLY SINS AND BURDENS", 0.523809552192688], ["Sekiro: Shadows Die Twice was an intense and rewarding experience from start to finish. The fast-paced, skill-based combat felt amazing once mastered, and every boss fight pushed me to improve. 100%-ing the game was tough but incredibly satisfying. It’s easily one of the most fun and challenging games I’ve ever played.", 0.523809552192688], ["10/10 Masterpiece, best combat mechanics out of all Souls-like games (I've only played Elden Ring).", 0.523809552192688], ["I love this game!!!\n\nI've never enjoyed dying constantly to the final boss, every parry you make it's just so satisfying.\n\nNot to mention the scenery of this game... It's gorgeous\n\n10/10 fr", 0.523809552192688], ["\"Sekiro: Shadows Die Twice is FromSoftware's finest, delivering razor-sharp combat, fluid movement, a hauntingly beautiful world, and unforgettable boss battles. A true masterpiece.\"", 0.523809552192688], ["Probably the best fromsoft game on an objective level. It has the most coherent story, themes and mechanics of anything they've made. Very close to a perfect game.", 0.523809552192688], ["i played this game on console and loved it so much i had to buy it again on PC and its defiantly my favourite game", 0.523809552192688], ["-{Story}:  8/10\n-{GamePlay}:  11/10 *\n-{Graphics}:  9/10\n-{Music}:  8.5/10\n-{WorldDesign}:  8.5/10\n-{Bosses}:  10/10\n-{Performance}:  9/10\n\n----OVERALL: 9.0/10 ---- ", 0.523809552192688], ["Phenomenal experience. Occasionally punishing and difficulty progression is too abrupt. Could have been balanced better, but otherwise a thrill. Highly recommend.", 0.5220588445663452], ["Would recommend playing this game as it has a very fun and fluid combat system. \nHowever this game is not without flaws. \n- sometimes it feels devs just stall the game so that people would spend more time playing it. For example if you die you have to run all the way from your last save point and kill all adds again, in order to reach the mini boss. Would be nice to have Marika Statue like in ER and obviously no adds around a mini boss\n- some bosses have literally identical phases, for example Corrupted Monk\n- personally not a fun of stealth games, sometimes it felt I was playing Assassin Creed\n- farming charms to use prostetics isn't fun, so I just stopped using prostetics and any type of consumables", 0.5220588445663452], ["I learned to stop staring at posture and health bars and just focus on the fight.\nReacting to patterns, punishing openings, staying sharp — that’s where Sekiro shines.\n\nDon’t be afraid to look up a counter or two. The tools are there for a reason.\nThe combination of prosthetics and combat arts gives you just enough versatility to handle anything, as long as you stay present and adapt.\n\nThis game taught me to read movement, not numbers.\n\nThe flow of deflecting, dodging, and countering in Sekiro felt more natural to me than anything in Dark Souls or Elden Ring.\nThere’s no builds or stats to hide behind — just timing, rhythm, and growth. \n\nIf you need help, check out Sekiro Guru on YouTube. Great guides, no fluff.", 0.5220588445663452], ["Not the one I've spent the most time with, but it's my favorite FromSoft game by a wide margin. It makes the balance of parrying, movement and attack paramount and spends an entire game pushing that one thesis until it hits a phenomenal peak with its final boss fight. I wish more games would model their thinking in this direction rather than chase Dark Souls as a model. Choose player verbs carefully and then absolutely nail them. \r\n\r\nI will say though, the game takes a minute to get going. If you can make it past Lady Butterfly the game opens up like an orchid. It gets SO good.\r\n", 0.52173912525177]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/814380/header.jpg?t=1726158438", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/814380/capsule_231x87.jpg?t=1726158438", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/814380/capsule_184x69.jpg?t=1726158438"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.sekirothegame.com/"}, "developer": "FromSoftware, Inc.", "owners": "10,000,000 .. 20,000,000", "tags": ["Souls-like", "Difficult", "Action", "Singleplayer", "Ninja", "Stealth", "Adventure", "Third Person", "Open World", "Story Rich", "Violent", "Atmospheric", "Assassin", "Dark Fantasy", "Hack and Slash", "RPG", "Gore", "Great Soundtrack", "Rhythm", "Dark"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Japanese", " Korean", " Polish", " Russian", " Simplified Chinese", " Thai", " Traditional Chinese", " Portuguese - Brazil"], "concurrent_plays": 7746, "number_of_achievements": 34, "categories": ["Single-player", "Steam Achievements", "Full controller support", "Steam Trading Cards", "Steam Cloud", "Remote Play on Tablet", "Remote Play on TV", "Family Sharing"], "genres": ["Action", "Adventure"], "short_description": "Game of the Year - The Game Awards 2019 Best Action Game of 2019 - IGN Carve your own clever path to vengeance in the award winning adventure from developer FromSoftware, creators of Bloodborne and the Dark Souls series. Take Revenge. Restore Your Honor. Kill Ingeniously.", "long_description": null}