{"name": "BONEWORKS", "app_id": 823500, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£24.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 26868, "negative_reviews": 2141, "reviews": [["When I had first picked this game up, I had a hard time getting into it and ended up putting it down for a while. After my VR legs got a bit stronger, I came back and was absolutely blown away. I know this game came out some time ago now but I was finally able to experience it in all its glory. My only complaint is that there isn't more. Also, the soundtrack is perfect. Michael Wyckoff fully understood the assignment.", 0.523809552192688], ["This game is just amazing. Like, the physics, the graphics, the gameplay, the story, the creators, the soundtrack, the design, the characters—everything about this game is amazing. I've played Bonelab before, but it is nothing compared to this game.\n\nI’ve got 10.8 hours on it, and I don’t think I’m even halfway done (probably because I’m goofing around with the physics too much). And OMG, the sandbox? A M A Z I N G. It’s so much fun—it’s like you’re in real life, but you can do whatever you want. There are mods too if you want to experience something new.\n\nIf you haven’t bought it yet, I don’t know what you’re doing reading this. Go buy it.\n\n", 0.523809552192688], ["Boneworks is amazing and thankfully got seen as a great game which lead to bonelabs. Boneworks is GOATED", 0.52173912525177], ["With the limited amount they had to work with this game REALLY shined and deserves to be played before Bonelabs. While Bonelabs Sheer amount of content is amazing and the soundtrack is great, if you want to play for the lore and atmosphere, play Boneworks. Genuinely amazing game.", 0.5032750964164734], ["Breathtaking. A whole new world.\r\n\r\n\r\n10/10, even with the jank.\r\nFavorite VR game of all time.", 0.5032750964164734], ["great game and the graphics are great.  campaign= not too hard but stressful, engaging story overall\r\n\r\nbut i cant find npc capsules :(", 0.5], ["Uh, summa-lumma, dooma-lumma, you assumin' I'm a human\r\nWhat I gotta do to get it through to you? I'm superhuman\r\nInnovative and I'm made of rubber so that anythin' you say is ricochetin' off of me, and it'll glue to you and\r\nI'm devastatin', more than ever demonstratin', how to give a mother- audience a feelin' like it's levitatin'\r\nNever fadin' and I know the haters are forever waitin' for the day that they can say I fell off, they'll be celebratin'\r\n'Cause I know the way to get 'em motivated, I make elevatin' music, you make elevator music", 0.5], ["The game is good BUT. THIS IS THE MOST OUTRAGE GAME I EVER PLAYED, IF YOU DIE ONCE YOU ARE FORCED TO START FROM THE BEGINNING. (THE LEVEL TAKES YOU TO BEAT IT, LIKE 30 MINUTES IF YOU ARE A SWEAT). But still, recommend.", 0.5], ["LOVE the game! I played bonelab on my quest, thinking my quest and pc wouldn't be able to run boneworks together before it. A few months later, here I am with boneworks! I definitely think the campaign is better than bonelab's. I have to say, the puzzles are also more challenging and make you think. Thank you Stress Level Zero for developing this amazing game! Looking forward to the remaster!", 0.5], ["If i ever get asked the question, \"If you could play any game for the first time again, what would it be?\" It would easily be BONEWORKS, Boneworks is a phenomenal game, with so much rich story and lore I have a hard time understanding it half the time, its gameplay is very smooth (if you have a good connection lol) and the guns are amazing compared to other vr games guns, its gameplay is simple to understand with neat physics based movement and gameplay and an entire modding scene you can get into when you're done! The soundtrack is one of the best and most fitting with clean synthetic tracks mixed with old fantasy themed tracks. The next game, BONELAB mixes the dark fantasy and synthetic simulation themes together perfectly, I could do an entire second review on Bonelab but I don't own that on my steam account, shucks. ):", 0.5], ["super fun and easy to mod and play multy player", 0.5], ["Pioneer in game physics, future of VR, blah blah blah, go beat the void out of Ford", 0.5], ["good story and good cualaty", 0.5], ["Very interesting environments and a little less interesting puzzles and combat.\nThe gun physics and normal physics is satisfying.\nVery nice soundtrack.\n", 0.5], ["One of my favorite games now, very fun, physics are great, story is awesome, not *too* much of a challenge. 9.5/10 still better than Bonelab", 0.5], ["This game is pretty good but i can't say i love it. This game is glazed more than Lebron James and is honestly just ok. This is definitely in the big three though alongside bonelab and half life alyx for vr games. It was great back then but now is underwhelming compared to bonelab.", 0.49371278285980225], ["Good game but my PC fans keeps taking off like a fucking airport", 0.48859933018684387], ["Boneworks is a fine game. It's just that, and exactly that. It's fine. \n\nIt does an awful lot of things, and none of them are going to wow you if you've played the likes of Blade and Sorcery, or HLAlyx. The melee is clumsy to the point of bare usability, the shooting is fine, but some guns aren't responsive for reloading, the puzzles require seconds of thought, and minutes of cumbersome manoeuvring. The story is... There. It's got some acting and voice acting, and even something like a plot, but it's forgettable. But despite all this mediocrity, it does boast an impressive collection of stuff, and that alone is worth something. I'm not sure what, but something. \n\nOverall, Boneworks is a game you get on a hefty sale, to add to your repertoire of \"fuck about\" games. It's repetitive and predictable, but fun nonetheless.\n\n6/10.", 0.4729729890823364], ["jack black should play ford in the movie/show adaptation when it comes out frfr ong", 0.52173912525177], ["Bro so good! i have beat the story twice and this game is amazing! my first game was bonelab and then i heard boneworks was thing I had to play it! 5/5!", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/823500/header.jpg?t=1581381377", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/823500/capsule_231x87.jpg?t=1581381377", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/823500/capsule_184x69.jpg?t=1581381377"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.stresslevelzero.com"}, "developer": "Stress Level Zero", "owners": "1,000,000 .. 2,000,000", "tags": ["VR", "Physics", "Action", "Sandbox", "Shooter", "Singleplayer", "Great Soundtrack", "Adventure", "Puzzle", "First-Person", "Simulation", "Realistic", "FPS", "Violent", "Indie", "Horror", "Parkour", "Sci-fi", "Gore", "Funny"], "languages": ["English"], "concurrent_plays": 49, "number_of_achievements": 16, "categories": ["Single-player", "Steam Achievements", "Tracked Controller Support", "VR Only", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "Simulation"], "short_description": "BONEWORKS is an Experimental Physics VR Adventure. Use found physics weapons, tools, and objects to fight across dangerous playscapes and mysterious architecture.", "long_description": null}