{"name": "Valheim", "app_id": "892970", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "full"}, "price": {"currency": "NOK", "original_price": "", "final_price": "145,00 kr", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 230345, "negative_reviews": 12155, "reviews": [["Well, I played the shit out of this  game. This is the perfect game to AFK your mind and listen to whatever podcast or show for hours and hours. Play around with mods, challenge yourself as a vanilla solo champ or just bring your friends. This game strikes a nerve within my soul. It is perfect for creative building, and even if you suck at that the game is solid just as an adventure. I plan to double my playtime the coming years and have no plans or intents to stop. The gameplay loop and the possibilities are just endless. Valheim is not a game, it is a place of contemplation and rest for the soul.", 0.8721862435340881], ["I have supported this games development since release as it was a gem among gems. But as of late, it has been shown that the developers and their mods (if they are using any) do not know how to deal with people enquiring or criticising their development timeline, as their only solution towards people concerned with its development and wishing for content is issuing them warnings and bans. Accusing people of Spam, and being off-topic in derailing a discussion....in a dev log, about the development of the game....see where this is going? Here is a copy/paste of my comment that was issued a warning in their latest Dev Log;\n\n\"Apparently my comment calling out the devs on stretching out a 1 year roadmap into 5 years development was taken down with me issued a \"Warning\" for Spam....of which the comment did not follow the definition of Spam in either noun or verb. So now i am going to air out some dirty laundry. Their 2021 Roadmap consisted of;\n\nUpdate 1:\n-Hearth and Home\n\nUpdate 2:\n-Cult of the Wolf\n\nUpdate 3:\n-Ships and the Sea\n\nUpdate 4:\n-Mistlands\n\nIf Odin Wills It:\n-Multiplayer interactions\n-Combat improvements\n-Moon Phases\n-Tar Pits\n-Vender Inventory Expansion\n-Svartalfr Brigands\n-More Unique Locations\n-Sandbox Mode\n-Munin\n\nNow they later put a warning at the bottom of this original roadmap stating it was cancelled. Note, that the game released in Feb 2021, and they only released the hearth and home update in Sept of 2021. Mistlands didn't come out until Dec 2022. In Aug 2023 we got Hildir's Request, a new merchant....See where this is going. It practically takes them between 7 to 15 months for content updates initially promised for the first year, and whoever moderates this channel got upset that accused them of stretching out development thanks to their overwhelming success on launch, and with covid.\n\nSo to the moderator deleting peoples messages, banning disgruntled consumers etc, if you can't respond to an individual in a thread and disprove anyone's claims, then do not flex your authority and state someones claims go against guidelines just because you are upset by them.\"\n\nThey banned me after i saw another person who questioned their development as did i, whom I simply warned them that their comment might get a warning or banned.....ironic huh? If this is how they treat their community, then i cannot support this game anymore.", 0.7422173619270325], ["Kind of mixed.  i've played valheim for a long time and love the game.  lately the developers are pushing out updates without really testing, and the latest update 0.220.5 is an absolute april fool JOKE of an update.  they added a Pet Rock...what a joke and waste of effort.  It completely broke the game...literally. and made it so the mod community is scrambling to catch up since they did not release the update for actual testing by the community.  the valheim developers have grown rocks for heads, which is why they gave us Pet Rocks in the game.", 0.668474555015564], ["This game starts out incredible, I loved playing through the first four biomes.  They all feel fun to progress through and explore and the upgrades to your equipment feel rewarding.  However, the entire second half of this game ranges from boring to borderline unplayable.\n  The Plains is a boring, wide open field with next to nothing of interest to discover or explore.  99% of the Plains is empty nothingness and the remaining 1% is goblin camps.  This biome feels vacant and lifeless.  The Mistlands is an absolute chore to play through.  It's an endless labyrinth of cliffs with little to no visibility.  The combat is very clunky in this biome due to the nature of the terrain and the hitboxes of the enemies.  I've lost count of the amount of times that I've been hit by an enemy that I cannot hit because they are either lower or higher up than I am.  Finally, the Ashlands abandons all other forms of gameplay and devolves into endless fighting.  Want to explore, mine, or build?  Too bad, because 99% of your time in this biome will be spent fighting the constantly spawning, endless hordes of enemies.  This game does not have the combat or the movement system to be Dark Souls, yet the developers made a biome that's just that.  If the sheer volume of enemies isn't bad enough, this biome has some of the most annoying enemies in the game.  There are two flying enemies with wonky hitboxes that are difficult to hit with melee weapons, there are skeletons that sit back and throw rocks and shoot arrows at you constantly and run away if you try to attack them, and there are giant lizards that will send you flying with how much knockback they have.\n  The difficulty of this game is simply due to it being unfair.  The combat is wonky, the hitboxes are bad, and the enemy density is ridiculous.  This wasn't as much of an issue in the earlier stages of the game because the game focused more on exploration, but when the second half of the game focuses more on combat, the issues become apparent.\n  I truly wish I could recommend this game, because it has a lot of potential and I very much enjoyed the earlier stages, but when half of the game is a tedious slog, I simply cannot.", 0.6545226573944092], ["Amazing game, great music, great gameplay and ambiance. Building is very satisfying. #1 survival game IMO. I'm 450 hours in and i'm on my 4th playthrough. Highly recommend", 0.648252546787262], ["Laziest devs ever made, they've been in EA for 5 years, with only a handful of updates, and now they are making a board game and mini-series instead of actually working on the game. The game is okay, but the way the devs have handled EA, I will never buy another of their games until it is complete, if at all.", 0.6180879473686218], ["I've always enjoyed this game but the latest update for April Fools was the dumbest thing I've ever seen.\n\nAlready facing such huge content droughts for an Early Access game and instead we're seeing developers sinking time into such a dumb fake update. \n\nIf it wasn't for the content drought it may have seemed funny but you also pushed a minuscule patch to 220.5 screwing mod makers and dedicated servers.\n\nTLDR: Had high hopes for this game and what it could be. Instead we are getting barely anything each year.", 0.5811614394187927], ["At first it's very fun, but later into the game gets fast boring. Exploring after the plains just getting tedious. The ship is slow and there is just nothing happening during the traveling.\n\nBeside that the Developer had more than enough time to cook and there are still so many QoL flaws. Many of them luckily get fixed by the modding community, but just the Game without Mods can be very annoying. For example, you need to craft A LOT but always need to go to a crafting station for it and also need the ingredients in your inventory. And the chests are so tiny, that you have for 1 resource 1 chest, because the stacks are also very small and you have only 10 slots in the first chest, which you will have for a very long time. So your base has a bit into the game 50 different chests, and each time you want to craft something, you would need to grab the items out of the chest.\n\nAlso they still didn't fixed the performance issue with large bases. Big recommendation: build your first base small, and as soon as you are able to, try to find a small sandbank or stone far out on the ocean and build there your real base. This way, you will still be able to always have above 60fps in your base.\n\nI've seen, that they made some progress in development lately with new zones etc. compared to the release, but game mechanic wise, sadly, is also nothing new. Fishing for example is still very dull. The skill system still don't describe, what it's doing. It just feels so raw on so many loose ends, even though it's already been out for so many years.\n\nOverall is Valheim still pretty decent, since the setting and atmosphere are done very well, the boss fights are good, but also rare (only 7 bosses). The combat system overall is also okish. The building part is nice, makes fun to build with your friends your own small viking village. We also didn't encountered any major coop bugs, beside that with a larger base the fps drops strongly on weaker cpu, gets multiplied by players, that build the base. Strong per core performance recommended (above at least 4ghz for late game), since the clock speed determines very strong the fps.\n\nIf the developers are able to get the game more interesting mechanic wise, especially the ship sail part with friends and also diminish the QoL flaws, i would probably change my rating.\n\n", 0.565539538860321], ["Going to state that I thoroughly enjoyed this game for a long time, the first 5 biome's are enjoyable and fun to explore, sure they can be difficult but you're not hamstrung getting one shot as soon as you aren't on a flat surface managing stamina for blocking, fighting and keeping your footing.\n\nThis is almost impossible in Mistlands, 95% of that biome is steep rocks which you have to climb, good luck if you encounter a seeker because I can guarantee you will not hit them, let alone see them at all because of the mist and your stamina resource will always be drained. Even in the event that you do hit, because you're not on a level surface your strikes, regardless of weapon, will miss constantly to then be two-tapped by a seeker and you die. \n\nI get the game is meant to be viking purgatory, earning your way in to Valhalla, but this is an absolute slog and I gave up when trying to find more Mistland biomes to find those caverns with the one gem to make the next lot of gear refused to spawn, sailing more than 1 hour in a direction to only get killed before a portal could be set up. Sure it might be a skill issue as well as RNG. But when you arrive at the Mistlands, pop your Wisp out and suddenly a Gjall drops its load on your face while several ticks tag team you before I even got off the fucking boat, there's no hope in Hell... Or should I say Valhiem.   \n\nI know I am complaining all the way here. If you got this far, congrats. But to the devs, you have a good thing going on here, but Mistlands and what I have been told Ashlands being the same, you need to fix the issue of the terrain gen or fix the stamina usage and weapon mechanics. It is punishing and un-fun, nothing makes me want to go back and killing the Plains boss felt like that was more than enough for me to never play the game again.\n\nI recommend that Mistlands onwards is where people should stop playing. Mod it if needed, but for anyone wanting to play the game: Meadow, Dark Forest, Swamp, Mountain and Plains are decent, fairly balanced and the enemies while super dangerous in some parts, can be fought properly. Beyond that don't bother if you want to experience absolute frustration.       \n\n", 0.5527514815330505], ["very good game. just keep in mind the progression can be ass-grindingly slow so if you don't like slow progression, hard enemies, and so on, you can change your world settings to be basically whatever you want. my only complaint that running everywhere gets pretty old because the map is so huge- and there's not as much to explore as in other games, but still got my money's worth insofar out of it", 0.5495495200157166], ["At one point in time this was my favourite survivalcraft after Subnautica.\n\nEarly on I loved the mix of cozy, chill vibes in the base building, and the dark, spooky exploration and dungeon diving. But a mixture of a glacial development pace and an increasingly unfriendly and time-hogging gameplay loop as you go through each zone just burned me out on it. As much as I adored the base building mechanics that (At the time) felt VERY well tuned and easy to use compared to earlier survivalcrafters, it has become a victim of its scope creep and ever-lengthening development cycle. It's also just not fun having each new zone be exponentially harder than the last one, and with increasingly frustrating wrinkles to deal with. Mistlands and Ashlands are just agony with no real intrinsic reward for participating in them. \n\nIt's also being not only overtaken, but lapped by other games in the early access space, and the survivalcrafter genre more specifically which are managing their development pace far better (Valheim's roadmap has long since been abandoned, only 4 months after release), are communicating more clearly and frequently with the playerbase, and are implementing quality of life changes which make this game feel increasingly outdated despite still not having hit 1.0. Finally, it feels disrespectful to have 3-4 marketing posts talking up their various merchandising efforts for every 1 update that actually talks about the development of this 4 year old early access game.", 0.5472978949546814], ["This game is so close to being really good but it is way too punishing to be fun long term. I love the exploration and the crafting / advancing technology elements. But the enemies are relentless, chasing you for miles, many of them have 1 hit kill moves regardless of if you are teched appropriately, and the map distances are huge so it takes forever to get back to loot your body. And often times the enemy that killed you is body camping you. Enemies don't seem to have stamina and ghost through obstacles that make your character stall out. Also, why would there be an intentionally un-fun \"no using portals with minerals\" rule when the most boring thing about this game is running 20 miles to find the next ore deposit.", 0.5327103137969971], ["Love the game, my 900+ hours should be evident of that. \r\nSadly it feels like the \"game\" became a platform to sell merch. The updates to the game feel less common than the ones promoting various merchandise. Not that it's bad, but come on... the game is not fully released yet :/", 0.5275590419769287], ["Actually terrible now. Recent updates have made the game nearly unplayable with monster spawns being far to aggressive and plenty of other bugs and issues that constantly pop up. This game has fallen quite far and hasn't even released yet. Get any other survival game.", 0.523809552192688], ["Millions of sales, over 4 years in early access, still the constant reminder this pretty simple game, full of potential, is still unfinished and unpolished.  Wake me up when it's finally finished.", 0.523809552192688], ["It's a brilliantly designed game. I feel like the game is definitely more fun to play with friends rather going solo. It does give minecraft vibes at the start but the game has a variety of mechanics that make it stand out.\r\n\r\nThe game has very realistic mechanics and most of them aren't nuisance. While balancing the game it's really hard to make realism \"fun\" and I would say this game while initially did annoy me with the realism, over time I was very impressed with it. Some things I still feel like can be improved but overall I am very happy with this purchase.", 0.523809552192688], ["a lovely atmospheric, difficult survival game, coupled with a less-then stellar development team and performance issues. ive been playing valheim since it released in early access and while i do love it, i kinda feel like iron gate has taken advantage of their initial burst of success. updates are released slowly, and lately are nothing-updates plus some marketing. theyre already way past their first dev roadmap back in 2021 and honestly at this point id be surprised if deep north releases in 2025. i know game dev aint fucking easy, but no game should be in early access for 5 years. think for a second of, Abiotic Factor another game of a similar vein. while a bit less smaller of a scope with a set facility and a linear story, will have released into early access, gone through almost 8 major updates, and fully released into 1.0 with more minor updates later, before valheim. the community manager on the discord seems like an ass too.  TLDR, i think there are better survival craft games out there, minecraft, abf, hell even the new runescape game, that respect your time, and have a more proactive development cycle.", 0.523809552192688], ["I wish the day would come when I can finally play v1.0 of the game.\nWaiting the release more then my own birthday\nPray to Odin and other gods to make it happen!", 0.523809552192688], ["im not sure whether i would play this game without mod. since the building part very frustrating and annoying i think its lowered my satisfaction. otherwise its worth the try", 0.523809552192688], ["great game like minecraft but with some twists, higher graphics, more to do, and finally very grindy. also lots of stuff to do.", 0.523809552192688]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/892970/header.jpg?t=1738051073", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/892970/capsule_231x87.jpg?t=1738051073", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/892970/capsule_184x69.jpg?t=1738051073"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.valheim.com"}, "developer": "Iron Gate AB", "owners": "20,000,000 .. 50,000,000", "tags": ["Open World Survival Craft", "Survival", "Online Co-Op", "Open World", "Multiplayer", "Building", "Crafting", "Base-Building", "Exploration", "Co-op", "Adventure", "Difficult", "Mythology", "Sandbox", "Third Person", "PvE", "Singleplayer", "Action", "Early Access", "Indie"], "languages": ["English", " French", " German", " Spanish - Spain", " Russian", " Simplified Chinese", " Turkish", " Japanese", " Portuguese - Brazil", " Polish", " Ukrainian", " Italian", " Korean", " Traditional Chinese"], "concurrent_plays": 25959, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "Full controller support", "Steam Cloud", "Remote Play on Tablet", "Family Sharing"], "genres": ["Action", "Adventure", "Indie", "RPG", "Early Access"], "short_description": "A brutal exploration and survival game for 1-10 players, set in a procedurally-generated purgatory inspired by viking culture. Battle, build, and conquer your way to a saga worthy of Odin’s patronage!", "long_description": null}