{"name": "Sid Meier's Civilization® V", "app_id": "8930", "platforms": {"windows": true, "mac": true, "linux": true, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£19.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 9, "review_decription": "Overwhelmingly Positive", "positive_reviews": 72508, "negative_reviews": 3314, "reviews": [["This is still the best Civilization game. Save your money, skip 6 and 7.", 0.7781130075454712], ["Actually GOATED game, Don't waste time or money on Civ 6 or 7 this with all DLC is some of the greatest gameplay ever. I have gotten friends, family, and loved ones who are not into video games, enjoy this game. Fun single player, fun multiplayer. Overall this goes into my top 5 games of all time.", 0.6595940589904785], ["Civ V is the ultimate game of building empires, crushing enemies, making friends, betraying those friends, and then pretending it was all part of your master plan. I started playing as a peaceful cultural leader and ended up nuking Gandhi because he looked at me funny.\n\nEver wanted to lead a global superpower while sitting in your pajamas eating cereal at 3am? This game’s for you.\n\nI’ve learned more history from Civ V than I ever did in school. Also, I now have an irrational fear of Montezuma and an unhealthy obsession with hexagons.\n\nHighly recommended if you like strategy, global domination, and losing track of time until it’s suddenly Tuesday.", 0.6185163259506226], ["A great game, it's only flaw is the unfunctional multiplayer that was never fixed.\nA great game for solo playing.\nI highly recommed the dlc's.", 0.5666845440864563], ["After Civ VI failure  firaxis manage to fail on Civ VII... and I decided back to Civ V again...\n\nit was much more stable, I have never encounter any problem with it. Civ 6 has a lots of perks but also has many downside, especially resolution and newer gaming PC setup upgrade they always crash or force close. Civ VII you can read steam review already.\n\nso go back to Civ V and buy it when on sales!", 0.5419847369194031], ["I feel a deep repulsion to playing a grand strategy game built for toddlers that discourages expanding your empire.", 0.530867874622345], ["Ever since the old launcher was removed, I haven't been able to play this game. YOU MADE THIS GAME UNPLAYABLE AND IF I CAN'T PLAY IT I WANT MY MONEY BACK!", 0.5307855606079102], ["Don't even buy 6 or 7, they don't make em like this here. \r\nIt's pretty visibly dated at this point... idgaf. What would you prefer, preordering 60 bucks of mid and pray that the company that already fleeced you of your money patches it through paid dlc, or get the game that was already half a decade old by 2015 so the game and all its dlcs are like 30 bucks over the summer?\r\nMy grandkids are gonna have to endure this same rant except by then I'll probably have a Valium IV bag that they can hook me to to shut me up.", 0.52173912525177], ["You have to get the Vox Populi mod for it to be good, it's a big community project, and years and years of updates have made it the definitive 4X game.  It's unlikely another Civ game will ever have half as much depth and balance.", 0.5], ["Best Civilization game to date. (I've been playing Civilization games since Civilization I)", 0.5], ["Sid Meier’s Civilization V: The Ultimate Strategy Challenge\n\nSid Meier’s Civilization V is a monumental achievement in the realm of turn-based strategy games, offering an intricate and rewarding experience for players who crave deep strategy and long-term planning. In this critically acclaimed installment of the Civilization series, you take on the role of a leader tasked with guiding a civilization from the dawn of time into the future, competing against other civilizations for dominance through diplomacy, military, science, and culture.\n\nThe beauty of Civ V lies in its vast complexity and the countless strategies that players can employ to achieve victory. Whether you choose to conquer the world through military might, build a thriving economy, or lead a peaceful, cultural renaissance, the game offers multiple paths to success. Every choice, from city placement to research priorities, has long-term consequences that can either help or hinder your civilization’s growth.\n\nThe turn-based mechanics allow for a deep and thoughtful approach to each decision. You must manage everything from diplomacy with other civilizations to resource management and the development of technologies. Choosing which wonders to build, what policies to adopt, and how to position your military units can be the difference between winning and losing. Each of your decisions impacts your relationship with other civilizations and can set the stage for alliances or rivalries that shape the entire game.\n\nThe game’s world is a beautifully designed, hex-based map that presents a variety of terrains and strategic opportunities. The visual design, though dated by today’s standards, remains charming, and the colorful, top-down view allows you to easily navigate your empire. Units move across the map with fluidity, and the animations for combat and city-building are satisfying without being overly complex.\n\nOne of the most praised aspects of Civilization V is the AI. While not flawless, the computer-controlled civilizations are intelligent and react dynamically to your actions. They form alliances, declare war, and offer trade agreements, creating a world that feels alive and reactive. However, they can also be unpredictable, offering unexpected challenges and alliances that force you to rethink your strategies on the fly.\n\nThe diplomacy system is a standout feature, allowing for a nuanced approach to interactions with other civilizations. You can make strategic alliances, trade resources, or even engage in espionage. However, it’s never a guarantee that another civilization will keep their word, adding a level of tension and intrigue to the game. The relationships you foster—or destroy—have significant implications for the course of the game, and managing these relationships can be as critical as managing your own empire.\n\nThe game’s music and sound design are also noteworthy. The soundtrack is rich and immersive, with culturally specific themes for each civilization that enhance the game’s atmosphere. From the stirring strings of the Roman theme to the calm melodies of the Chinese civ, the music adds an emotional layer to the experience, while the ambient sounds of the world further draw you into the game’s immersive environment.\n\nMultiplayer, though not as polished as the single-player experience, offers a competitive and collaborative element to Civ V that brings an additional level of excitement. Whether you’re working with friends to build a peaceful cooperative empire or waging war in a heated battle for supremacy, the multiplayer mode offers a unique and unpredictable challenge.\n\nThe depth of Sid Meier’s Civilization V is unmatched, and it remains one of the best examples of the turn-based strategy genre. The game’s difficulty can be adjusted to cater to both newcomers and seasoned players, but even at lower levels, the strategic choices can be overwhelming. The sheer number of variables—military, culture, technology, diplomacy—ensures that no two games are ever the same.\n\nUltimately, Civ V is a game about patience and long-term strategy. It’s a slow burn, where every turn feels significant, and every choice can impact the future of your civilization. Whether you’re playing a single session or embarking on a campaign that stretches for hours, Civilization V offers a deeply rewarding experience that challenges your strategic thinking and keeps you coming back for more. It’s a game that never truly ends, as the possibilities are endless, and every game is a new adventure in the pursuit of global dominance.", 0.5], ["Have to say, this is probably the best Civ game, having played all of them since Civ2.", 0.5], ["I mostly play when I'm watching TV and relaxing.  It's nice to have a game that doesn't take a huge amount of concentration and escape for a while.  You go as deep as you want or keep it simple by the level difficulty.", 0.5], ["[h1]\"Don’t fire till you see the whites of their eyes!\"[/h1]\n\nFor the best game experience (and complete set of graphical options; dx10/11 features, anti-aliasing and high quality “leader scene” option), install the \"windows\" version (select your default proton runner in your game settings) instead of Aspyr's good for nothing port which also suffers from long loading times, issues with mod(s) and random crashes.\n\n[i]I was reminded of this gem when I read about the horrible state of Civilization 7 (incomplete [missing features], butchered [overall gameplay and ui]) and how the main game is now piecemealed one dlc at a time, instead of fixing it and hiring new developers after the core team was let go (rumored to be working on Microsoft’s Civilization competitor) and thought I’d give the game another go, while it was still fresh in my memory.[/i]\n\n- linux build is unstable (crashes) and lacks many graphical features[1]\n- windows version has major memory leak with drops of 99% performance[2][3]\n\n💔💔💔🖤🖤 v1.0.3.279\n\nSteam Linux client (beta)\nSteam Linux runtime 3.0 (sniper) [client_beta]\nProton Experimental [bleeding-edge]\n\n[i][1] dx10/11 features, anti-aliasing and high quality “leader scene” option\n[2] mouse movements causes major stuttering after 50 turns\n[3] streamed texture issue when you hit the 32-bit application limit\n\n[strike]PROTON_NO_ESYNC=1 (disabled by default)\nPROTON_FORCE_LARGE_ADDRESS_AWARE=1 (enabled by default)\nPROTON_USE_WINED3D=1\nPROTON_NO_FSYNC=1\nPROTON_HEAP_DELAY_FREE=1\ngamescope -w 1920 -h 1080 -W 1920 -H 1080 -b -- %command%\ngamescope -w 1920 -h 1080 -W 1920 -H 1080 -f -- %command%[/i][/strike]", 0.5], ["The greatest game I have ever played. So much of my life has been spent in this game. There is endless replayability to be had here, Each new playthrough feels just as fresh as the last. NEVER does this game get old for me. A true masterpiece, to the point that I, along with many others, skipped out on the sequels. Though there are flaws to be found,  it is hard to improve upon a game like this, which is why so many people are still playing this game to this day.", 0.5], ["For me, this version hits a sweet spot of graphics, features, and gameplay. Despite owning several other versions, this is the one I tend to pick most often.", 0.5], ["Great game, beautiful graphics even on Low and quite addictive like most Civ games.", 0.5], ["Great classic game.  You gotta try it multiplayer though.", 0.5], ["When Civilization XVIII comes out I'll still be playing this instead. I see the start menu of this game more than I see my wife. As soon as my son is of age I'm going to whoop his ass in CIV V every night. This game is crack. I love this crack.", 0.5], ["Its just fantastic, unless you start next to George Washington and he shows up with a giant army and eats you.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/8930/header.jpg?t=1724341158", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/8930/capsule_231x87.jpg?t=1724341158", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/8930/capsule_184x69.jpg?t=1724341158"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.civilization.com"}, "developer": "Firaxis Games, Aspyr (Mac), Aspyr (Linux)", "owners": "10,000,000 .. 20,000,000", "tags": ["Turn-Based Strategy", "Strategy", "Turn-Based", "Multiplayer", "Historical", "4X", "Addictive", "Singleplayer", "Hex Grid", "Grand Strategy", "Replay Value", "Co-op", "Economy", "Tactical", "Diplomacy", "Moddable", "Simulation", "Classic", "Great Soundtrack", "Touch-Friendly"], "languages": ["English", " French", " German", " Italian", " Spanish - Spain", " Polish", " Japanese", " Korean", " Russian", " Traditional Chinese"], "concurrent_plays": 16418, "number_of_achievements": 286, "categories": ["Single-player", "Multi-player", "Steam Achievements", "Steam Trading Cards", "Steam Cloud", "Remote Play on Tablet", "Family Sharing"], "genres": ["Strategy"], "short_description": "Create, discover, and download new player-created maps, scenarios, interfaces, and more!", "long_description": null}