{"name": "Last Epoch", "app_id": "899770", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£29.50", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 45539, "negative_reviews": 8179, "reviews": [["Within minutes of playing a Void Knight Sentinel, I realized something important, I had been gaslit by game design for years. This game respects my time, and build choices. Each ability has its own specialization tree, meaning you’re not just choosing skills—you’re shaping them. My Void Knight doesn’t just deal damage; he travels through time to delete problems before they happen. Sometimes I don’t even know what I killed. It just stopped existing. \r\n\r\nFeels like a power fantasy where the devs actually want me to have fun. I didn’t have to watch a 3-hour math video to understand what I was doing. I didn’t have to ask Reddit if my build would be viable in two weeks. And not once did a dev named Jonathan Rogers tell me to “trust the vision” while gutting movement skills and calling it progress.\r\n\r\nHighly recommend, especially if you’re burned out from GGG’s “vision.” The only vision I’m following now is the one from the Void.", 0.8661625385284424], ["Hey Boys,\n\nI sat down to try Last Epoch at 7 PM. Just a quick session, I said—stretch the legs of my Sentinel a bit before bed. Somehow, I woke up and the clock said “tomorrow.”\n\nThe night disappeared, my back ached, and my eyes were dry, but my soul? Rejuvenated. I hadn’t felt this hooked since someone dared me to finish a pint of ice cream at 2 AM—only this time, the stakes were higher.\n\nThere’s a certain magic when a game keeps you up all night without regret. That \"just one more echo\" feeling hit different in Last Epoch. Suddenly it's 6 AM, and I’m facing down death itself with a sword that glows like holy vengeance.\n\nLook, I’ve spent my fair share of time in Diablo 4’s dungeons and Path of Exile’s labyrinths of currency systems. But Last Epoch? It’s the game that stole my heart like a rogue with a silver tongue and god-tier crit chance.\n\nWith Tombs of the Erased (Season 2) coming in hot, Last Epoch is doubling down. The new zones are drenched in eerie beauty—fog, crypts, and atmospheric lighting that looks like it was blessed by Hades himself. It doesn’t just look good; it feels hauntingly alive.\n\nThe visual design is cinematic in the most unpretentious way. It doesn't shout, \"look at me!\"—it whispers, “stay a while… lose sleep.” And buddy, I did.\n\nNow, let’s talk Paladin. My Sentinel didn’t just put on armor—he became divine wrath incarnate. Every hammer smash is like a sermon in steel.\n\nI don’t play the Paladin, I become the Paladin. Aura of Judgment lights up the screen like the northern lights in a thunderstorm. You don’t fight enemies—you redeem them… into ash.\n\nThere’s something holy and unhinged about channeling godly power in a system this refined. It’s not just another tanky melee—it’s a cathedral with legs. And those legs are kicking straight through corrupted souls.\n\nAnd oh man, the way gear supports your fantasy? Chef’s kiss. I’m out here crafting swords with six blessings and a dream.\n\nWhich brings me to the crafting system—it’s actually fun. It respects your time, your intelligence, and your desire to make stuff that matters. It’s like IKEA, but if you were building divine judgment instead of bookshelves.\n\nCompare that to Diablo 4’s bland roll-the-dice upgrades. Or PoE’s “what does this fossil do again?” roulette wheel. Last Epoch knows what you want: control, clarity, and chaos in equal measure.\n\nWant to try a new build? Go nuts. Respeccing is easy, so you’re never punished for curiosity—PoE2 could never.\n\nAnd yeah, let’s talk offline mode. Sometimes I want to unplug from the world but still sling hammers through time. Last Epoch gets that, while Diablo 4 is still tying your gameplay to server status and weather patterns in Ohio.\n\nThis game doesn’t just let you play—it invites you to. Whether you’ve got five minutes or five hours, there’s always something meaningful to do. And that, my friends, is a modern miracle.\n\nThe time-travel setting? Criminally underrated. You’re not just clearing monsters—you’re rewriting history, one legendary drop at a time.\n\nEach era has a vibe, a soul, and enemies that look like they crawled out of a prog metal album cover. I’ve seen beetles made of bone and fire that would make H.R. Giger weep. And yes, I clicked on every one of them.\n\nThe devs at Eleventh Hour Games have managed something special. They didn’t just make an ARPG—they made the ARPG. If ARPGs were pizza, Last Epoch would be that corner slice with just the right amount of crispy cheese.\n\nLet’s not forget about the monolith system—randomized, layered, and dripping with loot. Every choice you make echoes through time and reward. It’s a roguelite nested inside an ARPG wrapped in a love letter to the genre.\n\nEvery time I log in, I find a new interaction I didn’t notice before. An affix here, a synergistic node there—it’s like discovering a secret level inside your own brain. And suddenly, my Paladin isn’t just good—he’s divine and stylish.\n\nThe combat? Smooth like jazz, but deadly like a lightning storm in plate armor. Responsiveness like this should be illegal in half-finished AAA games.\n\nDiablo 4 may have the budget, but Last Epoch has the soul. PoE2 may have depth, but Last Epoch has design that respects you from hour 1. You’re not playing a spreadsheet—you’re playing a masterpiece with a damage multiplier.\n\nJudd Cobler—sir, madman, genius—thank you. You and your team have created something timeless, pun fully intended. You gave us a game that lets us wield gods, time, and flaming swords on a Tuesday night like it’s nothing.\n\nSo yeah, I stayed up all night. I don’t regret it. In fact, I might do it again tonight—because Last Epoch is the best thing to happen to ARPGs since the mouse.\n\nThank you kindly,\n\n-ruthless", 0.8433258533477783], ["Amazing game. After playing PoE 2 it feels refreshing and fun. Monsters drop loot and you can experiment with many different skills during campaing. Love the WASD controls.", 0.7631811499595642], ["If you want to actually live out your ARPG power fantasy, instead of fantasizing that PoE2 will one day give you any power, come play this game. You won't be disappointed.", 0.7511415481567383], ["Last Epoch showed great promise from the moment it came out in Early Access and now it has finally hit its stride with the Season 2 \"Tombs of the Erased\" patch. Today it is an amazing game, easy to get into, with endless content to explore and so many side activities crammed into each and every map you visit that it stays and feels fresh for a long, long time. I highly recommend it, and I cannot wait to see the extra content that future seasons and patches will add to it.", 0.6325166821479797], ["Season 2 is incredibly good. They've finally addressed almost all of the gripes I've had with the game.\nEndgame is way more varied, there's a ton of new ways to get cool loot, sets are no longer useless and combat is as fun as it ever was.\nIf you like ARPGs and are looking for something familiar and extremely polished - this is probably one of the best options on the market. They've practically perfected the classic ARPG formula with this patch.\nVery excited for future updates!", 0.6178043484687805], ["Wish there was a meh option instead of yes or no.\nOver all I'd unironically say 6.9/10.\nIf you enjoy Diablo 3/4, or PoE1 this game will be more up your alley than PoE2 or Grim Dawn.\nGlad theres good ARPG competition in this space. It was dull for a while. This game is probably going to be great for most ARPG fans, but for me it just doesn't cut it. Gameplay just falls flat at the end of the day.\nThere's a lot going for this game, but I'd rather just play PoE1 if I want the blasting / nothing is threatning till high endgame.\nAll my cons are things that can be fixed, but even if they were all fixed I still just don't think this game feels that good over all. I prefer the heavy hitting / weighted attacks of PoE2/Grim Dawn.\n\nPros:\nGreat crafting system.\nFeels very responsive. Click button, Action Happen. This is nice, but it does make a lot of skills feel somewhat similar at the end the day.\nUI is clean and pretty easy to get around. I like how it tells you what you will lose and gain from switching items. Also nice scaling options in the settings. It also tells you how you died. Very underrated feature.\nHas offline mode.\nCrafting materials don't take up storage space.\nCan buy extra storage space for in game gold.\nImplicit movement speed on boots. \nCan respec just about everything just for gold.\n\nCons:\nZERO feel of threat during the campaign. Campaign is so boring. You just end up using a traveling skill to get to the next exit. Skip monsters because they're no threat and you're fast as fuck boy. Too much random teleporting through rifts. The in game \"cut scenes\" and cinematics are absolutely terrible. Don't want to go through this again and again.\nNot enough weight to attacks. Feels like you're throwing pebbles / slapping things most the time and enemies don't really feel it.\nPhysics are way too floaty. This makes it feel cartoonish.\nMight as well use Mouse1 to move. Can't have interact/attack on Mouse1 when using WASD. Wish interact / move were seperated in this case. Makes WASD not feel as good as it could.\nNo pausing when in online mode. :(\nTravel moves run you into walls without smart tracking like in PoE2.\nNo big cursor option. I lose my cursor A LOT with all the stuff going on in game. Maybe this has to do with being on ultrawide, but it's pretty bad.\n\nMeh:\nEndgame is meh. I don't think anything needs to be done here but I just didn't enjoy it.\nWASD is a nice addition but ultimately you should stick to the classic controls.\nNeeds to be better sounds for when loot drops. You can hardly hear the noise it makes. All loot drops kind of feel the same because of this.\nZone entrances/exits have a huge radius that you can't walk in. Just think this feels bad in most places. Should be able to walk closer to the door you're entering.\nCan't use skins in offline mode.\nThe enemies you fight make too much noise. They're always grunting or screaming.", 0.6159926056861877], ["As a fan of ARPGs, I was excited to try this based on the reviews and recommendations. The build customization is awesome and I like the emphasis on crafting. However, I just couldn't get into the game as it never felt like there was any threat of dying or being skill-checked with my build. I just felt too overpowered and was bored with the gameplay and story. The game failed to hook me at six and half hours, which should be ample time to get into most games. I'm fine with the loss of $30 because I'm happy to support the devs, but this just isn't the game for me.", 0.6153276562690735], ["Currently the greatest challenge in the game is trying not to fall asleep.\n\nAt its core, an ARPG should present the player with challenges and long term goals, and offer ways of tackling them through itemization. Dying too often? Fix your defenses. Killing stuff too slow? Get gear upgrades. Having mana issues? Fix your sustain. Last Epoch fundamentally doesn't get this, since it never challenges the player in any meaningful way, until its too late. The player is a god from lvl 1, well into the end-game (yes, even in empowered monoliths) - you never feel the need for upgrades, because you're always ahead of the curve. As a result, long term goals feel hollow since your power fantasy is already achieved.\n\nPeople will tell you to push even higher corruption if you want some challenge, but by that point your build is essentially done, since all there's left to do is grind for the same gear with slightly bigger affixes. The game being braindead up until that point is a failure in design and removes any sense of progression.\n\nWhen you add the very monotonous content of monoliths (blast screens for 2 minutes, rinse and repeat), the paper thin end-game systems, forgettable mobs and the generally dated gameplay (combat lacks feedback and feels floaty), what begins as fun or engaging soon turns into something dull and predictable.\n\nIf you want to switch your brain off and blast screens while watching something on your 2nd monitor, this game will be perfect for you. This review is not meant for you, but for the player that expects something more similar in progression and pacing to Grim Dawn, Diablo 2 or Path of Exile 2, instead of Diablo 3 or Diablo 4.", 0.59981369972229], ["Played this game since Early Access, on every major patch.\nThis review is relevant to  Season 2 Tombs of the Erased.\n\nGame is too easy. Whats worse, it takes too long to get to content that can challenge you and your build, so you can't even refine it as you progress. By the time I got to corrupted Monoliths, I was already bored to tears. When I found out that I would have to grind some more to scale them up to any challenging difficulty, I was done with it.\nThis is an issue for me.\n\nIf you like an ARPG that is fun for 15-30 hours and is easy to pick up. Last Epoch is fine.\n\nPS: This difficulty feels perfect for a Vampire Survivors like game, makes me wish Last Epoch was that instead of your usual ARPG.", 0.5870053768157959], ["I love everything about the gameplay of this game.\nIt's deep, engaging, and a fantastic replacement if Path of Exile 2 has bummed you out as much as it did for me. In fact, it's deep enough that it seems capable of holding your attention for many weeks to come, or even years if the fans are to be believed. \n\nBUT... and this is a big one:\nI just cannot excuse the absurd amount of DLC and cosmetics this game constantly shoves in your face while trying to play. I understand supporter packs, I understand the need to make a little extra money to sustain yourself on the long-term, but the frequency of these advertisements has no place in a €40 release. \n[list]\n[*] You get frequent pop-ups in chat about cosmetics.\n[*] There's a “Cosmetic Shop” icon permanently on your mana bar.\n[*] A bright purple “SHOP” option appears when you hit Escape and want to tweak a setting or quit the game.\n[*] There's even a dedicated NPC in every town who serves no other purpose then to automatically open the Cosmetic Store for you. He also has a bright icon above his head that makes him seem important. Is it a quest? A reward? Nope, just a glorified store button to remind you to spend some real cash.\n[/list]\nAre you forced to get it? No, but I'm not spending 40 bucks to be advertised on whenever I want to play.\n\nIt's awful and until they tone it down or decide to go free to play where these type of practices are more warranted, this review isn't changing, no matter how good the game itself is.", 0.5860536694526672], ["Game is only fun for a very brief period of time. Campaign is boring, maps are boring, gameplay is boring and the only fun is the initial gearing process upon reaching endgame when you are replacing and crafting new gear. That only lasts a few hours after that you do same boring maps over and over. In similar games this process is somewhat exciting but LE still hasnt figured out how to make it engaging, its just a monotonous boring grind.", 0.5843566656112671], ["I suddenly care much less about what a disappointing game PoE 2 ended up being.", 0.5744502544403076], ["If you give the unique art style a chance, you’ll find probably the best ARPG on the market in Last Epoch \nPros:\n+ Best crafting in the genre (maybe of any RPG period), collecting affixes as crafting material, combined with special runes allow a greater control on the item being crafted. No slot machine mechanics, the RNG gods smile upon  us. \n\n+ Amazing build options, with a more approachable learning curve than its real competitor in this regard: POE2. 5 classes with three unique evolutions each for a combined total of 15 to choose from, and now you can respec these mastery classes, encouraging experimentation at an increasing cost. \n\n+ Best Solo-Self Found experience in an ARPG, because of unique mechanics that help target farm desired items, alongside the crafting system. Unlike in POE2 where endgame is very much dependent on trade. \n\n+ Great endgame, I haven’t reached season 2’s just yet, but with the new additions to what I’ve already played at launch and in season 1, I’m sure it’ll be a blast. \n\n+ Best loot filter in genre as well, and much easier to import than PoE2 or if you’d rather make your own it’s relatively simple. \n\n+ Can be played offline, both logged in and completely disconnected. Great for steam deck users who want an offline character to play anywhere in the world. \n\n+Indy devs, not only do you get to congratulate yourself for helping out the small guy. But you get devs who actively play the game and will even conversate with the general chat. \n\n• Art style is more bright and vibrant than PoE2, or Diablo 4. The setting takes place across multiple time periods so environments include lush green prehistoric jungles with bright red flowers, to barely intact landscapes with devastated ruins standing in purple and pinkish haze. \n\n• Campaign is decent but forgettable, don’t expect blizzards level of shine here, this is a neutral point for me because beyond Diablo 4 I don’t really care about story. \n\n- Graphics are inferior to modern standards, but if you can get past that you’ll find they are still spectacular if maybe looking dated. With that being said this game runs better on my aging system than PoE2, and maybe Diablo 4. \n\n- lacks the polish of Diablo 4 or PoE2, although I must say this seems to be improving every time I hop back on. \n", 0.5719603896141052], ["I feel nothing playing LE. It's just really boring...the bosses are terrible, the gameplay feels like there's no weight to it, the progression is so braindead easy...\n\nThe game does have some really good system, but when the core gameplay and progression is this mind numbing it's hard to keep playing.", 0.5695722103118896], ["Last Epoch is easily my favorite of the recent wave of action RPG's. I was very skeptical at first, but the class balance and variety is truly hard to beat. I personally enjoy the story, but if it isn't your thing you can blast through it pretty easily to get to a remarkable endgame system. The in game guide is so good that it's how I taught myself the game. Mousing over anything explains it to you concisely. There's such a vibrant gear crafting system that I could honestly play this game for years as is. After almost 700 hours, it still feels refreshing to roll a new character, and the dev team has implemented countless suggestions directly from player feedback into the game. Not everything is perfect, but we know they're working on it and building on steam for future seasons to be more frequent than almost 9 months for the latest one tomorrow! \r\n\r\nThe next patch looks to build on this consistent behavior, and changes are thoroughly explained in their patch notes and also have video content for people who don't want to read countless patch notes. I was really encouraged to see their recent wave of promotion with content creators in their community. It's been far too long since a game hasn't let me down, at all. And I think there's a character for everyone interested in grindy games like this.", 0.5665092468261719], ["Simply a fantastic game. In my opinion the best ARPG you can buy today.", 0.5659662485122681], ["So, Last Epoch..Imagine if Diablo and Path of Exile had a time-traveling baby who was really into theorycrafting and loot explosions. That’s this game. You start off thinking, “Cool, I’ll just try one class.” Next thing you know, it's 3 AM, you're knee-deep in passive trees, and you've somehow created a lightning werebear with a vendetta. Don’t ask how. Just go with it. \n\nThe skill system is basically a playground for mad scientists. Every ability has its own upgrade tree, so your fireball can turn into a meteor, a flamethrower, or something that accidentally erases time itself (probably). And yes, necromancers can summon an army of skeletons big enough to block traffic.\n\nThe story? It involves time travel, ancient gods, apocalyptic horrors—typical Monday stuff. But it’s surprisingly engaging, and the environments across different eras look great (and occasionally terrifying).\n\nThe devs are clearly passionate, constantly updating the game and chatting with the community like that one overly enthusiastic dungeon master who really wants you to have a good time.\n\nFinal verdict?\nIf you like loot, deep builds, and yelling \"WHAT YEAR IS IT?\" while fighting a void dragon, Last Epoch is your jam.\n9/10, would time-travel again.", 0.5659526586532593], ["After 8k hours in POE1, and watching it die for the horrible and slow POE2, decided to try this and man, it was a pleasant surprise!\r\nHaving a lot of fun during the campaign, crafting my items without following any guide and im having no issues with damage and survivability so far. Tried the same on POE1 when i started it, it was a disaster. Now hyped for next content in April.", 0.6149390935897827], ["The game I wanted PoE 2 to be. I play and enjoy both, but Last Epoch is more focused on having a fun experience for us players.", 0.5632582306861877]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/899770/bf7bf6df7fea6b22c6ea451d5af5aacf3a7cadfa/header.jpg?t=1744905836", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/899770/e3b5062431e10c3c497d642d754ee2b4752b414f/capsule_231x87.jpg?t=1744905836", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/899770/e3b5062431e10c3c497d642d754ee2b4752b414f/capsule_184x69.jpg?t=1744905836"}, "support": {"support_website": null, "support_email": null, "game_website": "https://lastepoch.com/"}, "developer": "Eleventh Hour Games", "owners": "20,000,000 .. 50,000,000", "tags": ["Action RPG", "Loot", "Hack and Slash", "RPG", "Isometric", "Multiplayer", "Action", "Co-op", "Adventure", "Top-Down", "Dungeon Crawler", "Indie", "Singleplayer", "Fantasy", "Gore", "MMORPG", "Character Customization", "Magic", "Violent", "Early Access"], "languages": ["English", " French", " German", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Spain", " Japanese"], "concurrent_plays": 91322, "number_of_achievements": null, "categories": ["Single-player", "Multi-player", "Co-op", "Online Co-op", "In-App Purchases", "Partial Controller Support", "Steam Cloud"], "genres": ["Action", "Adventure", "Indie", "RPG"], "short_description": "Uncover the Past, Reforge the Future. Ascend into one of 15 mastery classes and explore dangerous dungeons, hunt epic loot, craft legendary weapons, and wield the power of over a hundred transformative skill trees. Last Epoch is being developed by a team of passionate Action RPG enthusiasts.", "long_description": null}