{"name": "Grand Theft Auto IV: Complete Edition", "app_id": "901583", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 48609, "negative_reviews": 11938, "reviews": [["Same feelings now, same feelings back then. You come to this every now and then and it's still feel fresh. Infinite replayability. This game doesn't get old!", 0.781772792339325], ["Great game that I cannot recommend anyone buy on PC because it is IMPOSSIBLE to finish without mods. I made it to the final mission and one of the last actions you take is tied to your FPS. It's genuinely impossible above about 30 FPS and there is no way to cap FPS in the game. It's genuinely a scam to have a game available for sale that is so obviously broken AT THE LAST MOMENTS OF THE GAME. I've invested 60 hours and can't get the actual ending. Insane that Steam allows the game to be sold in this state.", 0.7358458638191223], ["[h1]🔥100 Hours. 100% Completion. Every Achievement Unlocked [/h1]\r\n\r\nAfter spending a full 100 hours in GTA IV and completing every single mission, side quest, activity, and achievement (both Steam and Rockstar) — I can confidently say GTA IV is an absolute crazy.\r\n\r\nFinished everything. No regrets!\r\n\r\n[b] This game is still worth your time in 2025! [/b]\r\n\r\n", 0.6597875356674194], ["this game was so much better before they added the rockstar game launcher, its almost unplayable. I understand its on a player to player basis and does not adhere to everyone who buys and plays the game but rockstar likes to make things extremely complicated when it should be as simple as you bought the game so go play it. Instead they want you to go through extra hoops and hurdles. I dont have access to my old social club acc from YEARS ago yet they insist I link the steam acc regardless. FYI my email account was disabled due to inactivity of me not being able to sign in. So, why am i typing all of this? I asked rockstar for help and im waiting for a response. Gaming used to be simple, it meant something. Now, its a status icon, forget having fun when you can support mega triple a gaming companies to help them make more money and piss on the lower class of gamers, when it should be inclusive. Gaming is for everybody, just buy the game disc on a game console and forget this whole process please...", 0.6271186470985413], ["I unfortunately never grew up playing GTA 4, I always used to play GTA 5 a shit ton but sadly never got around to playing GTA 4 until late last year on PS3 and now again this year on PC. While I'll always have a soft spot for GTA 5 I can understand why so many fans love this game more despite it's flaws, it's such a charming yet dark game in the series.\n\nSadly the port for PC is dogshit, as much as Rockstar are incredible game developers they absolutely suck when it comes to porting/fixing their games for some weird reason. Luckily the best way to fix it is by using GranAlan-84's 'Grand Theft Auto IV: CE - The Improved Classic' mod that helps fix the bugs and glitches within the game and restore missing content like the songs that were cut due to expired music licenses. Other than this issue this is a game worth playing even if it's only once just to experience the story, it's worth every minute of your time :D\n\nEdit: Also I think it's worth mentioning a fix I found for the \"Taxi bug\" and/or the bug where every car that spawns is similar to the one your driving, I've seen people on here asking around on how to fix it so I thought I'd include it in my review. After you install the Improved Classic mod by GranAlan-84 (which includes the fusion fix that you'll need for this bug fix) if you go and open the INI of fusion fix, then find the line:\n\n[BudgetedIV]\nVehicleBudget =\n\nAnd enter a number value in there, I went and used 120000000 which most people seem fine with (although if you can you could also change it to 144000000 but I haven't tested it myself so I just recommend inputting 120000000 just incase) and then boom it should be fixed. I haven't experienced any issues thankfully but I have heard that your game could start to crash when you're on the bridge with a lot of cars (although this could probably be countered by reducing the amount of cars spawning in the in-game settings) or when you try to enter the mission \"snow storm\" from Elizabetha so I recommend proceeding with caution, if you can't progress the game any further at some point around this time then maybe trying putting the number value back to 0 and see if it fixes. I hope this helps :)", 0.5833333134651184], ["I beat GTA4 on Xbox 360 but I never got around to playing the highly acclaimed DLC. When I seen the entire package on sale I had no choice but to buy it. Even at full price the amount of content you get is well worth the price of admission and well.... It's Grand Theft Auto & Rockstar, this game is goated. GTA 4 still holds up and does many things better than GTA 5. I haven't played Gay Tony yet but lost & the damned is fantastic. It's basically sons of anarchy in GTA. The way they are connecting the lost and the damned to the regular game is absolutely brilliant. I am not going to spoil anything but this game is fantastic. If you have been living under a rock for the last 20 years and have never played GTA 4 do yourself a favor and buy this masterpiece.", 0.5625573396682739], ["Pc port is so bad I can't even play the game, it's a great game but the port ain't porting", 0.5470232963562012], ["Even after the years the open world and story are in a league of its own.", 0.5240761637687683], ["Still holds its soundtrack and best story telling. I bet rockstar won't do game like this anymore", 0.523809552192688], ["still a fun game, but you can't beat it. there is a glitch making the last mission unbeatable, which almost made me give it a thumbs down.", 0.523809552192688], ["Will be remembered as one of the worst ports in history, even with all the mods in the world it's still only just barely playable, truly pathetic on Rockstar's part.", 0.5229284763336182], ["Amazing game, but a terrible port. Definitely get FusionFix if you plan on playing this.", 0.52173912525177], ["I'd only recommend you to play this great game's horrendous PC port with mods that (Thankfully) fix the port to what it should've been in the first place. \nInstallation process is not difficult and you don't need to downgrade, guides/tutorials exist on Youtube n' such.\nOther than that this is one of the best GTA games on this franchise and in my view better than GTA5 Story-wise (Since GTA4 Online is mostly unplayable/dead).\nHowever as previously mentioned this is an awful port to pc with a lot of small details missing from the console versions and bugs here and there occasionally, And while the game is mostly playable it shows its most ugliest head in the final mission where you will suffer and have to resort to Lowering your FPS via Task manager (It is that bad).\n\n", 0.5199999809265137], ["I remember the first time I played Grand Theft Auto IV.\nIt was December 26th, 2008. I was fifteen, my soul hungry for stories, my heart still unaware of the weight nostalgia would one day carry.\nThat day, my father gave me a Christmas gift.\nA simple disc. A dark, heavy case for my old PlayStation 3.\nBut it wasn’t just a game.\nIt was the beginning of something.\nIt was GTA IV.\n\nI installed it, turned on the console, and it was as if the real world faded away.\nI spent every hour of that day lost in Liberty City.\nThe gray skies, the towering bridges, the radio songs that stitched themselves into my memory forever.\nI wasn’t playing it. I was living it.\n\nAnd then came so many new saves. So many different choices. Endless drives with no destination, just the city breathing around me.\nI knew every street, every shortcut, every secret alley.\nAnd without any guide—when the internet was still a slow, rare luxury—I saw every ending, discovered every hidden thing.\nIt was my world.\nIt was home.\n\nEvery now and then, my father would sit beside me.\nHe’d watch the screen in silence.\nHe came from an era of Contra, so to him, this was like seeing a movie you could control.\nI still remember that one time I handed him the controller and let him try to drive a car.\nHe crashed almost instantly. He laughed.\nHe wasn’t made for this world, but he liked being part of it.\nHe liked seeing me inside it.\nIt was my refuge.\nIt was our small bridge.\n\nAnd now, seventeen years later, I go back.\nThe world has changed. I have changed. I’m thirty-one now.\nAnd he... he’s no longer here.\n\nYet booting up GTA IV feels like opening a window into the past.\nThe graphics are older now, the framerate lower, but the heart remains untouched.\nEvery horn, every skyline, every exhausted voice on the radio speaks in a language only the soul can hear.\nIt’s the voice of youth.\nIt’s the whisper of my father laughing as the car swerved wildly into a lamppost.\n\nGTA IV isn’t just a game.\nIt’s a time machine.\nIt’s a second chance to touch, even for a moment, what we thought we had lost.\n\nAnd as the sun sets over Liberty City, I remain there.\nFingers on the keyboard...\nAnd a tear I cannot tell—whether it’s sorrow or gratitude.", 0.5185185670852661], ["good game. There is some issues where you have to turn your rendering down to hit 30fps to not freeze on loading screens.", 0.5027624368667603], ["Weird one because the story is interesting, for the first time there was a GTA game had a good protagonist and an actual story that feels written well with good themes and twists and turns in the narrative. \n\nHowever, in 2025 the game doesn't hold up too well, even more-so this PC port. It runs REALLY bad on my beefy rig and somehow actually preforms better on my Steam Deck? It also has all the fumblings of old video game design with poor physics from the first-gen version of the engine, it feels too sluggish and the camera is all over the place which is so annoying. I won't go on about the driving, bit it did screw me over more than once even after I felt I was quite good at it.\n\nAlso the missions are pretty much all the same, go here kill this... and there's no mid mission check points! So, when an enemy is bum-rushing you and you're frantically trying to get off the cover your character is glued to it's back to the start of that mission because they'll just unload a shotgun into you point blank.\n\nIt's just not a fun game to play, but I know it's a good one. I think I'm just used to GTA V which although as a naff story, is so much better than this.", 0.5], ["fine game! just an insanely bad port. i put 64 minutes into the game and 62 of it was just me trying to get the damn thing to load. rockstar support is no help, i was able to load it 2 times. once on a new save. once on an old one. the minute i got into a car, the game crashed. then i had to sit through constant cycles of rockstar's launcher not working, and the game not working through their launcher. if you want to play this game, this is not the way for you. fuck it. pirate it man. at least fitgirl will make the damn game load.", 0.5], ["game is so good that the last mission had a mini game on top of the mini game for pc players with multi cores.", 0.5], ["Absolutely wonderful!  Best game ever designed.\r\n\r\nRockstar Games, you have outdone yourself... for once", 0.5], ["Hands down, the best GTA game. The environment is gritty, yet it feels alive. The vibe is depressing, and so is the story-it's grounded and realistic. The Ballad of Gay Tony DLC is amazing, featuring some breathtaking missions. However, the game has its bugs-like needing to cap your FPS to 30 in order to finish the final mission.\n\nIn conclusion, it's an easy recommendation if you're okay with tweaking some settings to get it running properly.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/901583/header.jpg?t=1728427348", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/901583/capsule_231x87.jpg?t=1728427348", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/901583/capsule_184x69.jpg?t=1728427348"}, "support": {"support_website": null, "support_email": null, "game_website": "http://www.rockstargames.com/iv"}, "developer": "Rockstar North, Rockstar Toronto", "owners": "20,000,000 .. 50,000,000", "tags": ["Open World", "Action", "Automobile Sim", "Crime", "Multiplayer", "Third Person", "Adventure", "Singleplayer", "Third-Person Shooter", "Sandbox", "Moddable", "Shooter", "Physics", "Atmospheric", "Classic", "Funny", "Dark Humor", "Gore", "Satire", "Co-op"], "languages": ["English", " French", " German", " Italian", " Spanish - Spain"], "concurrent_plays": 0, "number_of_achievements": 55, "categories": ["Single-player", "Multi-player", "Partial Controller Support"], "genres": ["Action", "Adventure"], "short_description": "PLEASE NOTE: Microsoft no longer supports creating Games for Windows-LIVE accounts within Grand Theft Auto IV. You can create an account through and then log into your account in game. This standalone retail title spans three distinct stories, interwoven to create one of the most unique and engaging single-player experiences of this...", "long_description": null}