{"name": "Century: Age of Ashes", "app_id": 918570, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 2, "review_score": 6, "review_decription": "Mostly Positive", "positive_reviews": 598, "negative_reviews": 151, "reviews": [["By far the best dragon centered game currently out", 0.5394737124443054], ["I played the beta for this game way back when and had an absolute blast. I love every second of the gameplay, and I put a ton of time into it with a friend. Fast forward a few months, and I buy the biggest founder's pack to show my support for the official release, hoping to see the game go far. I was super excited to play again, but I had to wait a couple of weeks to play for reasons I don't remember.\n\nWhen I finally jumped back in with a friend, we got stomped. Every game was like fighting a mountain, players were moving like lightning bolts, and moving so fast and hitting so hard that we were usually dead before we even had time to react. Every player could move faster than us no matter what we did, every player could out-maneuver any of our attacks or evasions, and the game as a whole had already been so hyper-optimized by its players that any of the fun from the beta was gone. Skirmish regularly gets you put up against top 100 players, spoils of war is usually a slaughter for whichever team has fewer pro players, and the racing gamemode just feels impossible to play (but to be fair, I haven't played since long before the update to it).\n\nI kept trying to jump back on from time to time to keep fresh and get cool skins, but every time I played a game I just got obliterated no matter what. Even the PvE mode, which WAS fun, was incredibly repetitive and didn't really offer much outside of a few quick matches to break things up.\n\nAll in all, the gameplay itself is phenomenal. The flight controls are fast and responsive, the combat is simple and effective, and the dragon designs are some of the best I've seen in a game. But it's so tailored toward competitive players and ranked gamemodes that it's just not fun for casual players like myself. I probably haven't played in well over a year because every time I did, I shut off the game after a few matches because I felt miserable after getting my shit rocked for an hour.\n\nTL:DR; if you're willing to learn all the crazy competitive tricks and keep up with the pro players? Then this game is fantastic, and I definitely recommend it if you like flight games. But if you're just someone like me, who plays for fun when they remember to, then this game probably isn't a good choice. It is very unfriendly to new players, and unfortunately I don't think that'll change anytime soon.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/918570/header.jpg?t=1734037483", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/918570/b3132999b77e03f7409d8b2607ea79ab12cf8772/capsule_231x87.jpg?t=1734037483", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/918570/b3132999b77e03f7409d8b2607ea79ab12cf8772/capsule_184x69.jpg?t=1734037483"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.century-age-of-ashes.com/"}, "developer": "Playwing LTD", "owners": "2,000,000 .. 5,000,000", "tags": ["Free to Play", "Dragons", "Multiplayer", "Action", "Team-Based", "Flight", "PvP", "Indie", "Hero Shooter", "Third Person", "Fantasy", "Arena Shooter", "Shooter", "Online Co-Op", "Dark Fantasy", "Mythology", "Character Customization", "Third-Person Shooter", "Spectacle fighter", "Early Access"], "languages": ["English", " German", " Spanish - Spain", " Simplified Chinese", " Portuguese - Brazil", " Russian", " French", " Japanese"], "concurrent_plays": 89, "number_of_achievements": 33, "categories": ["Multi-player", "PvP", "Online PvP", "Co-op", "Online Co-op", "Cross-Platform Multiplayer", "Steam Achievements", "Full controller support", "In-App Purchases"], "genres": ["Action", "Indie", "Racing", "Free To Play"], "short_description": "Century: Age of Ashes is a free-to-play multiplayer dragon shooter. Master a growing roster of classes and dragons, compete in intense arena battles and rule the skies in fast-paced aerial combats.", "long_description": null}