{"name": "Among Us", "app_id": "945360", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "GBP", "original_price": "£3.99", "final_price": "£2.39", "discount_percent": 40, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 332693, "negative_reviews": 28029, "reviews": [["amoogus\r\n\r\nnot as fun as covid times, but still a decent game to play w friends. That's the key. Friends.", 0.7901379466056824], ["[b]Among Us came out of nowhere and quickly became one of the most iconic social deduction games of our time. It’s wild how such a simple concept, crewmates vs imposters, can create so much chaos, laughter, and betrayal all in one round. Whether you’re doing your tasks or trying to lie your way out of an emergency meeting, the tension and fun never let up.\n\nWhat really makes Among Us special is how social it is. Playing with friends turns every session into a mix of mystery and comedy, and even with strangers, there’s always that thrill of trying to figure out who’s lying. The maps, customization, and new roles added over time have kept the gameplay fresh, and the art style gives it a unique charm that’s both cute and slightly creepy at times.\n\nThat said, public lobbies can be a hit or miss, especially if players leave early or don’t communicate. It really shines best with a good group. Still, Among Us remains a game that proves you don’t need insane graphics or massive budgets to be memorable. It’s simple, addicting, and honestly one of the best party games out there. Just don’t be surprised if your friends start acting sus in real life too.[/b]", 0.6001938581466675], ["=== Graphics ===\n🔲 Realistic\n🔲 2000s flash game\n✅ Simple but iconic\n🔲 Can be run on a fridge screen\n🔲 SUS-sational art style\n🔲 Michelangelo could never\n\n(The power of a red bean in a space suit.)\n\n=== System Requirements ===\n🔲 Runs on a potato\n✅ Runs on a potato with a hat\n🔲 Runs on grandma’s phone\n🔲 Built for low-end everything\n🔲 Can run while you're being vented\n\n=== Story ===\n✅ None\n🔲 There’s lore if you dig\n🔲 You’re just kinda there\n🔲 One time someone made a movie out of it\n🔲 Deep narrative: red is sus\n\n(10/10 betrayal drama though.)\n\n=== Gameplay ===\n🔲 Click simulator\n🔲 Walk around and do stuff\n✅ Complete tasks or fake them\n✅ Gaslight your friends\n🔲 Social deduction meets cosmic chaos\n\n=== Complexity ===\n🔲 Anyone can play\n✅ Easy to learn, fun to master\n🔲 You either sus or get sus’d\n🔲 Mind games go wild in public lobbies\n🔲 You’re either Sherlock or the impostor with 3 IQ\n\n=== Difficulty ===\n🔲 Your dog could win\n✅ Depends on who you're playing with\n🔲 Lobbies full of detectives\n🔲 It’s not the tasks — it’s the lies\n🔲 Impossible to win when 3 people vote randomly\n\n=== Playtime ===\n🔲 A quick round\n🔲 One more game\n🔲 Four hours later…\n✅ You were supposed to sleep\n🔲 3AM lobby energy is unmatched\n\n=== Sound / Music ===\n🔲 Beep\n🔲 Suspense.mp3\n✅ That emergency meeting SFX lives rent-free\n🔲 Victory music = dopamine\n🔲 Betrayal never sounded so crisp\n\n=== Bugs ===\n🔲 None\n✅ Occasional glitchy beans\n🔲 Lobbies breaking since 2020\n🔲 Still more stable than your friendships after playing\n\n=== Audience ===\n✅ Everyone\n🔲 Only 9-year-olds\n✅ Streamers, memers, backstabbers\n🔲 Group chats that got too quiet\n🔲 Your therapist after hearing you lie so well\n\n=== Worth Buying? ===\n🔲 Only free on mobile\n✅ Absolutely, even on PC\n🔲 Free friendships not included\n🔲 You’ll pay in trust issues\n\n=== Final Score ===\n✅ 8.5/10\nAmong Us is the ultimate social test. It’s goofy, it’s addictive, and it taught us one universal truth: red is always sus.", 0.5833333134651184], ["solo playing this is just opening up the gate of brainrot hell, don't play unless you have friends to play with.", 0.5521566867828369], ["People who play it are bums and can't play the game right, full of teaming bastards who don't play the game and just vote off crewmates so their imposter friend can win. I feel like adding XP and money was a huge mistake because it'll encourage this kind of cheating in the game. The game is still really good with a group of friends though.", 0.5416666865348816], ["this game used to be okay and now there's a bunch more racists and homophobes in the game. i do report every one i see, it's just upsetting. this is still a kids game, also, the amount of 18+ lobbies i've seen for the purpose of e-dating or nsfw intent is insane. needs some work to it on these kinds of things but i suppose all we can do is report them.", 0.5408288240432739], ["Got locked out my account due to an age restriction in order to play. Emailed Innersloth to get a solution and its been 1 month. Inquired about a refund and was told this issue is being looked into. Will not purchase another Innersloth game moving forward.", 0.5362246036529541], ["Its fun , not much more than that , play with friends , the random lobbies kind off suck a bit it is fun to troll though :)", 0.5286884903907776], ["i can't speak for the multiplayer aspect of among us, but i've really enjoyed the single-player experience. the map is a little small though, and there's not that much to do but walk around and use the computer to change my colour but it's still a lot of fun.", 0.523809552192688], ["This game is enjoyable to play if you're trying to kill some time it's definitely one of those games you come back to when you wanna have some fun when it comes to mysteries", 0.523809552192688], ["Truly a wonderful game. It becons me to be \"sussy\" and a \"silly baka\", great costumes, great gameplay, only thing it's missing is maybe one or two beers to drink.", 0.523809552192688], ["Great game to play with friends, and fun to play alone. I like the feeling of dread you get when you are alone in a room with one person who you KNOW is the impostor. Overall great game, 9/10 would play again", 0.5136697888374329], ["if you ever wondered what it would be like for a bunch of strangers to vote each other out purely based on irrational feelings, but have the best time, try this.", 0.5092024803161621], ["this game is alot like tiktok, stupid, done over a million times before and better done, yet it persists like flies on poop, I want it to die.", 0.5], ["Fun to play with family/friends. At least while they still ARE family and friends. If you're too good at it, they might disown you though.", 0.5], ["Very fun and goofy game, still really good, even after 4 years. Although public lobbies are very strange, it's still a laugh.", 0.5], ["Rise of the Tomb Raider is a glorious call back to a gaming classic. Lara Croft is one of my favorite action heroes and thoroughly deserves this excellent installment to the already legendary franchise. p.s. Madagascar 3 is a fire movie! 10/10", 0.5], ["This game is so much fun for as simple as it is. This game might actually be able to run decently on a potato from what I've seen. Downloaded this to have some fun while on vacation with my ten year old laptop that had rather underwhelming specs when it was new and it runs well over 80fps in 4k on it. Gameplay is simple, but engaging. Would recommend this game to anyone just looking for some fun without making things complicated!", 0.5], ["I am super late but thought I'd leave an honest review. What a simple yet fun idea for a game, me and 5 or 6 of my friends play this game every night that we can, and it is the most fun I have all day. Even playing on the skeld 1000 times we still find new strategies and kills as crewmates and imposters. The use of roles makes the game much better, because it helps to relieve the boredom of being crewmate over and over. 10/10 game when played with friends.", 0.5], ["It is a fun little game with very simple rules and short play sessions.", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/945360/header.jpg?t=1731953093", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/945360/capsule_231x87.jpg?t=1731953093", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/945360/capsule_184x69.jpg?t=1731953093"}, "support": {"support_website": null, "support_email": null, "game_website": "http://innersloth.com/gameAmongUs.php"}, "developer": "Innersloth", "owners": "20,000,000 .. 50,000,000", "tags": ["Multiplayer", "Social Deduction", "Online Co-Op", "Space", "Survival", "2D", "Funny", "Psychological", "Party Game", "Co-op", "Cartoony", "Local Multiplayer", "Casual", "Action", "PvP", "Sci-fi", "Top-Down", "Colorful", "Minigames", "Aliens"], "languages": ["English", " Portuguese - Brazil", " Spanish - Latin America", " Spanish - Spain", " Korean", " Russian", " French", " Italian", " German", " Dutch", " Japanese", " Portuguese - Portugal", " Simplified Chinese", " Traditional Chinese"], "concurrent_plays": 4853, "number_of_achievements": 33, "categories": ["Multi-player", "PvP", "Online PvP", "LAN PvP", "Co-op", "Online Co-op", "LAN Co-op", "Cross-Platform Multiplayer", "Full controller support", "Remote Play on Phone", "Remote Play on Tablet", "Family Sharing"], "genres": ["Casual"], "short_description": "An online and local party game of teamwork and betrayal for 4-15 players...in space!", "long_description": null}