{"name": "Granny", "app_id": 962400, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "Unavailable"}, "price": {"currency": "GBP", "original_price": "", "final_price": "£3.99", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 2193, "negative_reviews": 161, "reviews": [["This game is pretty fun although i got bored of it, i will get granny 2 and 3, but in my opinion they should make this game free because on mobile it is free which doesn't seem fair.", 0.7570850253105164], ["There are many differences between this and the mobile version.\r\nHere are the ones worth noting:\r\n-This version can be modded\r\n-This version has better quality with the shaders and stuff, but the textures aren't that much improved\r\n-Much easier controls\r\n\r\nI would recommend this game only if you know you will play it a lot or if you are a fan of the game (also I highly recommend getting mods for this game because the vanilla PC version isn't really that good).\r\nIf you won't be playing it that much then just play the mobile version or an emulated version for PC (you can do that on an emulator like Bluestacks).\r\n\r\nOverall, I give the vanilla non-modded version of PC Granny a 7.5/10 (or 8.5/10 if you consider the fact that it can be modded).", 0.5683453679084778], ["great great underrated horror game. i hope the dev could come back to the game! sensational.", 0.54356849193573], ["Honestly I quite like this game, it might not have amazing graphics but I find myself coming back every now and then to play because I enjoy the game play.", 0.5], ["This version of Granny feels more creepier than the mobile one and i really enjoy everything about it", 0.5], ["yes, yes and yes\n\n\n\nAmazing game to play in free time where you just want something fun to do. Speedrun? Sure! Different difficulties including practice? Yup. Just make sure to have at least 30 minutes to spare (unless you're a speedrunner) before playing this.", 0.5], ["I like this game but there are glitches. the main one is me getting softlocked in the elevator and the time for granny after you shoot her", 0.5], ["Me: Pretty Fun and I Love the Concept.\r\nAlso Me: Can't Get Past The Spawn Room -insert large skull emoji-\r\n\r\nGOOD GAME IN GENERAL", 0.5], ["Great game! Have been playing for years on phone. It's even better on PC.", 0.5], ["too scary and my family member almost shat his pants, 10/10", 0.5], ["granny knocks me tf out every day, based on real life experiences", 0.5], ["The game is amazing im just having problems with the dark mode i just cant turn it off", 0.5], ["i really think that this is a fun game definitely for players who like horror and like to have fun", 0.5], ["very fun and creative", 0.5], ["Probably one of my favorite games of all time, everything about is just special to me.", 0.5], ["This game is so re-playable for no reason...", 0.523809552192688], ["I want this game with a controller\nTo play with a controller", 0.4000000059604645], ["great horror game", 0.5], ["I am stuck in dark mode but overall good game", 0.5], ["OFC MAN, best game ever trust me :D", 0.5]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/962400/header.jpg?t=1687541775", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/962400/capsule_231x87.jpg?t=1687541775", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/962400/capsule_184x69.jpg?t=1687541775"}, "support": {"support_website": null, "support_email": null, "game_website": null}, "developer": "DVloper", "owners": "200,000 .. 500,000", "tags": ["Horror", "Survival Horror", "Multiplayer", "First-Person", "Singleplayer", "Puzzle", "Adventure", "Indie", "Violent", "VR", "Difficult", "Gore", "Survival", "Dark", "Strategy", "Escape Room", "Action", "Psychological Horror", "Funny", "Atmospheric"], "languages": ["English"], "concurrent_plays": 122, "number_of_achievements": null, "categories": ["Single-player", "Family Sharing"], "genres": ["Adventure", "Indie"], "short_description": "You have to escape Granny`s house...You have five days...", "long_description": null}