{"name": "ホグワーツ・レガシー", "app_id": "990080", "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": "JPY", "original_price": "", "final_price": "¥ 8,778", "discount_percent": 0, "is_free": false}, "reviews": {"num_of_reviews": 20, "review_score": 8, "review_decription": "Very Positive", "positive_reviews": 115536, "negative_reviews": 10308, "reviews": [["Open World 3rd Person Adventure Action RPG.\n+ beautiful graphics\n+ Hogwarts itself looks and feels amazing\n+ first 10 to 15 hours when everything is fresh and new\n\n- boring story line and quests (main and side), only 1 side quest (Sebastian) was interesting and should have become the focus of the game as that side questline felt like the Harry Potter movies (1 to 3)\n- too much repetition (quest and fights)\n- world is too empty, to much focus to expand and bloat that world. They should have focused only on Hogwarts, Hogsmead and the Forbidden Forest\n- you find every 5 minutes new clothes, they feel not rewards\n- NPC have stiff faces no emotions\n- No Quidditch games are in the game to participate in.\n- No real school class mechanic like in the Bully game to balance attending classes and learning spells and balance it out to find out a typical Hogwarts school year mystery\nI can only recommend this game at a deep sale. The first 10 to 15 hours are amazing and than it becomes a typical ubisoft like empty world collection task.", 0.6960258483886719], ["Exploration, graphics and collectibles are high quality. Sadly the main story has very poor pacing and very little is explained, it's looping around the trials while repeating the same lines over and over about how this situation is bad indeed. Some of the side questlines are better than the main one to be honest.", 0.6414009928703308], ["Not a Harry Potter fan – still loved it!\n\nI went into Hogwarts Legacy with zero attachment to the Harry Potter universe. Never read the books, barely watched the movies. That said, I was genuinely surprised by how much I enjoyed this game.\n\nThe story was decent—not groundbreaking, but solid enough to keep me engaged. What really hooked me, though, was the gameplay and the world itself. The spellcasting feels great, combat is fluid, and the sheer amount of things to explore and interact with made it hard to put down. Hogwarts is packed with detail and secrets, and I found myself constantly distracted (in the best way) just roaming around.\n\nEven without the nostalgia factor, this game stands strong. If you're into action RPGs with a rich, interactive world, definitely give it a shot.\n\n9/10 – Would recommend, even to fellow Muggles.", 0.6319608688354492], ["Review after finishing the main story.  TLDR, the story's good and the atmosphere is great.  I found the game itself tedious.  If you are a Potterhead and are looking for a good story, this has that.\r\n\r\nMy main gripe with the game is that it feels like at some point this was intended to be an MMO.  And then later on, they decided they were not going to be able to do that so made it single player instead.  There's side quests everywhere and tons of world to explore if you are into that.  There is also a huge 'checklist' style approach to things to do in the overworld.  There's a big emphasis on cosmetic items as well.  For many people, these things are a draw but for me it just makes me tired.  I didn't find much actual good reason to go out of my way to explore as all of the 'impressive' things you can find are level adjusted gear that you'll replace in a few minutes.\r\n\r\nThey did try to gate some things behind exploring.  I really wasn't into this either.  The worst example I can find is that your inventory slot count is tied to how many optional Merlin trials you seek out and complete in the overworld.  Having limited inventory slots means that you have to stop what you are doing and arrange your inventory right in the middle of doing something more fun.  Capping that and hiding the larger caps under optional things to seek out and find is certainly a choice that they made in this game; and I'm not here for that.\r\n\r\nThe story is pretty good though.  The setting is prior to all of the other Wizarding World stuff I am aware of in the 1800's.  You are starting the game as a new student at Hogwarts starting in their 5th year.  They did find in-game justification for the world exploration checklist and map system, which I thought was cute.  Hogwarts and the surrounding area are really well done too.  I actually did get lost in Hogwarts a few times.\r\n\r\nCombat is a bit like the Batman Arkham games, but you are approaching it as a wand-weilding wizard.  You'll get dodge/parry prompts around your head, there's stealthy spots, you can see through walls, and sometimes you'll need to match the right spell to the right enemy action.  I felt like it was more than a bit easy though.  The main story has a pretty high amount of combat to go through.\r\n\r\nSo in conclusion, there's a lot for a person who is really into Harry Potter.  Its getting a no from me.", 0.6045518517494202], ["your choices don't actually affect the outcome, and the game keeps crashing every time i try to use ancient magic on a boss.", 0.583783745765686], ["Hogwarts Legacy is a visually stunning game that fully captures the magic and atmosphere of its setting. Exploring Hogwarts and its surrounding areas is an absolute joy, with incredible attention to detail that really brings the world to life.\r\n\r\nHowever, while the world design is top-tier, the storytelling falls a bit flat. The story is just straight up boring, lacking the emotional depth or memorable characters that could have elevated the experience. The dialogue is particularly weak—often sounding stiff and robotic, which further disconnects players from the narrative.\r\n\r\nGameplay is solid, with fun spell combat, exploration, and customization options that allow you to feel like your own witch or wizard. The various side activities and secrets scattered throughout the world help make up for the story's shortcomings.\r\n\r\nDespite its narrative flaws, Hogwarts Legacy delivers an immersive and beautiful experience for fans of the Harry Potter universe.\r\nRating: 6.1/10", 0.5652173757553101], ["cannot for the life of me get past the seizure warning screen, game keeps crashing after launch. was so pumped to play it after finishing the download, but the hype died in a matter of 30 minutes. reinstalled, disabled firewall, added exception to windows security, checked video drivers, deleted certain folders reddit told me to try, nothing works. very unfortunate", 0.5608108043670654], ["Absolutely Amazing Game! Thank You to EVERYONE that had a hand in making it!\r\n\r\nThe Detail is Perfect, The Story is Amazing!\r\n\r\nGamePlay could have a small adjustment here and there in terms of mechanics Flying , but still incredible to the point of barely noticing.\r\n\r\nThe animals/magical beast are on point! Beautiful and extremely well designed.\r\n\r\nThe sound effects and voice acting is incredible and immersive to the point it feels like I'm truly there in game.\r\n\r\nHogwarts Castle is so well done it feels like it was pulled from my imagination.\r\n\r\nThe Forbidden forest is so incredible and alluring that it actually provides an ominous feeling.\r\n\r\nThe map is so ALIVE and vibrant, it's just stunning.\r\n\r\nI have had no issues in that capacity game play wise or other etc, it has been a smooth and fun ride.\r\n\r\nThe Game itself truly truly felt like coming home.\r\n\r\nGame Mods are also Awesome.\r\n\r\nFully and Completely Recommend playing it!", 0.5541840195655823], ["On certain PC configurations the graphics menu will be completely blank preventing you from changing any graphics related options. This bug was supposedly introduced in the modding update and hasn't been fixed yet. The devs have acknowledged the bug but have gone radio silent on the issue since.\n\nUntil this absolutely massive game breaking bug is fixed I don't recommend this game to anyone. I have refunded my purchase until this is fixed.", 0.5540540814399719], ["A soulless game that sold well solely because it uses one of the most popular IPs out there. It's not really an RPG and is horribly unoptimized, with intrusive Denuvo on top of it.", 0.5386642813682556], ["32 GB of RAMS, settings are all low with decent specs and the RAMS usage increase from 15 GB to 32 GB in about 20 mins of gameplay and then boom, the game crash. Try a lot of thing and nothing works so far. Sad to see an above average gameplay and story in a buggy game and all the thing the devs care is mods, not the game itself is funtional.", 0.5362663865089417], ["If you really want to buy the game, wait for it to be $10 or less because that's about what it's worth.\r\n\r\nCapitalizes on the popularity of the Harry Potter franchise. Graphics and sound design are good and what you'd want in an open world Harry Potter game. The problems with this game are the story, difficulty, puzzles, gear, achievements, and more.\r\n\r\nThe story is just plain boring and the dialogue options have no effect on the outcome of anything. Forget trying to roleplay as anything with the dialogue. \r\n\r\nThe progression and difficulty in the game is one of the worst I've seen from high production value games. There is no sense of getting stronger against enemies in this game and instead, they all scale to your level no matter what. This leads to the problem of the hard difficulty always locking every enemy to 3-5 levels above you. Forget doing side quests to feel stronger against enemies in the main story, the fights will always take the same length no matter what.\r\n\r\nThe puzzles are interesting the first few times you find a new puzzle but once you've seen all 4-5 varieties then you get tired of it all. It doesn't help that the puzzles give you pages which is the easiest way to get XP that I've found on my own. \r\n\r\nThe chests drop gear at your level forcing you to keep opening chests to get better gear. There's nothing special about the gear other than bigger number gives more armor/damage.\r\n\r\nThe achievements are abysmal. \"Collect all the things we scattered around the map to waste time\" \"Play through the entire game in each school to waste more time\" \"Do this mundane task an arbitrary amount of times to waste more time\"", 0.5356565713882446], ["its a great game. ive played it at least 5 times each time a different house!! so cool seeing each of the houses and how they are all so different yet all beautiful in their own way. and the game play is great very immersive!", 0.5343137383460999], ["I enjoyed this game at first, but then I realized just how repetitive it is. It's a by-the-books Ubisoft style open world game with tons of puzzles all across the map and spamming Revelio every 10 seconds. The combat is pretty fun though, even if it is simplistic.\r\n\r\nAdmittedly, I'm not a Harry Potter fan, but even if I was, I'd still be disappointed because you spend most of your time outside Hogwarts (which is really beautiful by the way) and you don't really 'feel' like a student. The rest of the map is dull and boring. The story is also pretty forgettable. At least the graphics are really good.", 0.5343137383460999], ["They intentionally broke the game for \"\"\"unofficial\"\"\" mods and only allow their curated garbage. Very anti-consumer.", 0.5342410802841187], ["This game had such huge potential, and so many people growing up with the Harry Potter series like me probably couldn't wait for it to come out - only to see how childish, repetitive, and unfortunately, quite boring it is. I've tried playing this game, I think three times, and each time, after a few hours, I just uninstalled it.\n\nLet's start with spells. This game is literally about the wizarding world and magic, so I was thinking (probably not only me) how many amazing spells we would be able to use here. Nope - you get like 20-something spells. With bugged mods, you can probably get up to 30. And they're nothing special. If you thought you’d be able to become another young Dumbledore, you're wrong. If you thought this game will beat Skyrim's magic system, you're also wrong. Huge disappointment.\n\nEnemies - nothing special. But that's on me, because personally I love games where I can duel with powerful, human enemies or climb up a ladder made of them, starting with lower bosses and continuing through the game, fighting more and more powerful ones. I had high expectations and can only blame myself for thinking that once I finally got to play a game set in the Harry Potter world, I’d get to face some interesting villains similar to Voldemort or Grindelwald. But no - it's just mean goblins and not-so-evil tiny little poachers who are no match for a fifth-year Hogwarts student and get killed like flies.\n\nRepetitive missions and side \"jobs\" (because they surely can't be called quests): Merlin Trials, those f***ing moths, doors with symbols and other buggers. Reminds too much annoying MMORPG quests like go collect 15 flowers or kill 20 bats. Main quests? Once you did the first trial, you can be sure the rest will be exactly the same, with just slightly more difficult puzzles to solve or bigger stone knights to defeat. Uninteresting.\n\nLast but not least - Hogwarts, praised by many, but in my opinion, it’s just weird and not how it was described or how it should be. From the outside, it looks magnificent, just as it should - after all, they had eight movies and plenty of iconic scenes to draw inspiration from. But inside, it often feels like a strange mix of clashing styles from different eras. In the parts of the castle where they had to design things themselves (instead of directly copying from the films), it ends up looking more like some kind of Rothschild palace from the 18th century. Just weird and out of place. \n\nShortly, in my opinion this game doesn't have a soul. Very disappointing.", 0.5322834849357605], ["Ive had game for a while, since it was on sale a few months back.   On install, there is an OPT OUT option on data mining and selling your data.   Reading deeper, it mines and sells keystrokes, mouse movement, ads you interact with, websites, KEYSTROKES!!!!,  The OPT out site is 3rd party, still need to agree to the opt in to play game.   They claim they will delete any sold data linked to your email.\nDue to this, I immediately uninstalled game!   Cannot play game with this type of data mining imbedded inside.   Doubt ill get a refund since its been owned for more then 2 weeks.   If this is how WB does business, Ill never purchase another WB game again.   Sad, I really wanted to play this game.", 0.5319148898124695], ["This game is like a sheet of cookies that was pulled from the oven too soon. It has the foundation for greatness, but falls short.\n\nSpecial mention goes to the abysmal voice actor for male player characters. Sebastian Croft sounds like he would have rather received an ice pick lobotomy than voice the player character.\n\nIt is also rather funny how hard this game tried to court an audience that was NEVER going to buy this game. I don’t have to mention what demographic it is. You already know what features/additions I mean and what that demographic was.", 0.5314591526985168], ["I played this game so much, but after the mod upgrade I can't even play. Every time I try, a pop up tells me that I can't load because of a mod. I have deleted all mod files, uninstalled and reinstalled the game several times, but nothing works. This is very disappointing due to the amount of hours I could play it previously.", 0.5282469391822815], ["go fuck yourselfs Warner bros. even Bethesda understands free mods keep the game alive", 0.5272077322006226]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/990080/a3cdc6f40d97df8ac993679c2dd1edeb5222421e/header.jpg?t=1744736444", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/990080/1b2e4eeed79dd06971492825a461bc5130bf7c28/capsule_231x87.jpg?t=1744736444", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/990080/1b2e4eeed79dd06971492825a461bc5130bf7c28/capsule_184x69.jpg?t=1744736444"}, "support": {"support_website": null, "support_email": null, "game_website": "https://www.hogwartslegacy.com/"}, "developer": "Avalanche Software", "owners": "10,000,000 .. 20,000,000", "tags": ["Magic", "Open World", "Fantasy", "Singleplayer", "Adventure", "RPG", "Character Customization", "Exploration", "Story Rich", "Third Person", "Action-Adventure", "Atmospheric", "Action RPG", "Action", "Combat", "Choices Matter", "Puzzle", "Great Soundtrack", "Dark", "Family Friendly"], "languages": ["English", " French", " Italian", " German", " Spanish - Spain", " Arabic", " Japanese", " Korean", " Polish", " Portuguese - Brazil", " Russian", " Simplified Chinese", " Spanish - Latin America", " Traditional Chinese"], "concurrent_plays": 10022, "number_of_achievements": 45, "categories": ["シングルプレイヤー", "Steam実績", "フルコントローラサポート", "アプリ内購入", "Steamクラウド", "HDR使用可能", "ファミリーシェアリング"], "genres": ["アクション", "アドベンチャー", "RPG"], "short_description": "『ホグワーツ・レガシー』は、没入感の高いオープンワールド・アクションRPGです。キャラクターを操作して、魔法界を巡るあなただけの冒険を繰り広げましょう。", "long_description": null}