{"name": "iVRy Driver for SteamVR", "app_id": 992490, "platforms": {"windows": true, "mac": false, "linux": false, "controller": "full"}, "price": {"currency": null, "original_price": null, "final_price": null, "discount_percent": null, "is_free": true}, "reviews": {"num_of_reviews": 6, "review_score": 0, "review_decription": "6 user reviews", "positive_reviews": 4, "negative_reviews": 2, "reviews": [["READ THIS!!!   If you are an AMD GPU USER use 22.5.1 Driver othervise VR DIRECT will be broke.\n\nI Bought PSVR and for me there is no need to buy anny other driver software than this one. Works with DCS world but you need ps4 camera and an adapter to usb3 for depth tracking to work.", 0.6066931486129761], ["Can't connect to PICO G2 Even premium version always wait for connection after follow all step never detect hardware both on wifi and usb.", 0.504400372505188], ["I highly recommend that nobody buy this software.  It is worse than other options available, for free or fee, and requires no less tinkering.  The developer is super-toxic and spends his time visiting reviews to tell the reviewer why criticism isn't deserved instead of actually trying to provide a better experience.  There's one guy on the Steam forums he verbally attacked for having a negative review on the Google Play store.  In my case, the XBox One controller doesn't work for the VR-version of Steam (VR Home, etc) and instead of offering up workarounds or his experience or pointing me at a FAQ or anything the obnoxious chap instead vented about how his software was worth way more than I paid and that it wasn't his fault the user-experience was poor and that I should call him daddy, etc. etc.  The reality is, I don't care if it's his fault or not.  The experience of using his software (and his support) was very poor and I cannot recommend it to anyone at any price.  If you have the time to tinker and troubleshoot, go with free options supported by helpful communities.  Definitely skip this product.", 0.43130719661712646], ["This software is a blast to use! It give me so much hope for the future of OpenVR for all!\nAs long as you are willing to do some set up, and make adjustments as you go (for updates), using this software makes VR with a PSVR headset easily possible without viruses from not knowing what you  are doing in the wild west of internet downloading. Thanks Steam for supporting an awesome software company!\nNow hurry up and give me a beta key for PS4 camera stuff. ;)", 0.5], ["Just absolutely amazing!\n\nI've tried a few of these apps, to get my iPhone XS to act as a VR screen with Google Cardboard (or equivalent) headset - this is by far the best. Easy to setup, works flawlessly over WiFi and wired USB connection (via iTunes, I recommend this method, as you can really jack the performance and quality settings up).\nI use it with a £5 Google Cardboard (literally!) headset from Amazon, and my favoured racing sims work perfectly - Project CARS2, Assetto Corsa etc. I can easily read the text on HUD's and car clocks, and the fps is smooth.\n\nI had one problem in setup (my Bonjour service was not running on Windows 10) - I emailed support on a Sunday afternoon, and got a reply an hour later, that sorted it. Top class service.\n\nI also have a PSVR headset, so I reckon I will be trying the driver for that as well! (UPDATE - purchased this as well, and it also works flawlessly, even better!", 0.5], ["FUCKING SUCKS", 0.48466256260871887]]}, "images": {"header_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/992490/header.jpg?t=1728194418", "capsule_image": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/992490/capsule_231x87.jpg?t=1728194418", "capsule_image_v5": "https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/992490/capsule_184x69.jpg?t=1728194418"}, "support": {"support_website": null, "support_email": null, "game_website": "https://twitter.com/iVRy_VR"}, "developer": "Mediator Software", "owners": "200,000 .. 500,000", "tags": ["Utilities", "VR"], "languages": ["English"], "concurrent_plays": 2, "number_of_achievements": null, "categories": ["Full controller support", "In-App Purchases"], "genres": ["Utilities"], "short_description": "Use your iPhone, Android, GearVR, Oculus Mobile or Sony PSVR headset as a Virtual Reality Headset for your PC. Lets you run SteamVR &amp; Oculus Rift PC VR titles without a dedicated PC VR headset.", "long_description": null}